{
  "actors": [
    {
      "id": 1,
      "fullName": "Harrison Ford",
      "birthDate": "1942",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Harrison_Ford_by_Gage_Skidmore_3.jpg/274px-Harrison_Ford_by_Gage_Skidmore_3.jpg",
      "biography": "Harrison Ford was born at the Swedish Covenant Hospital in Chicago, Illinois, on July 13, 1942, to former radio actress Dorothy (née Nidelman) and advertising executive and former actor John William \"Christopher\" Ford. His younger brother, Terence, was born in 1945. Their father was a Catholic of Irish descent, while their mother was an Ashkenazi Jew whose parents were emigrants from Minsk, Belarus, then in the Russian Empire. When asked in which religion he and his brother were raised, Ford jokingly responded \"Democrat\" and more seriously stated that they were raised to be \"liberals of every stripe\". When asked about what influence his Jewish and Irish Catholic ancestry may have had on him, he quipped, \"As a man I've always felt Irish, as an actor I've always felt Jewish.\"\n\nFord was a Boy Scout, achieving the second-highest rank of Life Scout. He worked at Napowan Adventure Base Scout Camp as a counselor for the Reptile Study merit badge. Because of this, he and director Steven Spielberg later decided to depict the young Indiana Jones as a Life Scout in Indiana Jones and the Last Crusade (1989). Ford graduated in 1960 from Maine East High School in Park Ridge, Illinois. His voice was the first student voice broadcast on his high school's new radio station, WMTH, and he was its first sportscaster during his senior year. He attended Ripon College in Ripon, Wisconsin, where he was a philosophy major and a member of the Sigma Nu fraternity. A self-described \"late bloomer\", Ford took a drama class in the final quarter of his senior year to get over his shyness and became fascinated with acting. Ford was expelled from college four days before graduation."
    },
    {
      "id": 2,
      "fullName": "Johnny Depp",
      "birthDate": "1963",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Johnny_Depp_Deauville_2019.jpg/220px-Johnny_Depp_Deauville_2019.jpg",
      "biography": "John Christopher \"Johnny\" Depp II was born on June 9, 1963 in Owensboro, Kentucky, to Betty Sue Palmer (née Wells), a waitress, and John Christopher Depp, a civil engineer. He was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. When he married Lori A. Depp, he took a job as a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor Nicolas Cage, who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, Кошмар на улице Вязов (1984), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger."
    },
    {
      "id": 3,
      "fullName": "Sigourney Weaver",
      "birthDate": "1949",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Sigourney_Weaver_by_Gage_Skidmore_4.jpg/250px-Sigourney_Weaver_by_Gage_Skidmore_4.jpg",
      "biography": "Susan Alexandra Weaver was born in New York City on October 8, 1949. Her mother, Elizabeth Inglis (born Desiree Mary Lucy Hawkins), was a British actress and a native of Colchester, England. Weaver's father, Sylvester \"Pat\" Weaver Jr., was an American television executive born in Los Angeles, who served as president of NBC from 1953 to 1955 and created NBC's Today Show in 1952. Pat's brother, Winstead \"Doodles\" Weaver, was a comedian and contributor to Mad. Her father's American family was of Dutch, English, Scots-Irish, and Scottish ancestry.\n\nAt the age of 14, Weaver began using the name Sigourney, taking it from a minor character in The Great Gatsby. She briefly attended the Brearley School and Chapin School in New York before arriving at the Ethel Walker School (Walker's) in Simsbury, Connecticut, where she developed an early interest in performance art.One of her early roles was in a school adaptation of the poem \"The Highwayman\", and on another occasion she played a Rudolph Valentino character in an adaptation of The Sheik. She was also involved in theatrical productions of A Streetcar Named Desire and You Can't Take It with You during one summer at Southbury, Connecticut. Weaver reportedly reached the height of 179 cm (5 ft 10 in) by the age of 11, which had a negative impact on her self-esteem. She recalled feeling like \"a giant spider\" and never having \"the confidence to ever think I could act."
    },
    {
      "id": 4,
      "fullName": "Phoebe Waller-Bridge",
      "birthDate": 1985,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Nicola_Benedetti_Humza_Yousaf_Phoebe_Waller-Bridge_-_All_Festivals_Reception_%28Waller-Bridge_cropped%29_%28cropped%29.jpg/440px-Nicola_Benedetti_Humza_Yousaf_Phoebe_Waller-Bridge_-_All_Festivals_Reception_%28Waller-Bridge_cropped%29_%28cropped%29.jpg",
      "biography": "Phoebe Mary Waller-Bridge (born 14 July 1985) is an English actress, screenwriter and producer. As the creator, head writer, and star of the comedy series Fleabag (2016–2019), she won three Primetime Emmy Awards, two Golden Globes and a British Academy Television Award. She received further Emmy and Golden Globe nominations for writing and producing the spy thriller series Killing Eve (2018–2022).\n\nWaller-Bridge has also created, written, and starred in the comedy series Crashing (2016). She has also acted in the comedy series The Café (2011–2013), in the second season of Broadchurch (2015), and in the films Albert Nobbs (2011), The Iron Lady (2011), Goodbye Christopher Robin (2017), and Solo: A Star Wars Story (2018). She contributed to the screenplay of the James Bond film No Time to Die (2021) and starred in the adventure film Indiana Jones and the Dial of Destiny (2023).\n\nPhoebe Mary Waller-Bridge was born in Hammersmith, London, on 14 July 1985, the daughter of Michael Cyprian Waller-Bridge, founder of the electronic trading platform Tradepoint, and Theresa Mary, daughter of Sir John Edward Longueville Clerke, 12th Baronet, employed by the Worshipful Company of Ironmongers. The Bridge, later Waller-Bridge, family were soldiers and clergymen, who came to rank among the landed gentry of Cuckfield in Sussex. Her grandfather, Cyprian Waller-Bridge (1918-1960), \"a Wodehousian sort of character... 'the eccentric son of an eccentric vicar'\", was an actor and BBC announcer. On her father's side, she is a descendant of the Revd Sir Egerton Leigh, 2nd Baronet, and a distant relative of politician and author Egerton Leigh, Conservative MP for Mid Cheshire from 1873 to his death in 1876.\n\nWaller-Bridge grew up in Ealing in London and has two siblings: an older sister, Isobel Waller-Bridge, a composer, with whom she has collaborated; and a younger brother, Jasper. Her parents are divorced. She was educated at St Augustine's Priory, a Catholic independent school for girls, followed by the independent sixth form college DLD College London in the Marylebone area of London. She graduated from the Royal Academy of Dramatic Art in London."
    },
    {
      "id": 5,
      "fullName": "Mads Mikkelsen",
      "birthDate": 1965,
      "nationality": "Denmark",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Mads_Mikkelsen_by_Gage_Skidmore_2.jpg/440px-Mads_Mikkelsen_by_Gage_Skidmore_2.jpg",
      "biography": "Mads Dittmann Mikkelsen (born 22 November 1965) is a Danish actor, former gymnast and dancer. He rose to fame in Denmark as an actor for his roles such as Tonny in the first two films of the Pusher film trilogy (1996, 2004), Detective Sergeant Allan Fischer in the television series Rejseholdet (2000–2004), Niels in Open Hearts (2002), Svend in The Green Butchers (2003), Ivan in Adam's Apples (2005) and Jacob Petersen in After the Wedding (2006).\n\nMikkelsen achieved worldwide recognition for playing the main antagonist Le Chiffre in the twenty-first James Bond film, Casino Royale (2006). His other film roles include Igor Stravinsky in Coco Chanel & Igor Stravinsky (2008), Johann Friedrich Struensee in A Royal Affair (2012), his Cannes Film Festival Best Actor Award-winning performance as Lucas in the Danish film The Hunt (2012), Kaecilius in Marvel's Doctor Strange (2016), Galen Erso in Lucasfilm's Rogue One (2016), his BAFTA-nominated role as Martin in Another Round (2020), Gellert Grindelwald in Fantastic Beasts: The Secrets of Dumbledore (2022), Dr Jürgen Voller in Indiana Jones and the Dial of Destiny (2023), and Captain Ludwig Kahlen in The Promised Land (2023). Outside of film, he is known for his roles as Dr. Hannibal Lecter in the television series Hannibal (2013–2015) and Cliff Unger in Hideo Kojima's video game Death Stranding (2019).\n\nA. O. Scott of The New York Times remarked that in the Hollywood scene, Mikkelsen has \"become a reliable character actor with an intriguing mug\" but stated that on the domestic front \"he is something else: a star, an axiom, a face of the resurgent Danish cinema\"."
    },
    {
      "id": 6,
      "fullName": "Shia LaBeouf",
      "birthDate": 1986,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Shia_LaBeouf_2022.jpg/440px-Shia_LaBeouf_2022.jpg",
      "biography": "Shia Saide LaBeouf (born June 11, 1986) is an American actor, performance artist, and filmmaker. He played Louis Stevens in the Disney Channel series Even Stevens, a role for which he received Young Artist Award nominations in 2001 and 2002 and won a Daytime Emmy Award in 2003. He made his film debut in The Christmas Path (1998). In 2004, he made his directorial debut with the short film Let's Love Hate and later directed a short film titled Maniac (2011), starring American rappers Cage and Kid Cudi.\n\nIn 2007, LaBeouf starred in the commercially successful films Disturbia and Surf's Up. From 2007 to 2011, LaBeouf starred in the film Transformers and its sequels Transformers: Revenge of the Fallen and Transformers: Dark of the Moon, playing protagonist Sam Witwicky. The three films were commercially successful. In 2008, he played Henry \"Mutt Williams\" Jones III in Indiana Jones and the Kingdom of the Crystal Skull.\n\nHis other credits include the films Holes (2003), Constantine (2005), Wall Street: Money Never Sleeps (2010), Lawless (2012), The Company You Keep (2012), Nymphomaniac (2013), Charlie Countryman (2013), Fury (2014), American Honey (2016), Borg vs McEnroe (2017), Honey Boy (2019), The Peanut Butter Falcon (2019), Pieces of a Woman (2020), and Padre Pio (2022).\n\nSince 2014, LaBeouf has pursued a variety of public performance art projects with LaBeouf, Rönkkö & Turner."
    },
    {
      "id": 7,
      "fullName": "Karen Allen",
      "birthDate": 1951,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Karenallen17_cropped.jpg",
      "biography": "Allen was born on October 5, 1951, in Carrollton, Illinois, to Ruth Patricia (née Howell) (1927–2020), a university professor, and Carroll Thompson Allen (1925–2015), an FBI agent. She is of English, Irish, Scottish, and Welsh descent. Her father's job forced the family to move often. \"I grew up moving almost every year and so I was always the new kid in school and always, in a way, was deprived of ever really having any lasting friendships\", Allen said in 1987. Although Allen says her father was very much involved in the family, she felt that she and her two sisters grew up in a very female-dominated household.\n\nAfter she graduated from DuVal High School, in Lanham, Maryland, at 17, she moved to New York City to study art and design at Fashion Institute of Technology for two years. Allen later ran a boutique on the University of Maryland campus and spent time traveling through South and Central Asia. She attended George Washington University and began to study and perform with the experimental company, the Washington Theatre Laboratory, in Washington, D.C. In 1974, Allen joined Shakespeare & Company in Massachusetts. Three years later, she moved back to New York City and studied at the Lee Strasberg Theater Institute.\n\nHer critical and commercial breakthrough came when she portrayed Marion Ravenwood opposite Harrison Ford in Raiders of the Lost Ark (1981), for which she won the Saturn Award for Best Actress. She later co-starred in Shoot the Moon (1982), Starman (1984), for which she was again nominated for the Saturn Award for Best Actress, and Scrooged (1988). She has also received recognition for her work in The Glass Menagerie (1987), Year by the Sea (2016), and Colewell (2019). She reprised her role as Marion Ravenwood in Indiana Jones and the Kingdom of the Crystal Skull (2008) and Indiana Jones and the Dial of Destiny (2023)."
    },
    {
      "id": 8,
      "fullName": "Tom Skerritt",
      "birthDate": 1933,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Tom_Skerritt_2014_%28cropped%29.jpg/440px-Tom_Skerritt_2014_%28cropped%29.jpg",
      "biography": "Thomas Roy Skerritt (born August 25, 1933) is an American actor who has appeared in over 40 films and more than 200 television episodes since 1962. He is known for his film roles in M*A*S*H, Alien, The Dead Zone, Top Gun, A River Runs Through It, Poltergeist III, and Up in Smoke, and the television series Picket Fences and Cheers. Skerritt has earned several nominations and awards, including winning the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series in 1993 for Picket Fences.\n\nSkerritt was born in Detroit, Michigan, the son of Helen, a homemaker, and Roy Skerritt, a businessman. He is the youngest of three children. A 1951 graduate of Detroit's Mackenzie High School, Skerritt attended Wayne State University and the University of California, Los Angeles.\n\nSkerritt enlisted just after graduating from high school, and served a four-year tour of duty in the United States Air Force as a classifications specialist. Most of his enlistment was spent at Bergstrom Field, Austin, Texas."
    },
    {
      "id": 9,
      "fullName": "Veronica Cartwright",
      "birthDate": 1949,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Veronica_Cartwright_2022.jpg/440px-Veronica_Cartwright_2022.jpg",
      "biography": "Veronica Cartwright (born April 20, 1949) is a British-born American actress. She is known for appearing in science fiction and horror films, and has earned numerous accolades, including three Primetime Emmy Award nominations. Her younger sister is actress Angela Cartwright.\n\nAs a child actress, Cartwright appeared in supporting roles in The Children's Hour and The Birds, the latter of which was her first commercial success. She made her transition into mainstream, mature roles with 1978's Invasion of the Body Snatchers. She played Lambert in the science-fiction horror film Alien, which earned her recognition and a Saturn Award for Best Supporting Actress, and additionally appeared in the films The Right Stuff and The Witches of Eastwick which earned her praise. In the 1990s, she received three nominations for the Primetime Emmy Award for Outstanding Guest Actress in a Drama Series, one of which was for her role on ER and two of which were for her role in The X-Files.\n\nCartwright was born in Bristol, England, and grew up in Los Angeles, having emigrated to the US shortly after the birth of her younger sister, actress Angela Cartwright."
    },
    {
      "id": 10,
      "fullName": "John Hurt",
      "birthDate": 1940,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/John_Hurt_at_the_2009_Tribeca_Film_Festival.jpg/440px-John_Hurt_at_the_2009_Tribeca_Film_Festival.jpg",
      "biography": "John Vincent Hurt was born on January 22, 1940, in Chesterfield, Derbyshire, the son of Phyllis (née Massey; 1907–1975), an engineer and one-time actress, and Arnold Herbert Hurt (1904–1999), a mathematician who became a Church of England clergyman and served as vicar of Holy Trinity Church in Shirebrook, Derbyshire. His father was previously vicar of St John's parish in Sunderland, County Durham. In 1937, he moved his family to Derbyshire, where he became Perpetual Curate of Holy Trinity Church. When Hurt was five, his father became the vicar of St Stephen's Church in Woodville, Derbyshire, and remained there until 1953.\n\nAt the age of eight, Hurt was sent to the Anglican St Michael's Preparatory School in Otford, Kent, where he eventually developed his passion for acting. He decided he wanted to become an actor after his first role as a girl in a school production of The Blue Bird by Maurice Maeterlinck. Hurt stated that a senior master at the school would abuse him and others by removing his two false front teeth and putting his tongue in the boys' mouths, as well as rubbing their faces with his stubble, and that the experience affected him hugely. Hurt, aged 12, became a boarder at Lincoln School (then a grammar school) because he had failed the entrance examination for admission to his brother's school. His headmaster at Lincoln School laughed when Hurt told him he wanted to be an actor, telling him, \"Well, you may be all right in school plays but you wouldn't stand a chance in the profession.\"\n\nHurt reprised his role as Quentin Crisp in An Englishman in New York (2009), which brought his seventh BAFTA nomination. He portrayed an incarnation of the Doctor known as the War Doctor in Doctor Who. He voiced roles in Watership Down (1978), The Lord of the Rings (1978), The Plague Dogs (1982), The Black Cauldron (1985), Dogville (2003), Valiant (2005) and BBC's Merlin (2008–2012), as well as The Gruffalo's Child (2011), and Thomas & Friends: Sodor's Legend of the Lost Treasure (2015)."
    },
    {
      "id": 11,
      "fullName": "Ian Holm",
      "birthDate": 1931,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Ian_Holm.jpg/440px-Ian_Holm.jpg",
      "biography": "Ian Holm Cuthbert was born on 12 September 1931 in Goodmayes, Essex, to Scottish parents, James Cuthbert and his wife Jean (née Holm). His father was a psychiatrist who worked as the superintendent of the West Ham Corporation Mental Hospital and was one of the pioneers of electric shock therapy; his mother was a nurse. He had an older brother, who died when Ian was 12 years old. Holm was educated at the independent Chigwell School in Essex. His parents retired to Mortehoe in Devon and then to Worthing, where he joined an amateur dramatic society.\n\nA chance encounter with Henry Baynton, a well-known provincial Shakespearean actor, helped Holm train for admission to the Royal Academy of Dramatic Art, where he secured a place from 1950. His studies were interrupted a year later when he was called up for National Service in the British Army, during which he was posted to Klagenfurt, Austria, and attained the rank of Lance Corporal. They were interrupted a second time when he volunteered to go on an acting tour of the United States in 1952. Holm graduated from the Royal Academy of Dramatic Art in 1953.\n\nHe made his stage debut in 1954, at Stratford-upon-Avon, playing a spear carrier in a staging of Othello. Two years later, he made his London stage debut in Love Affair.\n\nHolm won the 1967 Tony Award for Best Featured Actor for his performance as Lenny in the Harold Pinter play The Homecoming. He won the Laurence Olivier Award for Best Actor for his performance in the title role in the 1998 West End production of King Lear. For his television roles he received two Primetime Emmy Awards for King Lear (1998), and the HBO film The Last of the Blonde Bombshells (2003).\n\nHe gained acclaim for his role in The Bofors Gun (1968) winning the BAFTA Award for Best Actor in a Supporting Role. He was nominated for an Academy Award for Best Supporting Actor, and won a second BAFTA Award for his role as athletics trainer Sam Mussabini in Chariots of Fire (1981). Other notable films he appeared in include Alien (1979), Brazil (1985), Henry V (1989), Naked Lunch (1991), The Madness of King George (1994), The Fifth Element (1997), The Sweet Hereafter (1997), and The Aviator (2004). He played Napoleon in three different films. He gained wider appreciation for his role as the elderly Bilbo Baggins in Peter Jackson's The Lord of the Rings and The Hobbit trilogies."
    },
    {
      "id": 12,
      "fullName": "Bill Paxton",
      "birthDate": 1955,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Bill_Paxton_by_Gage_Skidmore.jpg/440px-Bill_Paxton_by_Gage_Skidmore.jpg",
      "biography": "Paxton was born in Fort Worth, Texas, on May 17, 1955, the son of Mary Lou (née Gray; 1926–2016) and John Lane Paxton (1920–2011). His mother was a Roman Catholic who raised him and his siblings in her faith. His father was a businessman, lumber wholesaler, museum executive, and (during his son's career) an occasional actor, notably appearing in Sam Raimi's Spider-Man films as Bernard Houseman and alongside Paxton in A Simple Plan (1998). Paxton was of Austrian, Dutch, English, French, German, Norwegian, Irish, Scotch-Irish, Scottish, Swiss, and Welsh descent. His great-great-grandfather was Elisha Franklin Paxton (1828–1863), a brigadier general in the Confederate Army during the Civil War who was killed commanding the Stonewall Brigade at the Battle of Chancellorsville.\n\nPaxton is distantly related to actress Sara Paxton and was the great-nephew of Mary Paxton Keeley, a prominent journalist and close friend of Bess Truman. At the age of eight, he was in the crowd when President John F. Kennedy emerged from the Hotel Texas in Fort Worth on the morning of his assassination on November 22, 1963. Photographs of Paxton being lifted above the crowd are on display at the Sixth Floor Museum at Dealey Plaza in Dallas, Texas. He later co-produced the film Parkland about the assassination. He graduated from Arlington Heights High School in Fort Worth in 1973, after which he studied at Richmond College in London, alongside his old high-school friend Danny Martin. There, they met fellow Texas native Tom Huckabee, with whom they made Super 8 short films for which they built their own sets. One of Paxton's first lead roles was in Huckabee's experimental film Taking Tiger Mountain. Paxton subsequently moved to Los Angeles, where he worked in props and art departments and as a parking valet at the Beverly Hills Hotel. After being rejected by film schools in Southern California, he switched his ambitions from directing to acting."
    },
    {
      "id": 13,
      "fullName": "Michael Biehn",
      "birthDate": 1956,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Michael_Biehn_by_Gage_Skidmore.jpg/440px-Michael_Biehn_by_Gage_Skidmore.jpg",
      "biography": "Michael Biehn (born July 31, 1956) is an American actor, primarily known for his roles in science fiction films directed by James Cameron; as Sgt. Kyle Reese in The Terminator (1984), Cpl. Dwayne Hicks in Aliens (1986), and Lt. Coffey in The Abyss (1989). His other films include The Fan (1981), The Seventh Sign (1988), Navy SEALs (1990), Tombstone (1993), The Rock (1996), Mojave Moon (1996), Megiddo: The Omega Code 2 (2001), Clockstoppers (2002), and Planet Terror (2007). On television, he has appeared in Hill Street Blues (1984), The Magnificent Seven (1998–2000), and Adventure Inc. (2002–2003). Biehn received a Best Actor Saturn Award nomination for Aliens.\n\nBiehn was born in Anniston, Alabama, the second of three boys born to Marcia (née Connell) and Don Biehn, a lawyer. He is of German, English, Irish and Scottish descent; his surname is of German origin.\n\nWhen he was young, he moved with his family to Lincoln, Nebraska, and then to Lake Havasu City, Arizona, where he was a member of the high school drama club before graduating. He attended the drama program at the University of Arizona, where he was a member of the Sigma Nu fraternity before moving to Hollywood."
    },
    {
      "id": 14,
      "fullName": "Lance Henriksen",
      "birthDate": 1940,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Lance_Henriksen_by_Gage_Skidmore.jpg/440px-Lance_Henriksen_by_Gage_Skidmore.jpg",
      "biography": "Henriksen was born on May 5, 1940, in Manhattan, New York. His father, James Henriksen, was a Norwegian merchant sailor and boxer nicknamed \"Icewater\" who spent most of his life at sea, while his mother, Margueritte Werner, struggled to find work as a dance instructor, waitress and model. His parents divorced when he was two years old, and his mother struggled to raise him and his brother, leading to his spending part of his childhood in foster care. During an interview, Henriksen recounted how, at the age of seven, his mother handed him his birth certificate and said, \"You'll always know who you are\", then pushed him out of his home. Henriksen did not actually leave home until he was 12, saying he'd \"had enough\" of his home life, and that he had been physically assaulted by multiple family members: \"I got bludgeoned a lot. Different people, relatives. I remember every single face from my childhood. My alcoholic uncles, whoever. I'm not having a pity party here; I'm not Quasimodo. That's just how it was\". On another occasion, two of his uncles tried to persuade him to take Methadrine and then take part in a staged car accident for the insurance money.\n\nGrowing up, Henriksen had a reputation for getting into trouble in the various schools he attended, and even spent time in a children's home. He left school after completing first grade, and was illiterate until the age of 30."
    },
    {
      "id": 15,
      "fullName": "Jenette Goldstein",
      "birthDate": 1960,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Jenette_Goldstein_Comic_Con_2023_%28cropped%29.jpg/440px-Jenette_Goldstein_Comic_Con_2023_%28cropped%29.jpg",
      "biography": "Jenette Elise Goldstein (born February 4, 1960) is an American actress. She is known for starring as Private Vasquez in the sci-fi horror film Aliens (1986), which won her the Saturn Award for Best Supporting Actress. She also played Diamondback in Near Dark (1987) which earned her a second Saturn Award nomination, Megan Shapiro in Lethal Weapon 2 (1989) and Janelle Voight in Terminator 2 (1991). She made cameo appearances in Star Trek Generations (1994) and Titanic (1997) and appeared in two episodes of the television series Star Trek: Short Treks (2019).\n\nGoldstein was born in Los Angeles, California, and raised in Beverly Hills. Her family is from Russia, Morocco, and Brazil. Goldstein trained to be a gymnast before she started her acting career."
    },
    {
      "id": 16,
      "fullName": "Keira Knightley",
      "birthDate": 1985,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/b/b1/KeiraKnightleyByAndreaRaffin2011_%28cropped%29.jpg",
      "biography": "Keira Christina Knightley OBE (born 26 March 1985) is an English actress. Known for her work in independent films and blockbusters, particularly period dramas, she has received numerous accolades, including nominations for two Academy Awards, two BAFTAs, three Golden Globes, and a Laurence Olivier Award. In 2018, she was appointed an OBE at Buckingham Palace for services to drama and charity.\n\nBorn in London to actors Will Knightley and Sharman Macdonald, Knightley obtained an agent at age six and initially worked in commercials and television films. Following a minor role as Sabé in Star Wars: Episode I – The Phantom Menace (1999), her breakthrough came when she played a tomboy footballer in Bend It Like Beckham (2002) and co-starred in Love Actually (2003). She went on to achieve global recognition for playing Elizabeth Swann in the Pirates of the Caribbean film series (2003–2007, 2017).\n\nFor her portrayal of Elizabeth Bennet in Pride & Prejudice (2005), Knightley was nominated for the Academy Award for Best Actress. She starred in several more period films over the next few years, including Atonement (2007), The Duchess (2008), A Dangerous Method (2011), and Anna Karenina (2012). She then forayed into contemporary pieces, with headline parts in Seeking a Friend for the End of the World (2012), Begin Again (2013), and Jack Ryan: Shadow Recruit (2014). Knightley returned to historical films playing Joan Clarke in The Imitation Game (2014), earning a nomination for the Academy Award for Best Supporting Actress. She later starred as the title character in Colette (2018) and journalist Loretta McLaughlin in Boston Strangler (2023).\n\nOn stage, Knightley has appeared in two West End productions: The Misanthrope in 2009, which earned her an Olivier Award nomination, and The Children's Hour in 2011. She also starred as the titular heroine in the 2015 Broadway production of Thérèse Raquin. Knightley is known for her outspoken stance on social issues and has worked extensively with Amnesty International, Oxfam, and Comic Relief. She is married to musician James Righton, with whom she has two daughters."
    },
    {
      "id": 17,
      "fullName": "Orlando Bloom",
      "birthDate": 1977,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Orlando_Bloom_Cannes_2013.jpg/440px-Orlando_Bloom_Cannes_2013.jpg",
      "biography": "Orlando Jonathan Blanchard Copeland Bloom (born 13 January 1977) is an English actor. He made his breakthrough as the character Legolas in The Lord of the Rings film series (2001–03). He reprised his role in The Hobbit film series (2013–14). Considered by some to be the Errol Flynn of his time, he gained further notice appearing in epic fantasy, historical, and adventure films, notably as Will Turner in the Pirates of the Caribbean film series (2003–07, 2017), Paris in Troy (2004), Balian de Ibelin in Kingdom of Heaven (2005), and the Duke of Buckingham in The Three Musketeers (2011).\n\nBloom appeared in Hollywood films such as the war film Black Hawk Down (2001), the Australian Western Ned Kelly (2003), the romantic comedy Elizabethtown (2005), and New York, I Love You (2007). In 2020 he gained acclaim for the Afghanistan War drama film The Outpost (2020). He also starred in the Amazon Prime Video series Carnival Row (2019–2023).\n\nHe made his professional stage debut in In Celebration at the Duke of York's Theatre in the West End in 2007 and starred in a Broadway adaptation of William Shakespeare's Romeo and Juliet in 2013. He returned to the theatre in a West End revival of Tracy Letts' Killer Joe in 2018. In 2009, Bloom was named a UNICEF Goodwill Ambassador. In 2015 he received the BAFTA Britannia Humanitarian Award."
    },
    {
      "id": 18,
      "fullName": "Geoffrey Rush",
      "birthDate": 1951,
      "nationality": "Australia",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Geoffrey_Rush_Final_Portrait_Red_Carpet_Berlinale_2017_01_%28cropped%29.jpg/440px-Geoffrey_Rush_Final_Portrait_Red_Carpet_Berlinale_2017_01_%28cropped%29.jpg",
      "biography": "Geoffrey Roy Rush AC (born 6 July 1951) is an Australian actor. Known for often playing eccentric roles on both stage and screen, he has received numerous accolades, including an Academy Award, a Primetime Emmy Award and a Tony Award, making him the only Australian to achieve the Triple Crown of Acting, in addition to three BAFTA Awards and two Golden Globe Awards. Rush is the founding president of the Australian Academy of Cinema and Television Arts and was named the 2012 Australian of the Year.\n\nRush began his professional acting career with the Queensland Theatre Company in 1971. He studied for two years at the L'École Internationale de Théâtre Jacques Lecoq starting in 1975. Rush starred in international productions of Waiting for Godot, The Winter's Tale and The Importance of Being Earnest. He made his Broadway debut in the absurdist comedy Exit the King in 2009, where he received a Tony Award for Best Actor in a Play for his performance. He received a nomination for Drama Desk Award for Outstanding Actor in a Play for Diary of a Madman in 2011.\n\nHe gained prominence for his role in Shine (1996), for which he won an Academy Award for Best Actor. His other Oscar-nominated roles were for Shakespeare in Love (1998), Quills (2000), and The King's Speech (2010). Rush gained mainstream popularity for his role as Captain Hector Barbossa in the Pirates of the Caribbean franchise (2003–2017). His other notable films include in Elizabeth (1998), Les Misérables (1998), Frida (2002), Finding Nemo (2003), Intolerable Cruelty (2003), Munich (2005), Elizabeth: The Golden Age (2007) and The Book Thief (2013).\n\nRush is also known for his performances in television receiving Primetime Emmy Award for Outstanding Lead Actor in a Limited or Anthology Series or Movie nominations for his portrayals of comedian Peter Sellers in the HBO film The Life and Death of Peter Sellers (2004), and scientist Albert Einstein in National Geographic anthology series Genius (2017), winning for the former."
    },
    {
      "id": 19,
      "fullName": "Kevin McNally",
      "birthDate": 1956,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Kevin_McNally_by_Gage_Skidmore.jpg/440px-Kevin_McNally_by_Gage_Skidmore.jpg",
      "biography": "McNally was born in Bristol. McNally spent his early years in Birmingham, attending Redhill Junior School in Hay Mills and Mapledene Junior School (now Mapledene Primary School) in Sheldon. He went to Central Grammar School for Boys on Gressel Lane in Tile Cross.\n\nMcNally's first professional acting work, at age 16, was at the Birmingham Repertory Theatre. In 1973 he received a scholarship to attend the Royal Academy of Dramatic Art where, in 1975, he won the Best Actor Bancroft Gold Medal.\n\nIn 1976, he appeared in BBC's I, Claudius and, in 1977, was a regular in the second series of Poldark playing Drake Carne, younger brother of Demelza Poldark. From 1991 to 1994, he wrote nine episodes of Minder, under the pseudonym Kevin Sperring, with writing partner Bernard Dempsey. He also wrote two episodes of Boon, and two episodes of Lock, Stock with Dempsey.\n\nMcNally played Joshamee Gibbs in the Pirates of the Caribbean films. He is one of only three actors who appear in all five films, and reprised the role in Kingdom Hearts III, making him the only actor from the film series to reprise a role in Kingdom Hearts. He also reprised the role in 2021 for Sea of Thieves' \"A Pirate's Life\" Tall Tale series.\n\nAlong with fellow British actors Ian McNeice and Kenneth Branagh, McNally appeared in two Second World War films, Valkyrie and Conspiracy, that depict behind the scenes activities of high-ranking officials in Nazi Germany.\n\nIn 2011, he was cast in the American television series Supernatural as Frank. In 2012, he performed as a voice actor for the best selling videogame Assassin's Creed III, providing the likeness and voice of the character of Robert Faulkner. In 2013, he began working on a science-fiction animation project, Starship Goldfish.\n\nIn 2014, he played the lead role in re-recorded radio plays of five lost episodes of Hancock's Half Hour for BBC Radio 4. Following this, a further video episode was re-recorded and broadcast on BBC Four as part of the Lost Sitcoms series.\n\nFrom 2014 to 2017, McNally played Judge Richard Woodhull of Setauket, Long Island, in the AMC series Turn: Washington's Spies. In July 2019, he guest-starred as Inspector Grandjean in Season 2, Episode 1 of Amazon's mystery series Maigret.\n\nIn 2019, McNally portrayed Captain Mainwaring in a series of re-enactments of otherwise lost episodes of the sitcom Dad's Army."
    },
    {
      "id": 20,
      "fullName": "Elijah Wood",
      "birthDate": 1981,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Elijah_Wood_%2847955397556%29_%28cropped%29.jpg/440px-Elijah_Wood_%2847955397556%29_%28cropped%29.jpg",
      "biography": "Elijah Jordan Wood (born January 28, 1981) is an American actor and producer. He rose to international fame for his portrayal of Frodo Baggins in The Lord of the Rings film trilogy (2001–2003) and The Hobbit: An Unexpected Journey (2012).\n\nWood made his film debut with a small part in Back to the Future Part II (1989). He went on to achieve recognition as a child actor with multiple roles such as Avalon (1990) and The Good Son (1993). As a teenager, he starred in several films including North (1994), Flipper (1996), and The Ice Storm (1997). Following the success of The Lord of the Rings, Wood has appeared in a wide range of films, including Eternal Sunshine of the Spotless Mind (2004), Paris, je t'aime (2006), and I Don't Feel at Home in This World Anymore (2017).\n\nWood's voice roles include Mumble in the Happy Feet film franchise (2006–2011), the title protagonist in 9 (2009), Spyro the Dragon in the Legend of Spyro video game trilogy (2006–2008), Beck on Disney XD's Tron: Uprising (2012–2013), Sigma in Season 10 of Red vs. Blue, and Wirt in the Cartoon Network miniseries Over the Garden Wall (2014). He played Ryan Newman on the FX dark comedy series Wilfred (2011–2014), for which he received a Satellite Award nomination for Best Actor, and Todd Brotzman in the BBC America series Dirk Gently's Holistic Detective Agency (2016–2017).\n\nWood founded the record label Simian Records in 2005, which was dissolved in 2015. He directed the 2007 music video \"Energy\" for The Apples in Stereo. In 2010, Wood co-founded a film production company for horror films, The Woodshed, renamed SpectreVision in 2013. Wood is a disc jockey, and has toured globally with his friend Zach Cowie as the duo Wooden Wisdom."
    },
    {
      "id": 21,
      "fullName": "Ian McKellen",
      "birthDate": 1939,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/SDCC13_-_Ian_McKellen.jpg/440px-SDCC13_-_Ian_McKellen.jpg",
      "biography": "Sir Ian Murray McKellen CH CBE (born 25 May 1939) is an English actor. With a career spanning more than sixty years, he is noted for his roles on the screen and stage in genres ranging from Shakespearean dramas and modern theatre to popular fantasy and science fiction. He is regarded as a British cultural icon and was knighted by Queen Elizabeth II in 1991. He has received numerous accolades, including a Tony Award, six Olivier Awards, and a Golden Globe Award as well as nominations for two Academy Awards, five BAFTA Awards and five Emmy Awards.\n\nMcKellen made his stage debut in 1961 at the Belgrade Theatre as a member of its repertory company, and in 1965 made his first West End appearance. In 1969, he was invited to join the Prospect Theatre Company to play the lead parts in Shakespeare's Richard II and Marlowe's Edward II. In the 1970s McKellen became a stalwart of the Royal Shakespeare Company and the National Theatre of Great Britain. He has earned five Olivier Awards for his roles in Pillars of the Community (1977), The Alchemist (1978), Bent (1979), Wild Honey (1984), and Richard III (1995). McKellen made his Broadway debut in The Promise (1965). He went on to receive the Tony Award for Best Actor in a Play for his role as Antonio Salieri in Amadeus (1980). He was further nominated for Ian McKellen: Acting Shakespeare (1984). He returned to Broadway in Wild Honey (1986), Dance of Death (1990), No Man's Land (2013), and Waiting for Godot (2013), the latter being a joint production with Patrick Stewart.\n\nMcKellen achieved worldwide fame for his film roles, including the titular King in Richard III (1995), James Whale in Gods and Monsters (1998), Magneto in the X-Men films, and Gandalf in The Lord of the Rings (2001–2003) and The Hobbit (2012–2014) trilogies. Other notable film roles include A Touch of Love (1969), Plenty (1985), Six Degrees of Separation (1993), Restoration (1995), Mr. Holmes (2015), and The Good Liar (2019)."
    },
    {
      "id": 22,
      "fullName": "Viggo Mortensen",
      "birthDate": 1958,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Viggo_Mortensen_B_%282020%29.jpg/440px-Viggo_Mortensen_B_%282020%29.jpg",
      "biography": "Viggo Peter Mortensen Jr. R (born October 20, 1958) is an American actor, musician, and filmmaker. He is the recipient of various accolades, including nominations for three Academy Awards for Best Actor, three BAFTA Awards, four Golden Globe Awards, and an Independent Spirit Award.\n\nBorn in New York City and raised mainly in Argentina and Denmark, Mortensen made his film debut in a small role in Peter Weir's 1985 thriller Witness. He went on to play supporting roles in several notable films during the 1990s, including The Indian Runner (1991), Carlito's Way (1993), Crimson Tide (1995), Daylight (1996), The Portrait of a Lady (1996), G.I. Jane (1997), A Perfect Murder (1998), A Walk on the Moon (1999), and 28 Days (2000).\n\nMortensen gained international attention for playing Aragorn in the fantasy trilogy The Lord of the Rings (2001–2003). He gained acclaim for his collaborations with filmmaker David Cronenberg in the thrillers A History of Violence (2005), Eastern Promises (2007), for which he was nominated for the Academy Award for Best Actor, and A Dangerous Method (2011). He gained additional Academy Award nominations for his leading roles as an anarchist father in Captain Fantastic (2016) and as Tony Lip in Green Book (2018). Mortensen made his directorial debut with Falling (2020), in which he also starred, and which was nominated for the Goya Award for Best European Film.\n\nAside from acting, Mortensen has explored fine arts, photography, poetry, and music. In 2002, he founded the Perceval Press to publish both his works and the works of little-known artists and authors. Mortensen sang and composed for part of The Lord of the Rings soundtrack and has collaborated with guitarist Buckethead on several albums."
    },
    {
      "id": 23,
      "fullName": "Kate Capshaw",
      "birthDate": 1984,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Kate_Capshaw%2C_actress.jpg/440px-Kate_Capshaw%2C_actress.jpg",
      "biography": "Kathleen Sue Spielberg (born November 3, 1953), known professionally as Kate Capshaw, is a retired American actress and painter. She is best known for her portrayal of Willie Scott, an American nightclub singer and performer in Indiana Jones and the Temple of Doom (1984), directed by her eventual husband Steven Spielberg. Since then, she starred in Dreamscape (1984), Power (1986), SpaceCamp (1986), Black Rain (1989), Love Affair (1994), Just Cause (1995), and The Love Letter (1999). Her portraiture work has been shown in the Smithsonian National Portrait Gallery.\n\nCapshaw was born Kathleen Sue Nail, the daughter of Edwin L. Nail, an airline employee. She moved to St. Louis, Missouri, at the age of five, and graduated from Hazelwood Senior High School in 1972. Capshaw earned a degree in education from the University of Missouri, where she was a member of Alpha Delta Pi. She taught Special Education at Southern Boone High School in Ashland, Missouri, and Rock Bridge High School in Columbia, Missouri.\n\nShe married marketing manager Robert Capshaw in January 1976 and they had one child, Jessica Capshaw, before eventually divorcing in 1980. However, she kept the surname Capshaw, which she used for her professional name upon becoming an actress."
    },
    {
      "id": 24,
      "fullName": "John Rhys-Davies",
      "birthDate": 1944,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/%28John_Rhys-Davies%29_2018-02-11_15-35-40_ILCE-6500_DSC07150_%2831235662177%29_%28cropped%29.jpg/440px-%28John_Rhys-Davies%29_2018-02-11_15-35-40_ILCE-6500_DSC07150_%2831235662177%29_%28cropped%29.jpg",
      "biography": "John Rhys-Davies (born 5 May 1944) is a Welsh actor known for portraying Sallah in the Indiana Jones franchise and Gimli in The Lord of the Rings trilogy. He has received three Screen Actors Guild Award nominations, with one win, and a Primetime Emmy Award nomination.\n\nDue to his father's work as a colonial police officer, he was raised in Tanganyika (today part of Tanzania) before his family moved to the Welsh town of Ammanford. While in Tanganyika, his family lived in places such as Dar es Salaam, Kongwa, Moshi, and Mwanza. He was educated at independent Truro School in Cornwall and then at the University of East Anglia, where he was one of the first 105 students admitted and became a co-founder of its drama club. After a stint teaching at a secondary school in Watton, Norfolk, he won a place at the Royal Academy of Dramatic Art in London.\n\nJohn Rhys-Davies at Galaxy Con Richmond in 2023\nRhys-Davies is also known for his performances in the films Victor/Victoria (1982), The Living Daylights (1987), The Princess Diaries 2: Royal Engagement (2004), Aquaman (2018) and its sequel Aquaman and the Lost Kingdom (2023). He is also known for his extensive voice work including Aladdin and the King of Thieves (1996), The Jungle Book 2 (2003), Gargoyles (1995–1996), and SpongeBob SquarePants (2000–2002).\n\nHe also gained acclaim for his television roles as Macro in I, Claudius (1976), Vasco Rodrigues in Shōgun (1980), and Michael Malone in The Untouchables (1993). From 1995 to 1997 he portrayed Professor Maximillian Arturo in Sliders."
    },
    {
      "id": 25,
      "fullName": "Philip Stone",
      "birthDate": 1924,
      "nationality": "Great Britain",
      "image": "https://static.wikia.nocookie.net/indianajones/images/5/5a/Blumburtt.jpg",
      "biography": "Philip Stone (14 April 1924 – 15 June 2003) was an English actor, known for portraying film characters such as \"Pa\", the father of Alex DeLarge, in A Clockwork Orange; General Alfred Jodl in Hitler: The Last Ten Days; Delbert Grady in The Shining; and Captain Phillip Blumburtt in Indiana Jones and the Temple of Doom. His final film role was as the Bishop in The Baby of Mâcon.\n\nOn television, Stone is known for his roles as Detective Sergeant Sowman in Coronation Street, Brigadier Davidson in The Rat Catchers and Sir John Gallagher in Justice.\n\nPhilip Stone (né Stones) was born in Kirkstall, Leeds. He was the youngest of four children; his father was a secondary school headmaster."
    },
    {
      "id": 26,
      "fullName": "Ke Huy Quan",
      "birthDate": 1971,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Ke_Huy_Quan_at_the_White_House_%2852902390767%29_%28cropped%29.jpg/440px-Ke_Huy_Quan_at_the_White_House_%2852902390767%29_%28cropped%29.jpg",
      "biography": "Ke Huy Quan (born August 20, 1971), also known as Jonathan Ke Quan, is an American actor. As a child actor, Quan rose to fame playing Short Round in Indiana Jones and the Temple of Doom (1984) and Data in The Goonies (1985). Following a few roles in the 1990s, he took a 19-year acting hiatus, during which he worked as a stunt choreographer and assistant director.\n\nQuan returned to acting with the family adventure Finding ʻOhana (2021), followed by the critically acclaimed Everything Everywhere All at Once (2022), a performance that won him various accolades, including an Academy Award, a Golden Globe and a Screen Actors Guild Award. Quan and Haing S. Ngor are the only two actors of Asian descent to win the Academy Award for Best Supporting Actor, and Quan is the first Vietnam-born actor to win an Academy Award. Time magazine named him one of the 100 most influential people in the world in 2023. He has since starred in the second season of the Disney+ series Loki in 2023.\n\nQuan Kế Huy was born on August 20, 1971, in Saigon, South Vietnam, into a family of Chinese descent, with eight siblings. Three years after the end of the Vietnam war in 1975, Quan fled from Vietnam with his family. He, along with his father and five siblings, fled to Hong Kong, while Quan's mother and three other siblings went to Malaysia. After staying at a refugee camp in Hong Kong, Quan's entire family was admitted to the United States as part of the Refugee Admissions Program in 1979. In the U.S., Quan grew up in California, where he attended the Mount Gleason Junior High School in Sunland-Tujunga, Los Angeles and Alhambra High School in Alhambra."
    },
    {
      "id": 27,
      "fullName": "Mia Wasikowska",
      "birthDate": 1989,
      "nationality": "Australia",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/MJK_08786_Mia_Wasikowska_%28Damsel%2C_Berlinale_2018%29_%28cropped%29.jpg/440px-MJK_08786_Mia_Wasikowska_%28Damsel%2C_Berlinale_2018%29_%28cropped%29.jpg",
      "biography": "Wasikowska was born on 25 October 1989 in Canberra, Australia. She attended Cook Primary School, Ainslie Primary School and Canberra High School, and Karabar High School in Queanbeyan, which neighbours Canberra. She has an older sister, Jess, and a younger brother, Kai. Her mother, Marzena Wasikowska, is a Polish photographer, while her father, John Reid, is an Australian photographer and collagist. In 1998, when she was eight years old, Wasikowska and her family moved to Szczecin, Poland for a year, after her mother received a grant to produce a collection of work based on her own experience of emigrating from Poland to Australia in 1974 at the age of 11. Wasikowska and her siblings took part in the production as subjects; she explained to Johanna Schneller of The Globe and Mail in July 2010, \"We never had to smile or perform. We weren't always conscious of being photographed. We'd just do our thing, and she'd take pictures of us.\"\n\nAt the age of nine, Wasikowska began studying ballet with Jackie Hallahan at the Canberra Dance Development Centre, with hopes of going professional. She began dancing en pointe at thirteen, and was training 35 hours a week in addition to attending school full-time. Her daily routine consisted of leaving school in the early afternoon and dancing until nine o'clock at night. A spur on her heel hampered her dancing. Her passion for ballet also waned due to the increasing pressure to achieve physical perfection and her growing dissatisfaction with that world in general, and she quit at the age of fourteen. However, she credits ballet with improving her ability to handle her nerves in auditions.\n\nAt the same time, she had been exposed to European and Australian cinema at an early age, and was particularly moved by Krzysztof Kieślowski's Three Colours trilogy and Gillian Armstrong's My Brilliant Career. Although shy and averse to performing during her school years, she was inspired to try to break into acting after seeing Holly Hunter in The Piano and Gena Rowlands in A Woman Under the Influence. She felt acting in film was a way to explore human imperfections. She looked up twelve Australian talent agencies on the Internet and contacted them all, but received only one response. Despite her lack of acting experience, she arranged a meeting after persistent callbacks."
    },
    {
      "id": 28,
      "fullName": "Helena Bonham Carter",
      "birthDate": 1966,
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Helena_Bonham_Carter_2011_AA.jpg/440px-Helena_Bonham_Carter_2011_AA.jpg",
      "biography": "Helena Bonham Carter CBE (born 26 May 1966) is an English actress. Known for her roles in blockbusters and independent films, particularly period dramas, she has received various awards and nominations, including a British Academy Film Award and an International Emmy Award, in addition to nominations for two Academy Awards, four British Academy Television Awards, five Primetime Emmy Awards, and nine Golden Globe Awards.\n\nBonham Carter rose to prominence by playing Lucy Honeychurch in A Room with a View (1985) and the title character in Lady Jane (1986). Her early period roles saw her typecast as a virginal \"English rose\", a label with which she was uncomfortable. She is best known for her eccentric fashion and dark aesthetic and for often playing quirky women. For her role as Kate Croy in The Wings of the Dove (1997), Bonham Carter received a nomination for the Academy Award for Best Actress, and for her portrayal of Queen Elizabeth in The King's Speech (2010), she won the BAFTA Award for Best Actress in a Supporting Role, and was nominated for the Academy Award for Best Supporting Actress.\n\nHer other films include Hamlet (1990), Howards End (1992), Mary Shelley's Frankenstein (1994), Mighty Aphrodite (1995), Fight Club (1999), Wallace & Gromit: The Curse of the Were-Rabbit (2005), the Harry Potter series (2007–2011) as Bellatrix Lestrange, Great Expectations (2012) as Miss Havisham, Les Misérables (2012), Cinderella (2015), Ocean's 8 (2018), and Enola Holmes (2020). Her collaborations with director Tim Burton, her former domestic partner, include Big Fish (2003), Corpse Bride (2005), Charlie and the Chocolate Factory (2005), Sweeney Todd: The Demon Barber of Fleet Street (2007) as Mrs. Lovett, Alice in Wonderland (2010) as the Red Queen, and Dark Shadows (2012).\n\nFor her role as children's author Enid Blyton in the BBC Four biographical film Enid (2009), she won the 2010 International Emmy Award for Best Actress and was nominated for the British Academy Television Award for Best Actress. Her other television films include Fatal Deception: Mrs. Lee Harvey Oswald (1993), Live from Baghdad (2002), Toast (2010), and Burton & Taylor (2013). From 2019 to 2020, she portrayed Princess Margaret in seasons three and four of Netflix's The Crown earning two Primetime Emmy Award nominations."
    },
    {
      "id": 29,
      "fullName": "Arnold Schwarzenegger",
      "birthDate": "2024-06-22",
      "nationality": "Austria",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Arnold_Schwarzenegger_by_Gage_Skidmore_4.jpg/440px-Arnold_Schwarzenegger_by_Gage_Skidmore_4.jpg",
      "biography": "Arnold Alois Schwarzenegger (born July 30, 1947) is an Austrian and American actor, businessman, filmmaker, former politician, and former professional bodybuilder known for his roles in high-profile action movies. He served as the 38th governor of California from 2003 to 2011 and was among Time's 100 most influential people in the world in 2004 and 2007.\n\nSchwarzenegger began lifting weights at age 15 and won the Mr. Universe title aged 20, and subsequently the Mr. Olympia title seven times. He is widely regarded as one of the greatest bodybuilders of all time, and has written many books and articles about it. The Arnold Sports Festival, considered the second-most important bodybuilding event after Mr. Olympia, is named after him. He appeared in the bodybuilding documentary Pumping Iron (1977). After retiring from bodybuilding, he gained worldwide fame as a Hollywood action star, with his breakthrough in the sword and sorcery epic Conan the Barbarian (1982), a box-office hit with a sequel in 1984. After playing the title character in the science fiction film The Terminator (1984), he starred in Terminator 2: Judgment Day (1991) and three other sequels. His other successful action films included Commando (1985), The Running Man (1987), Predator (1987), Total Recall (1990), and True Lies (1994), in addition to comedy films such as Twins (1988), Kindergarten Cop (1990) and Jingle All the Way (1996). He is the founder of the film production company Oak Productions.\n\nAs a registered Republican, Schwarzenegger chaired the President's Council on Physical Fitness and Sports during most of the George H. W. Bush administration. On October 7, 2003, he was elected Governor of California in a special recall election to replace then-Governor Gray Davis. He received 48.6% of the vote, 17 points ahead of Democrat runner-up Cruz Bustamante. He was sworn in on November 17 to serve the remainder of Davis' term, and was reelected in the 2006 California gubernatorial election with an increased vote share of 55.9% to serve a full term. In 2011 he reached his term limit as governor and returned to acting.\n\nSchwarzenegger was nicknamed the \"Austrian Oak\" in his bodybuilding days, \"Arnie\" or \"Schwarzy\" during his acting career, and \"the Governator\" (a portmanteau of \"Governor\" and \"Terminator\") during his political career. He married Maria Shriver, a niece of President John F. Kennedy, in 1986. They separated in 2011 after he admitted to having fathered a child with their housemaid in 1997; their divorce was finalized in 2021.",
      "deathDate": ""
    }
  ],
  "directors": [
    {
      "id": 1,
      "fullName": "Steven Spielberg",
      "birthDate": "1946",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Ready_Player_One_Japan_Premiere_Red_Carpet_Steven_Spielberg_%2841604920761%29_%28cropped%29.jpg/240px-Ready_Player_One_Japan_Premiere_Red_Carpet_Steven_Spielberg_%2841604920761%29_%28cropped%29.jpg",
      "biography": "Spielberg was born in Cincinnati, Ohio, and grew up in Phoenix, Arizona. He moved to California and studied film in college. After directing several episodes for television, including Night Gallery and Columbo, he directed the television film Duel (1971), which later received an international theatrical release. He made his theatrical film debut with The Sugarland Express (1974) and became a household name with the 1975 summer blockbuster Jaws. He directed more box office successes with Close Encounters of the Third Kind (1977), E.T. the Extra-Terrestrial (1982), and the original Indiana Jones trilogy (1981–89). He subsequently explored drama in The Color Purple (1985) and Empire of the Sun (1987).\n\nIn 1993, Spielberg directed back-to-back blockbuster hits with the science fiction thriller Jurassic Park, the highest-grossing film ever at the time, and the Holocaust drama Schindler's List, which has often been listed as one of the greatest films ever made. He won the Academy Award for Best Director for the latter and the 1998 World War II epic Saving Private Ryan. Spielberg has since directed the science fiction films A.I. Artificial Intelligence (2001), Minority Report (2002), and War of the Worlds (2005); the adventure films The Adventures of Tintin (2011) and Ready Player One (2018); the historical dramas Amistad (1997), Munich (2005), War Horse (2011), Lincoln (2012), Bridge of Spies (2015) and The Post (2017); the musical West Side Story (2021); and the semi-autobiographical drama The Fabelmans (2022)."
    },
    {
      "id": 2,
      "fullName": "Ridley Scott",
      "birthDate": "1937",
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/NASA_Journey_to_Mars_and_%E2%80%9CThe_Martian%E2%80%9D_%28201508180030HQ%29.jpg/220px-NASA_Journey_to_Mars_and_%E2%80%9CThe_Martian%E2%80%9D_%28201508180030HQ%29.jpg",
      "biography": "Sir Ridley Scott GBE (born 30 November 1937) is an English filmmaker. He is best known for directing films in the science fiction, crime and historical drama genres. His work is known for its atmospheric and highly concentrated visual style. He ranks among the highest-grossing directors and has received many accolades, including the BAFTA Fellowship for lifetime achievement in 2018, two Primetime Emmy Awards, and a Golden Globe Award.He was knighted by Queen Elizabeth II in 2003, and appointed a Knight Grand Cross by King Charles III in 2024.\n\nAn alumnus of the Royal College of Art in London, Scott began his career in television as a designer and director before moving into advertising as a director of commercials. He made his film directorial debut with The Duellists (1977) and gained wider recognition with his next film, Alien (1979). Though his films range widely in setting and period, they showcase memorable imagery of urban environments, spanning 2nd-century Rome in Gladiator (2000), 12th-century Jerusalem in Kingdom of Heaven (2005), medieval England in Robin Hood (2010), ancient Memphis in Exodus: Gods and Kings (2014), contemporary Mogadishu in Black Hawk Down (2001), and the futuristic cityscapes of Blade Runner (1982) and different planets in Alien, Prometheus (2012), The Martian (2015) and Alien: Covenant (2017)."
    },
    {
      "id": 3,
      "fullName": "James Cameron",
      "birthDate": "1954",
      "nationality": "Canada",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/James_Cameron_by_Gage_Skidmore.jpg/240px-James_Cameron_by_Gage_Skidmore.jpg",
      "biography": "James Francis Cameron (born August 16, 1954) is a Canadian filmmaker. He is a major figure in the post-New Hollywood era. He often uses novel technologies with a classical filmmaking style. He first gained recognition for writing and directing The Terminator (1984) and found further success with Aliens (1986), The Abyss (1989), Terminator 2: Judgment Day (1991), True Lies (1994), as well as Avatar (2009) and its sequels. He directed, wrote, co-produced, and co-edited Titanic (1997), winning three Academy Awards for Best Picture, Best Director, and Best Film Editing. He is a recipient of various other industry accolades, and three of his films have been selected for preservation in the National Film Registry by the Library of Congress.\n\nCameron co-founded the production companies Lightstorm Entertainment, Digital Domain, and Earthship Productions. In addition to filmmaking, he is a National Geographic explorer-in-residence and has produced many documentaries on deep-ocean exploration, including Ghosts of the Abyss (2003) and Aliens of the Deep (2005). Cameron has also contributed to underwater filming and remote vehicle technologies and helped create the digital 3D Fusion Camera System. In 2012, Cameron became the first person to do a solo descent to the bottom of the Mariana Trench, the deepest part of the Earth's ocean, in the Deepsea Challenger submersible."
    },
    {
      "id": 4,
      "fullName": "James Mangold",
      "birthDate": 1963,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/James_Mangold_Press_Conference_Logan_Berlinale_2017_03.jpg/440px-James_Mangold_Press_Conference_Logan_Berlinale_2017_03.jpg",
      "biography": "James Allen Mangold (born December 16, 1963) is an American film director, producer and screenwriter. Noted for his versatility in tackling a range of genres, Mangold made his debut as a film director with Heavy (1995), and is best known for the films Cop Land (1997), Girl, Interrupted (1999), Identity (2003), Walk the Line (2005), 3:10 to Yuma (2007), and two films in the X-Men franchise with The Wolverine (2013) and Logan (2017), the latter of which earned him a nomination for the Academy Award for Best Adapted Screenplay. He then directed the sports drama film Ford v Ferrari (2019), which earned him a nomination for the Academy Award for Best Picture, and directed and co-wrote Indiana Jones and the Dial of Destiny (2023), the fifth and final installment in the Indiana Jones series.\n\nMangold was born in New York City in 1963, and is the son of Jewish artists Robert Mangold and Sylvia Plimack Mangold. He was raised in Hudson Valley and graduated from Washingtonville High School.\n\nHe attended the California Institute of the Arts film/video program where he studied under Alexander Mackendrick. During Mangold's third year, Mackendrick suggested that he should study at CalArts School of Theater as an actor, alongside his regular film studies."
    },
    {
      "id": 5,
      "fullName": "Gore Verbinski",
      "birthDate": 1964,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Verbinski_gore.jpg/440px-Verbinski_gore.jpg",
      "biography": "Gregor Justin \"Gore\" Verbinski (born March 16, 1964) is an American film director, screenwriter, and producer. He is best known for directing Mouse Hunt, The Ring, the first three Pirates of the Caribbean films, and Rango. For his work on Rango, Verbinski won both the Academy Award and BAFTA Award for Best Animated Film.\n\nHis first films were a series of 8 mm films called \"The Driver Files\" c. 1979, when he was a young teen. After graduating from film school at UCLA, he got his first job as a script reader at the commercial production company Limelight in 1987. After director Julien Temple viewed some of his work, he signed to his production company Nitrate Films, and later Palomar Pictures, where he directed music videos for bands like Vicious Rumors, Bad Religion, NOFX, 24-7 Spyz and Monster Magnet. Verbinski moved from music videos to commercials, where he worked for many brand names including Nike, Coca-Cola, Canon, Skittles and United Airlines. One of his most famous commercials was for Budweiser, featuring frogs who croak the brand name. For his efforts in commercials, Verbinski won four Clio Awards and one Cannes Advertising Silver Lion.\n\nVerbinski started Blind Wink Productions in April 2005.\n\nAfter completing a short film, The Ritual (which he both wrote and directed), Verbinski made his feature film directing debut in 1997 with Mouse Hunt, which became a global hit. Following that film's success, Verbinski planned and developed several aborted projects; The Sky Is Falling, Mission to Mars, Where the Wild Things Are, The Big Ticket, The Light Princess and an unpublished manuscript by William Monahan titled The Lighthouse.\n\nVerbinski returned in 2001 with the action/comedy The Mexican, starring Julia Roberts and Brad Pitt. The film received mixed reviews, and performed modestly at the box-office, earning $68 million domestically which was quite meager considering its star power (it was technically successful due to its moderately low $38 million budget). Verbinski followed it up with the horror film remake The Ring (2002), which struck gold globally, grossing well over $200 million worldwide. Verbinski also had a directorial hand in The Time Machine that year, temporarily taking over for an exhausted Simon Wells. Verbinski directed some of the underground Morlock sequences and is given a Thanks to credit in the film."
    },
    {
      "id": 6,
      "fullName": "Peter Jackson",
      "birthDate": 1961,
      "nationality": "New Zealand",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Peter_Jackson_SDCC_2014.jpg/440px-Peter_Jackson_SDCC_2014.jpg",
      "biography": "Sir Peter Robert Jackson ONZ KNZM (born 31 October 1961) is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy (2001–2003) and the Hobbit trilogy (2012–2014), both of which are adapted from the novels of the same name by J. R. R. Tolkien. Other notable films include the critically lauded drama Heavenly Creatures (1994), the horror comedy The Frighteners (1996), the epic monster remake film King Kong (2005), the World War I documentary film They Shall Not Grow Old (2018) and the documentary The Beatles: Get Back (2021). He is the fourth-highest-grossing film director of all-time, his films having made over $6.5 billion worldwide.\n\nJackson began his career with the \"splatstick\" horror comedy Bad Taste (1987) and the black comedy Meet the Feebles (1989) before filming the zombie comedy Braindead (1992). He shared a nomination for Academy Award for Best Original Screenplay with his partner Fran Walsh[2] for Heavenly Creatures, which brought him to mainstream prominence in the film industry. Jackson has been awarded three Academy Awards for The Lord of the Rings: The Return of the King (2003), including Best Picture, Best Director, and Best Adapted Screenplay. His other awards include three BAFTAs, a Golden Globe, two Primetime Emmy Awards and four Saturn Awards among others.\n\nHis production company is WingNut Films, and his most regular collaborators are co-writers and producers Walsh and Philippa Boyens. Jackson was made a Companion of the New Zealand Order of Merit in 2002. He was later knighted (as a Knight Companion of the order) by Sir Anand Satyanand, the Governor-General of New Zealand, at a ceremony in Wellington in April 2010. In December 2014, Jackson was awarded a star on the Hollywood Walk of Fame."
    },
    {
      "id": 7,
      "fullName": "Tim Burton",
      "birthDate": 1958,
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Tim_Burton_%287587109150%29.jpg/440px-Tim_Burton_%287587109150%29.jpg",
      "biography": "Timothy Walter Burton[a] (born August 25, 1958) is an American director, producer, writer, and animator. Known for pioneering goth culture in the American film industry, Burton is famous for his gothic horror and fantasy films. He has received numerous accolades including an Emmy Award, and a Golden Globe Award as well as nominations for two Academy Awards and three BAFTA Awards. He was honored with the Venice International Film Festival's Golden Lion for Lifetime Achievement in 2007 and was given the Order of the Arts and Letters by Culture Minister of France in 2010.\n\nBurton made his directorial film debut with the comedy Pee-wee's Big Adventure (1985) and gained prominence for Beetlejuice (1988) and Edward Scissorhands (1990). Burton also directed the superhero films Batman (1989) and Batman Returns (1992), the animated films Corpse Bride (2005) and Frankenweenie (2012), the science fiction films Mars Attacks! (1996) and Planet of the Apes (2001), the supernatural horror film Sleepy Hollow (1999), the fantasy-dramas Big Fish (2003), Alice in Wonderland (2010), Dark Shadows (2012), and Dumbo (2019), and the musicals Charlie and the Chocolate Factory (2005) and Sweeney Todd: The Demon Barber of Fleet Street (2007) and the biographical dramas Ed Wood (1994) and Big Eyes (2014). Starting in 2022 Burton has directed several episodes for Netflix series Wednesday, for which he received a nomination for the Primetime Emmy Award for Outstanding Directing for a Comedy Series.\n\nBurton has frequently collaborated with Winona Ryder, Michael Keaton, Johnny Depp, Jenna Ortega, Helena Bonham Carter (his former domestic partner), Catherine O’Hara, Eva Green and Christopher Lee as well with composer Danny Elfman, who scored all but three of Burton's films. Burton has released several books including The Melancholy Death of Oyster Boy & Other Stories (1997)."
    },
    {
      "id": 8,
      "fullName": "John McTiernan",
      "birthDate": "",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/b/b2/John_McTiernan_Deauville_2014_3.jpg",
      "biography": "John Campbell McTiernan Jr. (born January 8, 1951) is an American retired filmmaker. He is best known for his action films, including Predator (1987), Die Hard (1988), and The Hunt for Red October (1990). His later well-known films include the action-comedy-fantasy film Last Action Hero (1993), the action film sequel Die Hard with a Vengeance (1995), the heist-film remake The Thomas Crown Affair (1999), and The 13th Warrior (1999). His last completed feature film was the mystery-thriller Basic, released in 2003.\n\nHe pleaded guilty to perjury and lying to an FBI investigator in regard to his hiring of the private investigator Anthony Pellicano in late 2000 to illegally wiretap the phone calls of two people, one of whom was Charles Roven, a co-producer of his action film remake Rollerball (2002). He was incarcerated in federal prison from April 2013 to February 2014. During his imprisonment, he filed for bankruptcy amidst foreclosure proceedings for his large ranch residence.\n\nMcTiernan was born in Albany, New York, the son of Myra and John Campbell McTiernan Sr., a lawyer and actor. He attended the Juilliard School before graduating with a Master of Fine Arts from the AFI Conservatory in 1975. John McTiernan is an alum from SUNY Old Westbury.",
      "deathDate": ""
    }
  ],
  "movies": [
    {
      "id": 1,
      "title": "Indiana Jones: Raiders of the Lost Ark",
      "releaseYear": 1981,
      "genre": "Action",
      "directors": [
        "James Mangold",
        "Steven Spielberg"
      ],
      "actors": [
        "Harrison Ford",
        "Phoebe Waller-Bridge",
        "Mads Mikkelsen",
        "Shia LaBeouf",
        "Karen Allen",
        "John Rhys-Davies",
        "Philip Stone",
        "Ke Huy Quan"
      ],
      "studios": [
        "Lucasfilm Ltd."
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/8/8b/IJandCrystalSkull.jpg/220px-IJandCrystalSkull.jpg",
      "trailer": "https://www.youtube.com/watch?v=0xQSIdSRlAk",
      "storyline": "The year is 1936 and the intrepid archaeologist Indiana Jones sets out in search of the fabled Lost Ark of the Covenant, racing a bitter rival and his Nazi cohorts to the prize. Over the course of a hair-raising adventure, Indy endures explosions, spiders, snakes, booby traps, and bad guys in his quest to save the holy relic."
    },
    {
      "id": 2,
      "title": "Alien",
      "releaseYear": 1979,
      "genre": "Horror",
      "directors": [
        "Ridley Scott"
      ],
      "actors": [
        "Sigourney Weaver",
        "Tom Skerritt",
        "Veronica Cartwright",
        "John Hurt",
        "Ian Holm"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/c/c3/Alien_movie_poster.jpg/232px-Alien_movie_poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=4v4Kn0J6E-I",
      "storyline": "Alien, set in the year 2122 CE, tells the story of the deep-space commercial mining ship Nostromo. The ship is on its way back to Earth, carrying a load of extraterrestrial ore, when its crew is awakened from hypersleep, a type of high-tech hibernation, by the ship’s computer, Mother. The ship has intercepted what appears to be a distress signal from an uncharted planetoid, LV-426. Obligated to respond, the crew lands on the planetoid, and several of its members explore the surface. They find a spacecraft with a dead pilot and a cargo of alien eggs. When crew member Kane (John Hurt) inspects an egg that has opened, he is attacked by a face-hugging creature that inserts part of its body down his throat and clings fiercely to his head."
    },
    {
      "id": 3,
      "title": "Aliens",
      "releaseYear": 1986,
      "genre": "Sequel",
      "directors": [
        "James Cameron"
      ],
      "actors": [
        "Sigourney Weaver",
        "Bill Paxton",
        "Michael Biehn",
        "Lance Henriksen",
        "Jenette Goldstein"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/f/fb/Aliens_poster.jpg/196px-Aliens_poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=QlztL3cYwHs",
      "storyline": "Ellen Ripley has been in stasis for 57 years aboard an escape shuttle after destroying her ship, the Nostromo, to escape an alien creature that slaughtered the rest of the crew. She is rescued and debriefed by her employers at the Weyland-Yutani Corporation, who are skeptical about her claim of alien eggs in a derelict ship on the exomoon LV-426, since it is now the site of a terraforming colony.\n\nAfter contact is lost with the colony, Weyland-Yutani representative Carter Burke and Colonial Marine Lieutenant Gorman ask Ripley to accompany them to investigate. Still traumatized by her alien encounter, she agrees on the condition that they exterminate the creatures. Ripley is introduced to the Colonial Marines on the spaceship Sulaco but is distrustful of their android, Bishop, because the android aboard the Nostromo betrayed its crew to protect the alien on company orders."
    },
    {
      "id": 4,
      "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
      "releaseYear": 2003,
      "genre": "Fantasy",
      "directors": [
        "Gore Verbinski"
      ],
      "actors": [
        "Johnny Depp",
        "Orlando Bloom",
        "Keira Knightley",
        "Geoffrey Rush",
        "Kevin McNally"
      ],
      "studios": [
        "Walt Disney Pictures"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/7/79/Pirates-of-the-Caribbean-The-Curse-of-the-Black-Pearl-.jpg/201px-Pirates-of-the-Caribbean-The-Curse-of-the-Black-Pearl-.jpg",
      "trailer": "https://www.youtube.com/watch?v=gPBaZpDONgg",
      "storyline": "In the 18th century, Governor Weatherby Swann and his daughter, Elizabeth, sail aboard HMS Dauntless. Lieutenant Norrington's crew recovers a shipwrecked survivor, Will Turner. Elizabeth takes a gold medallion from around Will's neck, before seeing a ship with black sails. Eight years later in Port Royal, Jamaica, Norrington is promoted to commodore. While the promotion ceremony is taking place, Captain Jack Sparrow, who initially arrived in Port Royal to \"commandeer\" a ship, runs into two Royal Navy guards, Murtogg and Mullroy, who reveal to Jack that the HMS Interceptor is the fastest ship in the Caribbean.\n\nAfter the ceremony is finished, Commodore Norrington proposes to Elizabeth, before her corset makes her faint and fall into the water below, causing the medallion to emit a pulse. Jack rescues Elizabeth before escaping Commodore Norrington, who identifies Jack with his pirate brand. Will, now a blacksmith, meets Jack and fights long enough for Sparrow to be imprisoned."
    },
    {
      "id": 5,
      "title": "The Lord Of The Rings",
      "releaseYear": 2001,
      "genre": "Adventures",
      "directors": [
        "Peter Jackson"
      ],
      "actors": [
        "Elijah Wood",
        "Ian McKellen",
        "Viggo Mortensen",
        "Orlando Bloom",
        "Ian Holm"
      ],
      "studios": [
        "New Line Cinema"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/f/fb/Lord_Rings_Fellowship_Ring.jpg",
      "trailer": "https://www.youtube.com/watch?v=_nZdmwHrcnw",
      "storyline": "In the Second Age of Middle-earth, the lords of Elves, Dwarves, and Men are given Rings of Power. Unbeknownst to them, the Dark Lord Sauron forges the One Ring in Mount Doom, instilling into it a great part of his power, to dominate the other Rings and conquer Middle-earth. A final alliance of Men and Elves battles Sauron's forces in Mordor. Isildur of Gondor severs Sauron's finger and the Ring with it, thereby vanquishing Sauron and returning him to spirit form. With Sauron's first defeat, the Third Age of Middle-earth begins. The Ring's influence corrupts Isildur, who takes it for himself and is later killed by Orcs. The Ring is lost in a river for 2,500 years until it is found by Gollum, who owns it for over four and a half centuries. The Ring abandons Gollum and it is subsequently found by a hobbit named Bilbo Baggins, who is unaware of its history."
    },
    {
      "id": 6,
      "title": "Indiana Jones and the Temple of Doom",
      "genre": "Adventures",
      "directors": [
        "Steven Spielberg"
      ],
      "actors": [
        "Harrison Ford",
        "Kate Capshaw",
        "Karen Allen",
        "John Rhys-Davies",
        "Philip Stone",
        "Ke Huy Quan"
      ],
      "studios": [
        "Paramount Pictures"
      ],
      "poster": "https://m.media-amazon.com/images/I/61iqF7pRJtL._AC_UF894,1000_QL80_.jpg",
      "trailer": "https://www.youtube.com/watch?v=WBdyLyijZhU",
      "storyline": "In 1935, American archeologist Indiana Jones survives a murder attempt from Shanghai crime boss Lao Che, who hired him to retrieve the remains of Nurhaci. Indy flees from the city in the company of the young orphan Short Round and nightclub singer Willie Scott, unaware that the plane he is traveling on is owned by Che. The plane's pilots dump the fuel and parachute away, but Indy, Willie and Short Round escape using an inflatable raft before the plane crashes. The trio ride down the slopes of the Himalayas and fall into a river before arriving at the Indian village of Mayapore. There, the villagers plead for Indy's aid in retrieving a sacred lingam stone stolen along with the village's children by evil forces from the nearby Pankot Palace. Indy agrees to do so, hypothesizing that the stone is one of the five Sankara stones given by the Hindu gods to help humanity fight evil. Traveling to the palace, the trio are warmly welcomed and allowed to stay for the night as guests, attending a banquet hosted by the palace's young maharaja.",
      "releaseYear": 1984
    },
    {
      "id": 7,
      "title": "Alice in Wonderland",
      "genre": "Fantasy",
      "directors": [
        "Tim Burton"
      ],
      "actors": [
        "Johnny Depp",
        "Mia Wasikowska",
        "Helena Bonham Carter"
      ],
      "studios": [
        "Walt Disney Pictures"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/3/36/Alice_in_Wonderland_%282010_film%29.png",
      "trailer": "https://www.youtube.com/watch?v=9POCgSRVvf0",
      "storyline": "In 1868, 19-year-old Alice Kingsleigh, having mourned the recent loss of her father, is troubled by strange recurring dreams and the stifling expectations of the society in which she lives. After receiving an unwanted marriage proposal from Hamish Ascot at his father's garden party, Alice spots a familiar white rabbit wearing a waistcoat and carrying a pocket watch. She follows it to a rabbit hole and accidentally falls in. She shrinks after drinking from a bottle labeled 'Drink Me' (called a Pishsalver), meaning she cannot reach a key on a table, and then eats a cake labeled 'Eat Me' (called an Upelkuchen), transforming into a giantess. After drinking from the bottle again to fit through a tiny door, she enters the forest of a fantastical place called Underland. There, she is greeted by the White Rabbit, a Dormouse, a Dodo, Talking Flowers, and identical twins Tweedledum and Tweedledee, who all apparently know her.\n\nAlice asserts that she is dreaming, but learns from Absolem the Caterpillar that she is destined to slay the Jabberwocky and end the tyranny of the Red Queen. The group is ambushed by the ravenous Bandersnatch and the Red Queen's knights, led by the Knave of Hearts. All are captured except Alice, who escapes, and the Dormouse, who takes one of the Bandersnatch's eyes. The Knave informs the Red Queen of Alice's return, and is ordered to find her immediately.",
      "releaseYear": 2010
    },
    {
      "id": 8,
      "title": "Pirates of the Caribbean: At World's End",
      "genre": "Fantasy",
      "directors": [
        "Gore Verbinski"
      ],
      "actors": [
        "Johnny Depp",
        "Keira Knightley",
        "Orlando Bloom",
        "Geoffrey Rush"
      ],
      "studios": [
        "Universal Studios Hollywood"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/5/5a/Pirates_AWE_Poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=kmxWPr8s_Y4",
      "storyline": "Now in control of the oceans, Lord Cutler Beckett executes anyone associated with piracy in Port Royal and orders Davy Jones to destroy all pirate ships. Condemned prisoners sing Hoist the Colours to compel nine Pirate Lords from around the world to convene at Shipwreck Cove to hold the Brethren Court and address the threat Beckett poses. Because Pirate Lord Jack Sparrow never named a successor before being dragged to Davy Jones' Locker, Hector Barbossa, Will Turner, Elizabeth Swann, Tia Dalma, and the surviving crew of the Black Pearl plot to rescue him.[a] In Singapore, the crew meet Pirate Lord Sao Feng, who owns navigational charts to the Locker before they are attacked by the East India Trading Company. During the battle, Will secretly promises to give Jack to Feng in return for the Pearl, intending to use it to rescue his father \"Bootstrap Bill\" Turner from the Flying Dutchman.\n\nThe crew crosses over into the Locker, rescues Jack and recovers the Pearl. While departing, they encounter boats of dead souls, including Elizabeth's father Governor Swann, executed by Beckett. The goddess Calypso charged Davy Jones with guiding the souls of those who died at sea to the next world; every ten years he could come ashore to be with the woman he loved, but after his lover never arrived to meet him, Jones corrupted his purpose and cursed himself to become a monster. Whoever kills Jones by stabbing his disembodied heart must become the Dutchman's captain.",
      "releaseYear": 2007
    },
    {
      "id": 9,
      "title": "The Terminator",
      "genre": "Thriller",
      "directors": [
        "James Cameron"
      ],
      "actors": [
        "Arnold Schwarzenegger",
        "Michael Biehn",
        "Lance Henriksen",
        "Bill Paxton"
      ],
      "studios": [
        "Hemdale Film Corporation"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/7/70/Terminator1984movieposter.jpg",
      "trailer": "https://www.youtube.com/watch?v=k64P4l2Wmeg",
      "storyline": "A cyborg is sent back in time from 2029 to 1984 Los Angeles; an assassin known as a Terminator, disguised as a human male and programmed to hunt and assassinate a woman named Sarah Connor. Separately, a human soldier named Kyle Reese also arrives, intent on stopping it, as they both steal ammunition and clothing. After searching for addresses in a telephone directory, the Terminator systematically kills women that share Sarah's name before tracking the correct Sarah to a nightclub, but she is rescued by Reese. The duo steal a car and escape, with the Terminator pursuing them in a stolen police car.\n\nAs they hide in a parking lot, Reese explains to Sarah that an artificially intelligent defense network known as Skynet, created by Cyberdyne Systems, will become self-aware in the near future and trigger a global nuclear war to bring humankind to its extinction. Sarah's future son, John, will rally the survivors and lead a successful resistance movement against Skynet and its mechanical forces. On the verge of the resistance's victory, Skynet sends the Terminator back in time to eliminate Sarah, thereby preventing John's birth. The Terminator is an efficient and relentless killing machine with a perfect voice-mimicking ability and a durable metal endoskeleton covered by living tissue for it to appear human.\n\nThe police then apprehend Reese and Sarah after another encounter with the Terminator. It then attacks the police station, killing several officers while hunting for Sarah. Reese and Sarah escape, steal another car and take refuge in a motel, where they assemble several pipe bombs and plan their next move. Reese admits that he has adored Sarah since he saw her in a photograph John gave him and that he traveled through time out of love for her. Reciprocating his feelings, Sarah kisses him, and they have sex, conceiving John. The Terminator locates Sarah by intercepting a call intended for her mother. She and Reese escape the motel in a pickup truck while it pursues them on a motorcycle. In the ensuing chase, Reese is badly wounded by gunfire while throwing pipe bombs at the Terminator. Sarah knocks the Terminator off its motorcycle but loses control of the truck, which flips over.",
      "releaseYear": 1984
    },
    {
      "id": 10,
      "title": "Predator",
      "genre": "Science fiction",
      "directors": [
        "John McTiernan"
      ],
      "actors": [
        "Arnold Schwarzenegger",
        "Bill Paxton"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://i.etsystatic.com/35396601/r/il/0ecb17/4578464483/il_fullxfull.4578464483_83es.jpg",
      "trailer": "https://www.youtube.com/watch?v=_1wDBNHYDv8",
      "storyline": "An alien spacecraft deploys a shuttle to Earth, where Vietnam War veteran Major Alan \"Dutch\" Schaefer and his military rescue team—consisting of Mac, Poncho, Blain, Billy, and Hawkins—are tasked with rescuing a foreign cabinet minister and his aide from communist insurgents in an unspecified South American country. CIA officer Al Dillon, a Vietnam War buddy of Dutch's, is assigned to accompany the team over Dutch's objections. En route, the team discovers the wreckage of a helicopter and three skinned corpses. Dutch identifies them as Green Berets he knew and becomes suspicious of Dillon's intentions. The team reaches the guerrilla camp and witnesses the execution of a hostage. They mount an attack, killing most of the rebels and several Soviet intelligence officers. Dutch confronts Dillon, who reveals their true mission was to stop a planned Soviet-backed invasion and that the CIA sent the Green Berets weeks earlier for the same mission.\n\nThe only surviving guerrilla, Anna, is captured. Learning that more rebels are coming, the team chooses to trek to the extraction point. Unbeknownst to them, they are stalked by an entity employing a cloaking device and thermal imaging technology, but a spooked Billy glimpses it, creating a situation where Anna attempts an escape. Hawkins catches her, but the creature attacks and kills him while sparing Anna.\n\nDutch organizes a search party, but Blain is killed by the creature's plasma cannon. Enraged, Mac provokes everyone to blindly fire their weapons into the jungle, unknowingly wounding the creature. As it administers first aid to itself, the commandos regroup and realize they are being hunted; Dillon believes guerrillas are responsible, but Billy is adamant that their pursuer is not human. They make camp for the night and set traps, which are triggered by a wild boar. In the ensuing confusion, the creature steals Blain's body.",
      "releaseYear": 1987
    }
  ],
  "studios": [
    {
      "id": 1,
      "title": "Lucasfilm Ltd.",
      "location": "San Francisco",
      "foundationYear": "1971",
      "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Lucasfilm_logo.svg/250px-Lucasfilm_logo.svg.png",
      "about": "Lucasfilm Ltd. LLC is an American film and television production company founded by filmmaker George Lucas in 1971 in San Rafael, California, though most of the company's operations were moved to San Francisco in 2005. It has been a subsidiary of The Walt Disney Studios since 2012 and is best known for creating and producing the Star Wars and Indiana Jones franchises, as well as its leadership in developing special effects, sound, and computer animation for films.\n\nThe company's films Star Wars: Episode I – The Phantom Menace (1999), Star Wars: The Force Awakens (2015), Rogue One: A Star Wars Story (2016), Star Wars: The Last Jedi (2017), and Star Wars: The Rise of Skywalker (2019) are all among the 50 highest-grossing films of all time, with The Force Awakens becoming the highest-grossing film in the United States and Canada. On October 30, 2012, Disney acquired Lucasfilm for $4.05 billion in the form of cash and $1.855 billion in stock."
    },
    {
      "id": 2,
      "title": "20th Century Studios, Inc.",
      "location": "Los Angeles",
      "foundationYear": "1935",
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTlWG8HxHW6-VKfUD-QiVpnFeHfh4u_qYguFA&s",
      "about": "20th Century Studios, Inc. is an American film studio owned by the Walt Disney Studios, a division of Disney Entertainment, in turn a division of The Walt Disney Company. It is headquartered at the Fox Studio Lot in the Century City area of Los Angeles, leased from Fox Corporation. Walt Disney Studios Motion Pictures distributes and markets the films produced by 20th Century Studios in theatrical markets.\n\nFor over 80 years, 20th Century was one of the major American film studios. It was formed in 1935 as Twentieth Century-Fox Film Corporation by the merger of Fox Film and Twentieth Century Pictures, and one of the original \"Big Five\" among eight majors of Hollywood's Golden Age. In 1985, the studio removed the hyphen in the name (becoming Twentieth Century Fox Film Corporation) after being acquired by Rupert Murdoch's News Corporation, which was renamed 21st Century Fox in 2013 after it spun off its publishing assets. Disney purchased most of 21st Century Fox's assets, which included 20th Century Fox, on March 20, 2019. The studio adopted its current name as a trade name on January 17, 2020, in order to avoid confusion with Fox Corporation, and subsequently started to use it for the copyright of 20th Century and Searchlight Pictures productions on December 4."
    },
    {
      "id": 3,
      "title": "Walt Disney Pictures",
      "location": "California",
      "foundationYear": 1929,
      "logo": "https://i.insider.com/5f5770dee6ff30001d4e7684?width=800&format=jpeg&auto=webp",
      "about": "Walt Disney Pictures (credited as Disney in theatrical releases) is an American film production company and subsidiary of Walt Disney Studios, a division of Disney Entertainment, which is owned by The Walt Disney Company. The studio is the flagship producer of live-action feature films within the Walt Disney Studios unit, and is based at the Walt Disney Studios in Burbank, California. Animated films produced by Walt Disney Animation Studios and Pixar Animation Studios are also released under the studio banner. Walt Disney Studios Motion Pictures distributes and markets the films produced by Walt Disney Pictures.\n\nDisney began producing live-action films in the 1950s. The live-action division became Walt Disney Pictures in 1983, when Disney reorganized its entire studio division; which included the separation from the feature animation division and the subsequent creation of Touchstone Pictures. At the end of that decade, combined with Touchstone's output, Walt Disney Pictures elevated Disney to one of Hollywood's major film studios.\n\nWalt Disney Pictures is currently one of five live-action film studios within the Walt Disney Studios, alongside 20th Century Studios, Marvel Studios, Lucasfilm, and Searchlight Pictures. The 2019 remake of The Lion King is the studio's highest-grossing film worldwide with $1.6 billion, and Pirates of the Caribbean is the studio's most successful film series, with five films earning a total of over $4.5 billion in worldwide box office gross."
    },
    {
      "id": 4,
      "title": "New Line Cinema",
      "location": "Los Angeles",
      "foundationYear": 1967,
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRC-5SpIGPcNSnOT5_jDBdLa9zAE3yESllFFw&s",
      "about": "New Line Productions, Inc., doing business as New Line Cinema, is an American film and television production studio owned by Warner Bros. Discovery (WBD). Since 2008, it has been operating as a unit of Warner Bros. Pictures.\n\nNew Line Cinema was established in 1967 by the then 27-year-old Robert Shaye as a film distribution company, supplying foreign and art films for college campuses in the United States. Shaye operated New Line's offices out of his apartment at 14th Street and Second Avenue in New York City. One of the company's early successes was its distribution of the 1936 anti-cannabis propaganda film Reefer Madness, which became a cult hit on American college campuses in the early 1970s. New Line also released many classic foreign-language films, like Stay As You Are, Immoral Tales and Get Out Your Handkerchiefs (which became the first New Line film to win an Oscar). The studio has also released many of the films of John Waters.\n\nIn 1976, New Line secured funding to produce its first full-length feature, Stunts (1977), directed by Mark L. Lester. Although not considered a critical success, the film performed well commercially on the international market and on television.\n\nIn 1980, Shaye's law school classmate Michael Lynne became outside counsel and adviser to the company and renegotiated its debt.\n\nIn 1983, Bryanston Distributing Company, the company that first distributed the original The Texas Chain Saw Massacre, lost the rights to that film, and the rights reverted to the original owners. New Line bought the rights and re-released the film to theatres that same year. It became very successful for the studio.\n\nNew Line expanded its film production in the early 1980s, producing or co-producing films including Polyester, directed by John Waters, and Alone in the Dark. Polyester was one of the first films to introduce a novelty cinema experience named Odorama, where members of the audience were provided with a set of \"scratch and sniff\" cards to be scratched and sniffed at specific times during the film, which provided an additional sensory connection to the viewed image. In 1983, Lynne joined the board. In 1984, Dawn Altyn and Jeff Youngs joined New Line, respectively as sales manager, eastern and southern divisions of New Line Distribution, and national print controller of the studio, to distribute new projects."
    },
    {
      "id": 5,
      "title": "Paramount Pictures",
      "location": "Los Angeles",
      "foundationYear": 1912,
      "logo": "https://goodlogo.com/images/logos/paramount_logo_2434.gif",
      "about": "Paramount Pictures Corporation (also known simply as Paramount) is an American film and television production and distribution company and the namesake subsidiary of Paramount Global. It is the sixth-oldest film studio in the world, the second-oldest film studio in the United States (behind Universal Pictures), and the sole member of the \"Big Five\" film studios located within the city limits of Los Angeles.\n\nIn 1916, film producer Adolph Zukor put 24 actors and actresses under contract and honored each with a star on the logo. In 1967, the number of stars was reduced to 22 and their hidden meaning was dropped. In 2014, Paramount Pictures became the first major Hollywood studio to distribute all of its films in digital form only. The company's headquarters and studios are located at 5555 Melrose Avenue, Hollywood, California.\n\nParamount Pictures is a member of the Motion Picture Association (MPA)."
    },
    {
      "id": 6,
      "title": "Universal Studios Hollywood",
      "location": "California",
      "foundationYear": 1912,
      "logo": "https://media.tacdn.com/media/attractions-splice-spp-674x446/09/28/92/ef.jpg",
      "about": "Universal Studios Hollywood is a film studio and theme park in the San Fernando Valley area of Los Angeles County, California. About 70% of the studio lies within the unincorporated county island known as Universal City while the rest lies within the city limits of Los Angeles, California. It is one of the oldest and most famous Hollywood film studios still in use. Its official marketing headline is \"The Entertainment Capital of LA\". It was initially created to offer tours of the real Universal Studios sets and is the first of many full-fledged Universal Studios Theme Parks located across the world.\n\nOutside the theme park, a new, all-digital facility near the Universal Pictures backlot was built in an effort to merge all of NBCUniversal's West Coast operations into one area. As a result, the current home for KNBC, KVEA and NBC News with Noticias Telemundo Los Angeles Bureaus with new digital facility is on the Universal lot formerly occupied by Technicolor SA. Universal City includes hotels Universal Hilton & Towers, the Sheraton Universal Hotel, and Universal CityWalk, which offers a collection of shops, restaurants, an 18-screen Universal Cinema and a seven-story IMAX theater. In 2017, the park hosted 9.056 million guests, ranking it 15th in the world and 9th among North American parks."
    },
    {
      "id": 7,
      "title": "Hemdale Film Corporation",
      "location": "London",
      "foundationYear": 1967,
      "logo": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/02df2846-a4a8-4c9d-bc27-349080c98596/d743mql-1d4b0afe-7568-4b74-b1cb-53728cf8578d.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzAyZGYyODQ2LWE0YTgtNGM5ZC1iYzI3LTM0OTA4MGM5ODU5NlwvZDc0M21xbC0xZDRiMGFmZS03NTY4LTRiNzQtYjFjYi01MzcyOGNmODU3OGQucG5nIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.xVvAJfFNP9v7LWDWBB19jdeIoLPMkdtqONXkP-pHFL8",
      "about": "Hemdale Film Corporation (known as Hemdale Communications after 1992) was an independent American-British film production company and distributor. The company was founded in London in 1967 as the Hemdale Company by actor David Hemmings and John Daly, naming the company from a combination of their surnames. The company produced numerous acclaimed films, often in conjunction with companies such as TriStar and Orion Pictures, including The Terminator (1984), Platoon (1986) and The Last Emperor (1987), the latter two being back-to-back winners of the Academy Award for Best Picture."
    }
  ]
}