{
  "actors": [
    {
      "id": 1,
      "full_name": "Harrison Ford",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Harrison_Ford_by_Gage_Skidmore_3.jpg/274px-Harrison_Ford_by_Gage_Skidmore_3.jpg",
      "biography": "Harrison Ford was born at the Swedish Covenant Hospital in Chicago, Illinois, on July 13, 1942, to former radio actress Dorothy (née Nidelman) and advertising executive and former actor John William \"Christopher\" Ford. His younger brother, Terence, was born in 1945. Their father was a Catholic of Irish descent, while their mother was an Ashkenazi Jew whose parents were emigrants from Minsk, Belarus, then in the Russian Empire. When asked in which religion he and his brother were raised, Ford jokingly responded \"Democrat\" and more seriously stated that they were raised to be \"liberals of every stripe\". When asked about what influence his Jewish and Irish Catholic ancestry may have had on him, he quipped, \"As a man I've always felt Irish, as an actor I've always felt Jewish.\"\n\nFord was a Boy Scout, achieving the second-highest rank of Life Scout. He worked at Napowan Adventure Base Scout Camp as a counselor for the Reptile Study merit badge. Because of this, he and director Steven Spielberg later decided to depict the young Indiana Jones as a Life Scout in Indiana Jones and the Last Crusade (1989). Ford graduated in 1960 from Maine East High School in Park Ridge, Illinois. His voice was the first student voice broadcast on his high school's new radio station, WMTH, and he was its first sportscaster during his senior year. He attended Ripon College in Ripon, Wisconsin, where he was a philosophy major and a member of the Sigma Nu fraternity. A self-described \"late bloomer\", Ford took a drama class in the final quarter of his senior year to get over his shyness and became fascinated with acting. Ford was expelled from college four days before graduation.",
      "birth_date": "1942-07-13",
      "death_date": ""
    },
    {
      "id": 2,
      "full_name": "Johnny Depp",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Johnny_Depp_Deauville_2019.jpg/220px-Johnny_Depp_Deauville_2019.jpg",
      "biography": "John Christopher \"Johnny\" Depp II was born on June 9, 1963 in Owensboro, Kentucky, to Betty Sue Palmer (née Wells), a waitress, and John Christopher Depp, a civil engineer. He was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. When he married Lori A. Depp, he took a job as a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor Nicolas Cage, who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, Кошмар на улице Вязов (1984), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger.",
      "birth_date": "1963-06-09",
      "death_date": ""
    },
    {
      "id": 3,
      "full_name": "Sigourney Weaver",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Sigourney_Weaver_by_Gage_Skidmore_4.jpg/250px-Sigourney_Weaver_by_Gage_Skidmore_4.jpg",
      "biography": "Susan Alexandra Weaver was born in New York City on October 8, 1949. Her mother, Elizabeth Inglis (born Desiree Mary Lucy Hawkins), was a British actress and a native of Colchester, England. Weaver's father, Sylvester \"Pat\" Weaver Jr., was an American television executive born in Los Angeles, who served as president of NBC from 1953 to 1955 and created NBC's Today Show in 1952. Pat's brother, Winstead \"Doodles\" Weaver, was a comedian and contributor to Mad. Her father's American family was of Dutch, English, Scots-Irish, and Scottish ancestry.\n\nAt the age of 14, Weaver began using the name Sigourney, taking it from a minor character in The Great Gatsby. She briefly attended the Brearley School and Chapin School in New York before arriving at the Ethel Walker School (Walker's) in Simsbury, Connecticut, where she developed an early interest in performance art.One of her early roles was in a school adaptation of the poem \"The Highwayman\", and on another occasion she played a Rudolph Valentino character in an adaptation of The Sheik. She was also involved in theatrical productions of A Streetcar Named Desire and You Can't Take It with You during one summer at Southbury, Connecticut. Weaver reportedly reached the height of 179 cm (5 ft 10 in) by the age of 11, which had a negative impact on her self-esteem. She recalled feeling like \"a giant spider\" and never having \"the confidence to ever think I could act.",
      "birth_date": "1949-10-08",
      "death_date": ""
    },
    {
      "id": 4,
      "full_name": "Phoebe Waller-Bridge",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Nicola_Benedetti_Humza_Yousaf_Phoebe_Waller-Bridge_-_All_Festivals_Reception_%28Waller-Bridge_cropped%29_%28cropped%29.jpg/440px-Nicola_Benedetti_Humza_Yousaf_Phoebe_Waller-Bridge_-_All_Festivals_Reception_%28Waller-Bridge_cropped%29_%28cropped%29.jpg",
      "biography": "Phoebe Mary Waller-Bridge (born 14 July 1985) is an English actress, screenwriter and producer. As the creator, head writer, and star of the comedy series Fleabag (2016–2019), she won three Primetime Emmy Awards, two Golden Globes and a British Academy Television Award. She received further Emmy and Golden Globe nominations for writing and producing the spy thriller series Killing Eve (2018–2022).\n\nWaller-Bridge has also created, written, and starred in the comedy series Crashing (2016). She has also acted in the comedy series The Café (2011–2013), in the second season of Broadchurch (2015), and in the films Albert Nobbs (2011), The Iron Lady (2011), Goodbye Christopher Robin (2017), and Solo: A Star Wars Story (2018). She contributed to the screenplay of the James Bond film No Time to Die (2021) and starred in the adventure film Indiana Jones and the Dial of Destiny (2023).\n\nPhoebe Mary Waller-Bridge was born in Hammersmith, London, on 14 July 1985, the daughter of Michael Cyprian Waller-Bridge, founder of the electronic trading platform Tradepoint, and Theresa Mary, daughter of Sir John Edward Longueville Clerke, 12th Baronet, employed by the Worshipful Company of Ironmongers. The Bridge, later Waller-Bridge, family were soldiers and clergymen, who came to rank among the landed gentry of Cuckfield in Sussex. Her grandfather, Cyprian Waller-Bridge (1918-1960), \"a Wodehousian sort of character... 'the eccentric son of an eccentric vicar'\", was an actor and BBC announcer. On her father's side, she is a descendant of the Revd Sir Egerton Leigh, 2nd Baronet, and a distant relative of politician and author Egerton Leigh, Conservative MP for Mid Cheshire from 1873 to his death in 1876.\n\nWaller-Bridge grew up in Ealing in London and has two siblings: an older sister, Isobel Waller-Bridge, a composer, with whom she has collaborated; and a younger brother, Jasper. Her parents are divorced. She was educated at St Augustine's Priory, a Catholic independent school for girls, followed by the independent sixth form college DLD College London in the Marylebone area of London. She graduated from the Royal Academy of Dramatic Art in London.",
      "birth_date": "1985-07-14",
      "death_date": ""
    },
    {
      "id": 5,
      "full_name": "Mads Mikkelsen",
      "nationality": "Denmark",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Mads_Mikkelsen_by_Gage_Skidmore_2.jpg/440px-Mads_Mikkelsen_by_Gage_Skidmore_2.jpg",
      "biography": "Mads Dittmann Mikkelsen (born 22 November 1965) is a Danish actor, former gymnast and dancer. He rose to fame in Denmark as an actor for his roles such as Tonny in the first two films of the Pusher film trilogy (1996, 2004), Detective Sergeant Allan Fischer in the television series Rejseholdet (2000–2004), Niels in Open Hearts (2002), Svend in The Green Butchers (2003), Ivan in Adam's Apples (2005) and Jacob Petersen in After the Wedding (2006).\n\nMikkelsen achieved worldwide recognition for playing the main antagonist Le Chiffre in the twenty-first James Bond film, Casino Royale (2006). His other film roles include Igor Stravinsky in Coco Chanel & Igor Stravinsky (2008), Johann Friedrich Struensee in A Royal Affair (2012), his Cannes Film Festival Best Actor Award-winning performance as Lucas in the Danish film The Hunt (2012), Kaecilius in Marvel's Doctor Strange (2016), Galen Erso in Lucasfilm's Rogue One (2016), his BAFTA-nominated role as Martin in Another Round (2020), Gellert Grindelwald in Fantastic Beasts: The Secrets of Dumbledore (2022), Dr Jürgen Voller in Indiana Jones and the Dial of Destiny (2023), and Captain Ludwig Kahlen in The Promised Land (2023). Outside of film, he is known for his roles as Dr. Hannibal Lecter in the television series Hannibal (2013–2015) and Cliff Unger in Hideo Kojima's video game Death Stranding (2019).\n\nA. O. Scott of The New York Times remarked that in the Hollywood scene, Mikkelsen has \"become a reliable character actor with an intriguing mug\" but stated that on the domestic front \"he is something else: a star, an axiom, a face of the resurgent Danish cinema\".",
      "birth_date": "1965-11-22",
      "death_date": ""
    },
    {
      "id": 6,
      "full_name": "Shia LaBeouf",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Shia_LaBeouf_2022.jpg/440px-Shia_LaBeouf_2022.jpg",
      "biography": "Shia Saide LaBeouf (born June 11, 1986) is an American actor, performance artist, and filmmaker. He played Louis Stevens in the Disney Channel series Even Stevens, a role for which he received Young Artist Award nominations in 2001 and 2002 and won a Daytime Emmy Award in 2003. He made his film debut in The Christmas Path (1998). In 2004, he made his directorial debut with the short film Let's Love Hate and later directed a short film titled Maniac (2011), starring American rappers Cage and Kid Cudi.\n\nIn 2007, LaBeouf starred in the commercially successful films Disturbia and Surf's Up. From 2007 to 2011, LaBeouf starred in the film Transformers and its sequels Transformers: Revenge of the Fallen and Transformers: Dark of the Moon, playing protagonist Sam Witwicky. The three films were commercially successful. In 2008, he played Henry \"Mutt Williams\" Jones III in Indiana Jones and the Kingdom of the Crystal Skull.\n\nHis other credits include the films Holes (2003), Constantine (2005), Wall Street: Money Never Sleeps (2010), Lawless (2012), The Company You Keep (2012), Nymphomaniac (2013), Charlie Countryman (2013), Fury (2014), American Honey (2016), Borg vs McEnroe (2017), Honey Boy (2019), The Peanut Butter Falcon (2019), Pieces of a Woman (2020), and Padre Pio (2022).\n\nSince 2014, LaBeouf has pursued a variety of public performance art projects with LaBeouf, Rönkkö & Turner.",
      "birth_date": "1986-06-11",
      "death_date": ""
    },
    {
      "id": 7,
      "full_name": "Karen Allen",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Karenallen17_cropped.jpg",
      "biography": "Allen was born on October 5, 1951, in Carrollton, Illinois, to Ruth Patricia (née Howell) (1927–2020), a university professor, and Carroll Thompson Allen (1925–2015), an FBI agent. She is of English, Irish, Scottish, and Welsh descent. Her father's job forced the family to move often. \"I grew up moving almost every year and so I was always the new kid in school and always, in a way, was deprived of ever really having any lasting friendships\", Allen said in 1987. Although Allen says her father was very much involved in the family, she felt that she and her two sisters grew up in a very female-dominated household.\n\nAfter she graduated from DuVal High School, in Lanham, Maryland, at 17, she moved to New York City to study art and design at Fashion Institute of Technology for two years. Allen later ran a boutique on the University of Maryland campus and spent time traveling through South and Central Asia. She attended George Washington University and began to study and perform with the experimental company, the Washington Theatre Laboratory, in Washington, D.C. In 1974, Allen joined Shakespeare & Company in Massachusetts. Three years later, she moved back to New York City and studied at the Lee Strasberg Theater Institute.\n\nHer critical and commercial breakthrough came when she portrayed Marion Ravenwood opposite Harrison Ford in Raiders of the Lost Ark (1981), for which she won the Saturn Award for Best Actress. She later co-starred in Shoot the Moon (1982), Starman (1984), for which she was again nominated for the Saturn Award for Best Actress, and Scrooged (1988). She has also received recognition for her work in The Glass Menagerie (1987), Year by the Sea (2016), and Colewell (2019). She reprised her role as Marion Ravenwood in Indiana Jones and the Kingdom of the Crystal Skull (2008) and Indiana Jones and the Dial of Destiny (2023).",
      "birth_date": "1951-10-05",
      "death_date": ""
    },
    {
      "id": 8,
      "full_name": "Tom Skerritt",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Tom_Skerritt_2014_%28cropped%29.jpg/440px-Tom_Skerritt_2014_%28cropped%29.jpg",
      "biography": "Thomas Roy Skerritt (born August 25, 1933) is an American actor who has appeared in over 40 films and more than 200 television episodes since 1962. He is known for his film roles in M*A*S*H, Alien, The Dead Zone, Top Gun, A River Runs Through It, Poltergeist III, and Up in Smoke, and the television series Picket Fences and Cheers. Skerritt has earned several nominations and awards, including winning the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series in 1993 for Picket Fences.\n\nSkerritt was born in Detroit, Michigan, the son of Helen, a homemaker, and Roy Skerritt, a businessman. He is the youngest of three children. A 1951 graduate of Detroit's Mackenzie High School, Skerritt attended Wayne State University and the University of California, Los Angeles.\n\nSkerritt enlisted just after graduating from high school, and served a four-year tour of duty in the United States Air Force as a classifications specialist. Most of his enlistment was spent at Bergstrom Field, Austin, Texas.",
      "birth_date": "1933-08-25",
      "death_date": ""
    },
    {
      "id": 9,
      "full_name": "Veronica Cartwright",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Veronica_Cartwright_2022.jpg/440px-Veronica_Cartwright_2022.jpg",
      "biography": "Veronica Cartwright (born April 20, 1949) is a British-born American actress. She is known for appearing in science fiction and horror films, and has earned numerous accolades, including three Primetime Emmy Award nominations. Her younger sister is actress Angela Cartwright.\n\nAs a child actress, Cartwright appeared in supporting roles in The Children's Hour and The Birds, the latter of which was her first commercial success. She made her transition into mainstream, mature roles with 1978's Invasion of the Body Snatchers. She played Lambert in the science-fiction horror film Alien, which earned her recognition and a Saturn Award for Best Supporting Actress, and additionally appeared in the films The Right Stuff and The Witches of Eastwick which earned her praise. In the 1990s, she received three nominations for the Primetime Emmy Award for Outstanding Guest Actress in a Drama Series, one of which was for her role on ER and two of which were for her role in The X-Files.\n\nCartwright was born in Bristol, England, and grew up in Los Angeles, having emigrated to the US shortly after the birth of her younger sister, actress Angela Cartwright.",
      "birth_date": "1949-04-20",
      "death_date": ""
    },
    {
      "id": 10,
      "full_name": "John Hurt",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/John_Hurt_at_the_2009_Tribeca_Film_Festival.jpg/440px-John_Hurt_at_the_2009_Tribeca_Film_Festival.jpg",
      "biography": "John Vincent Hurt was born on January 22, 1940, in Chesterfield, Derbyshire, the son of Phyllis (née Massey; 1907–1975), an engineer and one-time actress, and Arnold Herbert Hurt (1904–1999), a mathematician who became a Church of England clergyman and served as vicar of Holy Trinity Church in Shirebrook, Derbyshire. His father was previously vicar of St John's parish in Sunderland, County Durham. In 1937, he moved his family to Derbyshire, where he became Perpetual Curate of Holy Trinity Church. When Hurt was five, his father became the vicar of St Stephen's Church in Woodville, Derbyshire, and remained there until 1953.\n\nAt the age of eight, Hurt was sent to the Anglican St Michael's Preparatory School in Otford, Kent, where he eventually developed his passion for acting. He decided he wanted to become an actor after his first role as a girl in a school production of The Blue Bird by Maurice Maeterlinck. Hurt stated that a senior master at the school would abuse him and others by removing his two false front teeth and putting his tongue in the boys' mouths, as well as rubbing their faces with his stubble, and that the experience affected him hugely. Hurt, aged 12, became a boarder at Lincoln School (then a grammar school) because he had failed the entrance examination for admission to his brother's school. His headmaster at Lincoln School laughed when Hurt told him he wanted to be an actor, telling him, \"Well, you may be all right in school plays but you wouldn't stand a chance in the profession.\"\n\nHurt reprised his role as Quentin Crisp in An Englishman in New York (2009), which brought his seventh BAFTA nomination. He portrayed an incarnation of the Doctor known as the War Doctor in Doctor Who. He voiced roles in Watership Down (1978), The Lord of the Rings (1978), The Plague Dogs (1982), The Black Cauldron (1985), Dogville (2003), Valiant (2005) and BBC's Merlin (2008–2012), as well as The Gruffalo's Child (2011), and Thomas & Friends: Sodor's Legend of the Lost Treasure (2015).",
      "birth_date": "1940-01-22",
      "death_date": "2017-01-25"
    },
    {
      "id": 11,
      "full_name": "Ian Holm",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Ian_Holm.jpg/440px-Ian_Holm.jpg",
      "biography": "Ian Holm Cuthbert was born on 12 September 1931 in Goodmayes, Essex, to Scottish parents, James Cuthbert and his wife Jean (née Holm). His father was a psychiatrist who worked as the superintendent of the West Ham Corporation Mental Hospital and was one of the pioneers of electric shock therapy; his mother was a nurse. He had an older brother, who died when Ian was 12 years old. Holm was educated at the independent Chigwell School in Essex. His parents retired to Mortehoe in Devon and then to Worthing, where he joined an amateur dramatic society.\n\nA chance encounter with Henry Baynton, a well-known provincial Shakespearean actor, helped Holm train for admission to the Royal Academy of Dramatic Art, where he secured a place from 1950. His studies were interrupted a year later when he was called up for National Service in the British Army, during which he was posted to Klagenfurt, Austria, and attained the rank of Lance Corporal. They were interrupted a second time when he volunteered to go on an acting tour of the United States in 1952. Holm graduated from the Royal Academy of Dramatic Art in 1953.\n\nHe made his stage debut in 1954, at Stratford-upon-Avon, playing a spear carrier in a staging of Othello. Two years later, he made his London stage debut in Love Affair.\n\nHolm won the 1967 Tony Award for Best Featured Actor for his performance as Lenny in the Harold Pinter play The Homecoming. He won the Laurence Olivier Award for Best Actor for his performance in the title role in the 1998 West End production of King Lear. For his television roles he received two Primetime Emmy Awards for King Lear (1998), and the HBO film The Last of the Blonde Bombshells (2003).\n\nHe gained acclaim for his role in The Bofors Gun (1968) winning the BAFTA Award for Best Actor in a Supporting Role. He was nominated for an Academy Award for Best Supporting Actor, and won a second BAFTA Award for his role as athletics trainer Sam Mussabini in Chariots of Fire (1981). Other notable films he appeared in include Alien (1979), Brazil (1985), Henry V (1989), Naked Lunch (1991), The Madness of King George (1994), The Fifth Element (1997), The Sweet Hereafter (1997), and The Aviator (2004). He played Napoleon in three different films. He gained wider appreciation for his role as the elderly Bilbo Baggins in Peter Jackson's The Lord of the Rings and The Hobbit trilogies.",
      "birth_date": "1931-09-12",
      "death_date": "2020-06-19"
    },
    {
      "id": 12,
      "full_name": "Bill Paxton",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Bill_Paxton_by_Gage_Skidmore.jpg/440px-Bill_Paxton_by_Gage_Skidmore.jpg",
      "biography": "Paxton was born in Fort Worth, Texas, on May 17, 1955, the son of Mary Lou (née Gray; 1926–2016) and John Lane Paxton (1920–2011). His mother was a Roman Catholic who raised him and his siblings in her faith. His father was a businessman, lumber wholesaler, museum executive, and (during his son's career) an occasional actor, notably appearing in Sam Raimi's Spider-Man films as Bernard Houseman and alongside Paxton in A Simple Plan (1998). Paxton was of Austrian, Dutch, English, French, German, Norwegian, Irish, Scotch-Irish, Scottish, Swiss, and Welsh descent. His great-great-grandfather was Elisha Franklin Paxton (1828–1863), a brigadier general in the Confederate Army during the Civil War who was killed commanding the Stonewall Brigade at the Battle of Chancellorsville.\n\nPaxton is distantly related to actress Sara Paxton and was the great-nephew of Mary Paxton Keeley, a prominent journalist and close friend of Bess Truman. At the age of eight, he was in the crowd when President John F. Kennedy emerged from the Hotel Texas in Fort Worth on the morning of his assassination on November 22, 1963. Photographs of Paxton being lifted above the crowd are on display at the Sixth Floor Museum at Dealey Plaza in Dallas, Texas. He later co-produced the film Parkland about the assassination. He graduated from Arlington Heights High School in Fort Worth in 1973, after which he studied at Richmond College in London, alongside his old high-school friend Danny Martin. There, they met fellow Texas native Tom Huckabee, with whom they made Super 8 short films for which they built their own sets. One of Paxton's first lead roles was in Huckabee's experimental film Taking Tiger Mountain. Paxton subsequently moved to Los Angeles, where he worked in props and art departments and as a parking valet at the Beverly Hills Hotel. After being rejected by film schools in Southern California, he switched his ambitions from directing to acting.",
      "birth_date": "1955-05-17",
      "death_date": "2017-02-25"
    },
    {
      "id": 13,
      "full_name": "Michael Biehn",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Michael_Biehn_by_Gage_Skidmore.jpg/440px-Michael_Biehn_by_Gage_Skidmore.jpg",
      "biography": "Michael Biehn (born July 31, 1956) is an American actor, primarily known for his roles in science fiction films directed by James Cameron; as Sgt. Kyle Reese in The Terminator (1984), Cpl. Dwayne Hicks in Aliens (1986), and Lt. Coffey in The Abyss (1989). His other films include The Fan (1981), The Seventh Sign (1988), Navy SEALs (1990), Tombstone (1993), The Rock (1996), Mojave Moon (1996), Megiddo: The Omega Code 2 (2001), Clockstoppers (2002), and Planet Terror (2007). On television, he has appeared in Hill Street Blues (1984), The Magnificent Seven (1998–2000), and Adventure Inc. (2002–2003). Biehn received a Best Actor Saturn Award nomination for Aliens.\n\nBiehn was born in Anniston, Alabama, the second of three boys born to Marcia (née Connell) and Don Biehn, a lawyer. He is of German, English, Irish and Scottish descent; his surname is of German origin.\n\nWhen he was young, he moved with his family to Lincoln, Nebraska, and then to Lake Havasu City, Arizona, where he was a member of the high school drama club before graduating. He attended the drama program at the University of Arizona, where he was a member of the Sigma Nu fraternity before moving to Hollywood.",
      "birth_date": "1956-07-31",
      "death_date": ""
    },
    {
      "id": 14,
      "full_name": "Lance Henriksen",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Lance_Henriksen_by_Gage_Skidmore.jpg/440px-Lance_Henriksen_by_Gage_Skidmore.jpg",
      "biography": "Henriksen was born on May 5, 1940, in Manhattan, New York. His father, James Henriksen, was a Norwegian merchant sailor and boxer nicknamed \"Icewater\" who spent most of his life at sea, while his mother, Margueritte Werner, struggled to find work as a dance instructor, waitress and model. His parents divorced when he was two years old, and his mother struggled to raise him and his brother, leading to his spending part of his childhood in foster care. During an interview, Henriksen recounted how, at the age of seven, his mother handed him his birth certificate and said, \"You'll always know who you are\", then pushed him out of his home. Henriksen did not actually leave home until he was 12, saying he'd \"had enough\" of his home life, and that he had been physically assaulted by multiple family members: \"I got bludgeoned a lot. Different people, relatives. I remember every single face from my childhood. My alcoholic uncles, whoever. I'm not having a pity party here; I'm not Quasimodo. That's just how it was\". On another occasion, two of his uncles tried to persuade him to take Methadrine and then take part in a staged car accident for the insurance money.\n\nGrowing up, Henriksen had a reputation for getting into trouble in the various schools he attended, and even spent time in a children's home. He left school after completing first grade, and was illiterate until the age of 30.",
      "birth_date": "1940-05-05",
      "death_date": ""
    },
    {
      "id": 15,
      "full_name": "Jenette Goldstein",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Jenette_Goldstein_Comic_Con_2023_%28cropped%29.jpg/440px-Jenette_Goldstein_Comic_Con_2023_%28cropped%29.jpg",
      "biography": "Jenette Elise Goldstein (born February 4, 1960) is an American actress. She is known for starring as Private Vasquez in the sci-fi horror film Aliens (1986), which won her the Saturn Award for Best Supporting Actress. She also played Diamondback in Near Dark (1987) which earned her a second Saturn Award nomination, Megan Shapiro in Lethal Weapon 2 (1989) and Janelle Voight in Terminator 2 (1991). She made cameo appearances in Star Trek Generations (1994) and Titanic (1997) and appeared in two episodes of the television series Star Trek: Short Treks (2019).\n\nGoldstein was born in Los Angeles, California, and raised in Beverly Hills. Her family is from Russia, Morocco, and Brazil. Goldstein trained to be a gymnast before she started her acting career.",
      "birth_date": "1960-02-04",
      "death_date": ""
    },
    {
      "id": 16,
      "full_name": "Keira Knightley",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/b/b1/KeiraKnightleyByAndreaRaffin2011_%28cropped%29.jpg",
      "biography": "Keira Christina Knightley OBE (born 26 March 1985) is an English actress. Known for her work in independent films and blockbusters, particularly period dramas, she has received numerous accolades, including nominations for two Academy Awards, two BAFTAs, three Golden Globes, and a Laurence Olivier Award. In 2018, she was appointed an OBE at Buckingham Palace for services to drama and charity.\n\nBorn in London to actors Will Knightley and Sharman Macdonald, Knightley obtained an agent at age six and initially worked in commercials and television films. Following a minor role as Sabé in Star Wars: Episode I – The Phantom Menace (1999), her breakthrough came when she played a tomboy footballer in Bend It Like Beckham (2002) and co-starred in Love Actually (2003). She went on to achieve global recognition for playing Elizabeth Swann in the Pirates of the Caribbean film series (2003–2007, 2017).\n\nFor her portrayal of Elizabeth Bennet in Pride & Prejudice (2005), Knightley was nominated for the Academy Award for Best Actress. She starred in several more period films over the next few years, including Atonement (2007), The Duchess (2008), A Dangerous Method (2011), and Anna Karenina (2012). She then forayed into contemporary pieces, with headline parts in Seeking a Friend for the End of the World (2012), Begin Again (2013), and Jack Ryan: Shadow Recruit (2014). Knightley returned to historical films playing Joan Clarke in The Imitation Game (2014), earning a nomination for the Academy Award for Best Supporting Actress. She later starred as the title character in Colette (2018) and journalist Loretta McLaughlin in Boston Strangler (2023).\n\nOn stage, Knightley has appeared in two West End productions: The Misanthrope in 2009, which earned her an Olivier Award nomination, and The Children's Hour in 2011. She also starred as the titular heroine in the 2015 Broadway production of Thérèse Raquin. Knightley is known for her outspoken stance on social issues and has worked extensively with Amnesty International, Oxfam, and Comic Relief. She is married to musician James Righton, with whom she has two daughters.",
      "birth_date": "1985-03-26",
      "death_date": ""
    },
    {
      "id": 17,
      "full_name": "Orlando Bloom",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Orlando_Bloom_Cannes_2013.jpg/440px-Orlando_Bloom_Cannes_2013.jpg",
      "biography": "Orlando Jonathan Blanchard Copeland Bloom (born 13 January 1977) is an English actor. He made his breakthrough as the character Legolas in The Lord of the Rings film series (2001–03). He reprised his role in The Hobbit film series (2013–14). Considered by some to be the Errol Flynn of his time, he gained further notice appearing in epic fantasy, historical, and adventure films, notably as Will Turner in the Pirates of the Caribbean film series (2003–07, 2017), Paris in Troy (2004), Balian de Ibelin in Kingdom of Heaven (2005), and the Duke of Buckingham in The Three Musketeers (2011).\n\nBloom appeared in Hollywood films such as the war film Black Hawk Down (2001), the Australian Western Ned Kelly (2003), the romantic comedy Elizabethtown (2005), and New York, I Love You (2007). In 2020 he gained acclaim for the Afghanistan War drama film The Outpost (2020). He also starred in the Amazon Prime Video series Carnival Row (2019–2023).\n\nHe made his professional stage debut in In Celebration at the Duke of York's Theatre in the West End in 2007 and starred in a Broadway adaptation of William Shakespeare's Romeo and Juliet in 2013. He returned to the theatre in a West End revival of Tracy Letts' Killer Joe in 2018. In 2009, Bloom was named a UNICEF Goodwill Ambassador. In 2015 he received the BAFTA Britannia Humanitarian Award.",
      "birth_date": "1977-01-13",
      "death_date": ""
    },
    {
      "id": 18,
      "full_name": "Geoffrey Rush",
      "nationality": "Australia",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Geoffrey_Rush_Final_Portrait_Red_Carpet_Berlinale_2017_01_%28cropped%29.jpg/440px-Geoffrey_Rush_Final_Portrait_Red_Carpet_Berlinale_2017_01_%28cropped%29.jpg",
      "biography": "Geoffrey Roy Rush AC (born 6 July 1951) is an Australian actor. Known for often playing eccentric roles on both stage and screen, he has received numerous accolades, including an Academy Award, a Primetime Emmy Award and a Tony Award, making him the only Australian to achieve the Triple Crown of Acting, in addition to three BAFTA Awards and two Golden Globe Awards. Rush is the founding president of the Australian Academy of Cinema and Television Arts and was named the 2012 Australian of the Year.\n\nRush began his professional acting career with the Queensland Theatre Company in 1971. He studied for two years at the L'École Internationale de Théâtre Jacques Lecoq starting in 1975. Rush starred in international productions of Waiting for Godot, The Winter's Tale and The Importance of Being Earnest. He made his Broadway debut in the absurdist comedy Exit the King in 2009, where he received a Tony Award for Best Actor in a Play for his performance. He received a nomination for Drama Desk Award for Outstanding Actor in a Play for Diary of a Madman in 2011.\n\nHe gained prominence for his role in Shine (1996), for which he won an Academy Award for Best Actor. His other Oscar-nominated roles were for Shakespeare in Love (1998), Quills (2000), and The King's Speech (2010). Rush gained mainstream popularity for his role as Captain Hector Barbossa in the Pirates of the Caribbean franchise (2003–2017). His other notable films include in Elizabeth (1998), Les Misérables (1998), Frida (2002), Finding Nemo (2003), Intolerable Cruelty (2003), Munich (2005), Elizabeth: The Golden Age (2007) and The Book Thief (2013).\n\nRush is also known for his performances in television receiving Primetime Emmy Award for Outstanding Lead Actor in a Limited or Anthology Series or Movie nominations for his portrayals of comedian Peter Sellers in the HBO film The Life and Death of Peter Sellers (2004), and scientist Albert Einstein in National Geographic anthology series Genius (2017), winning for the former.",
      "birth_date": "1951-07-06",
      "death_date": ""
    },
    {
      "id": 19,
      "full_name": "Kevin McNally",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Kevin_McNally_by_Gage_Skidmore.jpg/440px-Kevin_McNally_by_Gage_Skidmore.jpg",
      "biography": "McNally was born in Bristol. McNally spent his early years in Birmingham, attending Redhill Junior School in Hay Mills and Mapledene Junior School (now Mapledene Primary School) in Sheldon. He went to Central Grammar School for Boys on Gressel Lane in Tile Cross.\n\nMcNally's first professional acting work, at age 16, was at the Birmingham Repertory Theatre. In 1973 he received a scholarship to attend the Royal Academy of Dramatic Art where, in 1975, he won the Best Actor Bancroft Gold Medal.\n\nIn 1976, he appeared in BBC's I, Claudius and, in 1977, was a regular in the second series of Poldark playing Drake Carne, younger brother of Demelza Poldark. From 1991 to 1994, he wrote nine episodes of Minder, under the pseudonym Kevin Sperring, with writing partner Bernard Dempsey. He also wrote two episodes of Boon, and two episodes of Lock, Stock with Dempsey.\n\nMcNally played Joshamee Gibbs in the Pirates of the Caribbean films. He is one of only three actors who appear in all five films, and reprised the role in Kingdom Hearts III, making him the only actor from the film series to reprise a role in Kingdom Hearts. He also reprised the role in 2021 for Sea of Thieves' \"A Pirate's Life\" Tall Tale series.\n\nAlong with fellow British actors Ian McNeice and Kenneth Branagh, McNally appeared in two Second World War films, Valkyrie and Conspiracy, that depict behind the scenes activities of high-ranking officials in Nazi Germany.\n\nIn 2011, he was cast in the American television series Supernatural as Frank. In 2012, he performed as a voice actor for the best selling videogame Assassin's Creed III, providing the likeness and voice of the character of Robert Faulkner. In 2013, he began working on a science-fiction animation project, Starship Goldfish.\n\nIn 2014, he played the lead role in re-recorded radio plays of five lost episodes of Hancock's Half Hour for BBC Radio 4. Following this, a further video episode was re-recorded and broadcast on BBC Four as part of the Lost Sitcoms series.\n\nFrom 2014 to 2017, McNally played Judge Richard Woodhull of Setauket, Long Island, in the AMC series Turn: Washington's Spies. In July 2019, he guest-starred as Inspector Grandjean in Season 2, Episode 1 of Amazon's mystery series Maigret.\n\nIn 2019, McNally portrayed Captain Mainwaring in a series of re-enactments of otherwise lost episodes of the sitcom Dad's Army.",
      "birth_date": "1956-04-27",
      "death_date": ""
    },
    {
      "id": 20,
      "full_name": "Elijah Wood",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Elijah_Wood_%2847955397556%29_%28cropped%29.jpg/440px-Elijah_Wood_%2847955397556%29_%28cropped%29.jpg",
      "biography": "Elijah Jordan Wood (born January 28, 1981) is an American actor and producer. He rose to international fame for his portrayal of Frodo Baggins in The Lord of the Rings film trilogy (2001–2003) and The Hobbit: An Unexpected Journey (2012).\n\nWood made his film debut with a small part in Back to the Future Part II (1989). He went on to achieve recognition as a child actor with multiple roles such as Avalon (1990) and The Good Son (1993). As a teenager, he starred in several films including North (1994), Flipper (1996), and The Ice Storm (1997). Following the success of The Lord of the Rings, Wood has appeared in a wide range of films, including Eternal Sunshine of the Spotless Mind (2004), Paris, je t'aime (2006), and I Don't Feel at Home in This World Anymore (2017).\n\nWood's voice roles include Mumble in the Happy Feet film franchise (2006–2011), the title protagonist in 9 (2009), Spyro the Dragon in the Legend of Spyro video game trilogy (2006–2008), Beck on Disney XD's Tron: Uprising (2012–2013), Sigma in Season 10 of Red vs. Blue, and Wirt in the Cartoon Network miniseries Over the Garden Wall (2014). He played Ryan Newman on the FX dark comedy series Wilfred (2011–2014), for which he received a Satellite Award nomination for Best Actor, and Todd Brotzman in the BBC America series Dirk Gently's Holistic Detective Agency (2016–2017).\n\nWood founded the record label Simian Records in 2005, which was dissolved in 2015. He directed the 2007 music video \"Energy\" for The Apples in Stereo. In 2010, Wood co-founded a film production company for horror films, The Woodshed, renamed SpectreVision in 2013. Wood is a disc jockey, and has toured globally with his friend Zach Cowie as the duo Wooden Wisdom.",
      "birth_date": "1981-01-28",
      "death_date": ""
    },
    {
      "id": 21,
      "full_name": "Ian McKellen",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/SDCC13_-_Ian_McKellen.jpg/440px-SDCC13_-_Ian_McKellen.jpg",
      "biography": "Sir Ian Murray McKellen CH CBE (born 25 May 1939) is an English actor. With a career spanning more than sixty years, he is noted for his roles on the screen and stage in genres ranging from Shakespearean dramas and modern theatre to popular fantasy and science fiction. He is regarded as a British cultural icon and was knighted by Queen Elizabeth II in 1991. He has received numerous accolades, including a Tony Award, six Olivier Awards, and a Golden Globe Award as well as nominations for two Academy Awards, five BAFTA Awards and five Emmy Awards.\n\nMcKellen made his stage debut in 1961 at the Belgrade Theatre as a member of its repertory company, and in 1965 made his first West End appearance. In 1969, he was invited to join the Prospect Theatre Company to play the lead parts in Shakespeare's Richard II and Marlowe's Edward II. In the 1970s McKellen became a stalwart of the Royal Shakespeare Company and the National Theatre of Great Britain (England). He has earned five Olivier Awards for his roles in Pillars of the Community (1977), The Alchemist (1978), Bent (1979), Wild Honey (1984), and Richard III (1995). McKellen made his Broadway debut in The Promise (1965). He went on to receive the Tony Award for Best Actor in a Play for his role as Antonio Salieri in Amadeus (1980). He was further nominated for Ian McKellen: Acting Shakespeare (1984). He returned to Broadway in Wild Honey (1986), Dance of Death (1990), No Man's Land (2013), and Waiting for Godot (2013), the latter being a joint production with Patrick Stewart.\n\nMcKellen achieved worldwide fame for his film roles, including the titular King in Richard III (1995), James Whale in Gods and Monsters (1998), Magneto in the X-Men films, and Gandalf in The Lord of the Rings (2001–2003) and The Hobbit (2012–2014) trilogies. Other notable film roles include A Touch of Love (1969), Plenty (1985), Six Degrees of Separation (1993), Restoration (1995), Mr. Holmes (2015), and The Good Liar (2019).",
      "birth_date": "1939-05-25",
      "death_date": ""
    },
    {
      "id": 22,
      "full_name": "Viggo Mortensen",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Viggo_Mortensen_B_%282020%29.jpg/440px-Viggo_Mortensen_B_%282020%29.jpg",
      "biography": "Viggo Peter Mortensen Jr. R (born October 20, 1958) is an American actor, musician, and filmmaker. He is the recipient of various accolades, including nominations for three Academy Awards for Best Actor, three BAFTA Awards, four Golden Globe Awards, and an Independent Spirit Award.\n\nBorn in New York City and raised mainly in Argentina and Denmark, Mortensen made his film debut in a small role in Peter Weir's 1985 thriller Witness. He went on to play supporting roles in several notable films during the 1990s, including The Indian Runner (1991), Carlito's Way (1993), Crimson Tide (1995), Daylight (1996), The Portrait of a Lady (1996), G.I. Jane (1997), A Perfect Murder (1998), A Walk on the Moon (1999), and 28 Days (2000).\n\nMortensen gained international attention for playing Aragorn in the fantasy trilogy The Lord of the Rings (2001–2003). He gained acclaim for his collaborations with filmmaker David Cronenberg in the thrillers A History of Violence (2005), Eastern Promises (2007), for which he was nominated for the Academy Award for Best Actor, and A Dangerous Method (2011). He gained additional Academy Award nominations for his leading roles as an anarchist father in Captain Fantastic (2016) and as Tony Lip in Green Book (2018). Mortensen made his directorial debut with Falling (2020), in which he also starred, and which was nominated for the Goya Award for Best European Film.\n\nAside from acting, Mortensen has explored fine arts, photography, poetry, and music. In 2002, he founded the Perceval Press to publish both his works and the works of little-known artists and authors. Mortensen sang and composed for part of The Lord of the Rings soundtrack and has collaborated with guitarist Buckethead on several albums.",
      "birth_date": "1958-10-20",
      "death_date": ""
    },
    {
      "id": 23,
      "full_name": "Kate Capshaw",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Kate_Capshaw%2C_actress.jpg/440px-Kate_Capshaw%2C_actress.jpg",
      "biography": "Kathleen Sue Spielberg (born November 3, 1953), known professionally as Kate Capshaw, is a retired American actress and painter. She is best known for her portrayal of Willie Scott, an American nightclub singer and performer in Indiana Jones and the Temple of Doom (1984), directed by her eventual husband Steven Spielberg. Since then, she starred in Dreamscape (1984), Power (1986), SpaceCamp (1986), Black Rain (1989), Love Affair (1994), Just Cause (1995), and The Love Letter (1999). Her portraiture work has been shown in the Smithsonian National Portrait Gallery.\n\nCapshaw was born Kathleen Sue Nail, the daughter of Edwin L. Nail, an airline employee. She moved to St. Louis, Missouri, at the age of five, and graduated from Hazelwood Senior High School in 1972. Capshaw earned a degree in education from the University of Missouri, where she was a member of Alpha Delta Pi. She taught Special Education at Southern Boone High School in Ashland, Missouri, and Rock Bridge High School in Columbia, Missouri.\n\nShe married marketing manager Robert Capshaw in January 1976 and they had one child, Jessica Capshaw, before eventually divorcing in 1980. However, she kept the surname Capshaw, which she used for her professional name upon becoming an actress.",
      "birth_date": "1953-11-03",
      "death_date": ""
    },
    {
      "id": 24,
      "full_name": "John Rhys-Davies",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/%28John_Rhys-Davies%29_2018-02-11_15-35-40_ILCE-6500_DSC07150_%2831235662177%29_%28cropped%29.jpg/440px-%28John_Rhys-Davies%29_2018-02-11_15-35-40_ILCE-6500_DSC07150_%2831235662177%29_%28cropped%29.jpg",
      "biography": "John Rhys-Davies (born 5 May 1944) is a Welsh actor known for portraying Sallah in the Indiana Jones franchise and Gimli in The Lord of the Rings trilogy. He has received three Screen Actors Guild Award nominations, with one win, and a Primetime Emmy Award nomination.\n\nDue to his father's work as a colonial police officer, he was raised in Tanganyika (today part of Tanzania) before his family moved to the Welsh town of Ammanford. While in Tanganyika, his family lived in places such as Dar es Salaam, Kongwa, Moshi, and Mwanza. He was educated at independent Truro School in Cornwall and then at the University of East Anglia, where he was one of the first 105 students admitted and became a co-founder of its drama club. After a stint teaching at a secondary school in Watton, Norfolk, he won a place at the Royal Academy of Dramatic Art in London.\n\nJohn Rhys-Davies at Galaxy Con Richmond in 2023\nRhys-Davies is also known for his performances in the films Victor/Victoria (1982), The Living Daylights (1987), The Princess Diaries 2: Royal Engagement (2004), Aquaman (2018) and its sequel Aquaman and the Lost Kingdom (2023). He is also known for his extensive voice work including Aladdin and the King of Thieves (1996), The Jungle Book 2 (2003), Gargoyles (1995–1996), and SpongeBob SquarePants (2000–2002).\n\nHe also gained acclaim for his television roles as Macro in I, Claudius (1976), Vasco Rodrigues in Shōgun (1980), and Michael Malone in The Untouchables (1993). From 1995 to 1997 he portrayed Professor Maximillian Arturo in Sliders.",
      "birth_date": "1944-05-05",
      "death_date": ""
    },
    {
      "id": 25,
      "full_name": "Philip Stone",
      "nationality": "Great Britain (England)",
      "photo": "https://static.wikia.nocookie.net/indianajones/images/5/5a/Blumburtt.jpg",
      "biography": "Philip Stone (14 April 1924 – 15 June 2003) was an English actor, known for portraying film characters such as \"Pa\", the father of Alex DeLarge, in A Clockwork Orange; General Alfred Jodl in Hitler: The Last Ten Days; Delbert Grady in The Shining; and Captain Phillip Blumburtt in Indiana Jones and the Temple of Doom. His final film role was as the Bishop in The Baby of Mâcon.\n\nOn television, Stone is known for his roles as Detective Sergeant Sowman in Coronation Street, Brigadier Davidson in The Rat Catchers and Sir John Gallagher in Justice.\n\nPhilip Stone (né Stones) was born in Kirkstall, Leeds. He was the youngest of four children; his father was a secondary school headmaster.",
      "birth_date": "1924-04-14",
      "death_date": "2003-06-15"
    },
    {
      "id": 26,
      "full_name": "Ke Huy Quan",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Ke_Huy_Quan_at_the_White_House_%2852902390767%29_%28cropped%29.jpg/440px-Ke_Huy_Quan_at_the_White_House_%2852902390767%29_%28cropped%29.jpg",
      "biography": "Ke Huy Quan (born August 20, 1971), also known as Jonathan Ke Quan, is an American actor. As a child actor, Quan rose to fame playing Short Round in Indiana Jones and the Temple of Doom (1984) and Data in The Goonies (1985). Following a few roles in the 1990s, he took a 19-year acting hiatus, during which he worked as a stunt choreographer and assistant director.\n\nQuan returned to acting with the family adventure Finding ʻOhana (2021), followed by the critically acclaimed Everything Everywhere All at Once (2022), a performance that won him various accolades, including an Academy Award, a Golden Globe and a Screen Actors Guild Award. Quan and Haing S. Ngor are the only two actors of Asian descent to win the Academy Award for Best Supporting Actor, and Quan is the first Vietnam-born actor to win an Academy Award. Time magazine named him one of the 100 most influential people in the world in 2023. He has since starred in the second season of the Disney+ series Loki in 2023.\n\nQuan Kế Huy was born on August 20, 1971, in Saigon, South Vietnam, into a family of Chinese descent, with eight siblings. Three years after the end of the Vietnam war in 1975, Quan fled from Vietnam with his family. He, along with his father and five siblings, fled to Hong Kong, while Quan's mother and three other siblings went to Malaysia. After staying at a refugee camp in Hong Kong, Quan's entire family was admitted to the United States as part of the Refugee Admissions Program in 1979. In the U.S., Quan grew up in California, where he attended the Mount Gleason Junior High School in Sunland-Tujunga, Los Angeles and Alhambra High School in Alhambra.",
      "birth_date": "1971-08-20",
      "death_date": ""
    },
    {
      "id": 27,
      "full_name": "Mia Wasikowska",
      "nationality": "Australia",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/MJK_08786_Mia_Wasikowska_%28Damsel%2C_Berlinale_2018%29_%28cropped%29.jpg/440px-MJK_08786_Mia_Wasikowska_%28Damsel%2C_Berlinale_2018%29_%28cropped%29.jpg",
      "biography": "Wasikowska was born on 25 October 1989 in Canberra, Australia. She attended Cook Primary School, Ainslie Primary School and Canberra High School, and Karabar High School in Queanbeyan, which neighbours Canberra. She has an older sister, Jess, and a younger brother, Kai. Her mother, Marzena Wasikowska, is a Polish photographer, while her father, John Reid, is an Australian photographer and collagist. In 1998, when she was eight years old, Wasikowska and her family moved to Szczecin, Poland for a year, after her mother received a grant to produce a collection of work based on her own experience of emigrating from Poland to Australia in 1974 at the age of 11. Wasikowska and her siblings took part in the production as subjects; she explained to Johanna Schneller of The Globe and Mail in July 2010, \"We never had to smile or perform. We weren't always conscious of being photographed. We'd just do our thing, and she'd take pictures of us.\"\n\nAt the age of nine, Wasikowska began studying ballet with Jackie Hallahan at the Canberra Dance Development Centre, with hopes of going professional. She began dancing en pointe at thirteen, and was training 35 hours a week in addition to attending school full-time. Her daily routine consisted of leaving school in the early afternoon and dancing until nine o'clock at night. A spur on her heel hampered her dancing. Her passion for ballet also waned due to the increasing pressure to achieve physical perfection and her growing dissatisfaction with that world in general, and she quit at the age of fourteen. However, she credits ballet with improving her ability to handle her nerves in auditions.\n\nAt the same time, she had been exposed to European and Australian cinema at an early age, and was particularly moved by Krzysztof Kieślowski's Three Colours trilogy and Gillian Armstrong's My Brilliant Career. Although shy and averse to performing during her school years, she was inspired to try to break into acting after seeing Holly Hunter in The Piano and Gena Rowlands in A Woman Under the Influence. She felt acting in film was a way to explore human imperfections. She looked up twelve Australian talent agencies on the Internet and contacted them all, but received only one response. Despite her lack of acting experience, she arranged a meeting after persistent callbacks.",
      "birth_date": "1989-10-14",
      "death_date": ""
    },
    {
      "id": 28,
      "full_name": "Helena Bonham Carter",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Helena_Bonham_Carter_2011_AA.jpg/440px-Helena_Bonham_Carter_2011_AA.jpg",
      "biography": "Helena Bonham Carter CBE (born 26 May 1966) is an English actress. Known for her roles in blockbusters and independent films, particularly period dramas, she has received various awards and nominations, including a British Academy Film Award and an International Emmy Award, in addition to nominations for two Academy Awards, four British Academy Television Awards, five Primetime Emmy Awards, and nine Golden Globe Awards.\n\nBonham Carter rose to prominence by playing Lucy Honeychurch in A Room with a View (1985) and the title character in Lady Jane (1986). Her early period roles saw her typecast as a virginal \"English rose\", a label with which she was uncomfortable. She is best known for her eccentric fashion and dark aesthetic and for often playing quirky women. For her role as Kate Croy in The Wings of the Dove (1997), Bonham Carter received a nomination for the Academy Award for Best Actress, and for her portrayal of Queen Elizabeth in The King's Speech (2010), she won the BAFTA Award for Best Actress in a Supporting Role, and was nominated for the Academy Award for Best Supporting Actress.\n\nHer other films include Hamlet (1990), Howards End (1992), Mary Shelley's Frankenstein (1994), Mighty Aphrodite (1995), Fight Club (1999), Wallace & Gromit: The Curse of the Were-Rabbit (2005), the Harry Potter series (2007–2011) as Bellatrix Lestrange, Great Expectations (2012) as Miss Havisham, Les Misérables (2012), Cinderella (2015), Ocean's 8 (2018), and Enola Holmes (2020). Her collaborations with director Tim Burton, her former domestic partner, include Big Fish (2003), Corpse Bride (2005), Charlie and the Chocolate Factory (2005), Sweeney Todd: The Demon Barber of Fleet Street (2007) as Mrs. Lovett, Alice in Wonderland (2010) as the Red Queen, and Dark Shadows (2012).\n\nFor her role as children's author Enid Blyton in the BBC Four biographical film Enid (2009), she won the 2010 International Emmy Award for Best Actress and was nominated for the British Academy Television Award for Best Actress. Her other television films include Fatal Deception: Mrs. Lee Harvey Oswald (1993), Live from Baghdad (2002), Toast (2010), and Burton & Taylor (2013). From 2019 to 2020, she portrayed Princess Margaret in seasons three and four of Netflix's The Crown earning two Primetime Emmy Award nominations.",
      "birth_date": "1966-05-26",
      "death_date": ""
    },
    {
      "id": 29,
      "full_name": "Arnold Schwarzenegger",
      "nationality": "Austria",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Arnold_Schwarzenegger_by_Gage_Skidmore_4.jpg/440px-Arnold_Schwarzenegger_by_Gage_Skidmore_4.jpg",
      "biography": "Arnold Alois Schwarzenegger (born July 30, 1947) is an Austrian and American actor, businessman, filmmaker, former politician, and former professional bodybuilder known for his roles in high-profile action movies. He served as the 38th governor of California from 2003 to 2011 and was among Time's 100 most influential people in the world in 2004 and 2007.\n\nSchwarzenegger began lifting weights at age 15 and won the Mr. Universe title aged 20, and subsequently the Mr. Olympia title seven times. He is widely regarded as one of the greatest bodybuilders of all time, and has written many books and articles about it. The Arnold Sports Festival, considered the second-most important bodybuilding event after Mr. Olympia, is named after him. He appeared in the bodybuilding documentary Pumping Iron (1977). After retiring from bodybuilding, he gained worldwide fame as a Hollywood action star, with his breakthrough in the sword and sorcery epic Conan the Barbarian (1982), a box-office hit with a sequel in 1984. After playing the title character in the science fiction film The Terminator (1984), he starred in Terminator 2: Judgment Day (1991) and three other sequels. His other successful action films included Commando (1985), The Running Man (1987), Predator (1987), Total Recall (1990), and True Lies (1994), in addition to comedy films such as Twins (1988), Kindergarten Cop (1990) and Jingle All the Way (1996). He is the founder of the film production company Oak Productions.\n\nAs a registered Republican, Schwarzenegger chaired the President's Council on Physical Fitness and Sports during most of the George H. W. Bush administration. On October 7, 2003, he was elected Governor of California in a special recall election to replace then-Governor Gray Davis. He received 48.6% of the vote, 17 points ahead of Democrat runner-up Cruz Bustamante. He was sworn in on November 17 to serve the remainder of Davis' term, and was reelected in the 2006 California gubernatorial election with an increased vote share of 55.9% to serve a full term. In 2011 he reached his term limit as governor and returned to acting.\n\nSchwarzenegger was nicknamed the \"Austrian Oak\" in his bodybuilding days, \"Arnie\" or \"Schwarzy\" during his acting career, and \"the Governator\" (a portmanteau of \"Governor\" and \"Terminator\") during his political career. He married Maria Shriver, a niece of President John F. Kennedy, in 1986. They separated in 2011 after he admitted to having fathered a child with their housemaid in 1997; their divorce was finalized in 2021.",
      "birth_date": "1947-07-30",
      "death_date": ""
    },
    {
      "id": 30,
      "full_name": "Sean Connery",
      "nationality": "Great Britain (England)",
      "birth_date": "1930-08-25",
      "death_date": "2020-10-31",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Sean_Connery_%281983%29.jpg/220px-Sean_Connery_%281983%29.jpg",
      "biography": "Sir Sean Connery (25 August 1930 – 31 October 2020) was a Scottish actor. He was the first actor to portray fictional British secret agent James Bond on film, starring in seven Bond films between 1962 and 1983. Connery originated the role in Dr. No (1962) and continued starring as Bond in the Eon Productions films From Russia with Love (1963), Goldfinger (1964), Thunderball (1965), You Only Live Twice (1967) and Diamonds Are Forever (1971). Connery made his final appearance in the franchise in Never Say Never Again (1983), a non-Eon-produced Bond film.\n\nHe is also known for his notable collaborations with directors such as Alfred Hitchcock, Sidney Lumet and John Huston. Their films in which Connery appeared included Marnie (1964), The Hill (1965), The Offence (1973), Murder on the Orient Express (1974) and The Man Who Would Be King (1975). He also acted in Robin and Marian (1976), A Bridge Too Far (1977), Time Bandits (1981), Highlander (1986), The Name of the Rose (1986), The Untouchables (1987), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Dragonheart (1996), The Rock (1996) and Finding Forrester (2000). His final on-screen role was as Allan Quatermain in The League of Extraordinary Gentlemen (2003).\n\nConnery received numerous accolades including a BAFTA Award, three Golden Globe Awards and an Academy Award, the first Scottish actor to win the lattermost achievement. He also received honorary awards such as the Cecil B. DeMille Award in 1987, the BAFTA Fellowship in 1998 and the Kennedy Center Honors in 1999. He was made a Commander of the Order of Arts and Letters in France and a knight by Queen Elizabeth II for his services to drama in 2000."
    },
    {
      "id": 31,
      "full_name": "Hugh Laurie",
      "nationality": "Great Britain (England)",
      "birth_date": "1959-06-11",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Hugh_Laurie%2C_from_a_bit_of_Fry_%26_Laurie%2C_http---en.wikipedia.org-wiki-Hugh_laurie_%289450843901%29_%28cropped%29.jpg/220px-Hugh_Laurie%2C_from_a_bit_of_Fry_%26_Laurie%2C_http---en.wikipedia.org-wiki-Hugh_laurie_%289450843901%29_%28cropped%29.jpg",
      "biography": "James Hugh Calum Laurie CBE is an English actor, comedian, writer, and musician. He first gained recognition for his work as one half of the English comedy double act Fry and Laurie with Stephen Fry. The two acted together in a number of projects during the 1980s and 1990s, including the BBC sketch comedy series A Bit of Fry & Laurie and the P. G. Wodehouse adaptation Jeeves and Wooster. From 1986 to 1989 he appeared in three series of the period comedy Blackadder, first as a recurring guest star in the last two episodes of Blackadder II, before joining the main cast in Blackadder the Third, and going on to appear in Blackadder Goes Forth and many specials of the show except for The Black Adder and Blackadder: The Cavalier Years.\n\nFrom 2004 to 2012 Laurie starred as Dr. Gregory House on the Fox medical drama series House. He received two Golden Globe Awards and many other accolades for the role. He was listed in the 2011 Guinness World Records as the most watched leading man on television and was one of the highest-paid actors in a television drama at the time, earning $409,000 (£250,000) per episode. By the end of the series, he was earning $700,000 an episode. His other television credits include appearing in the London-based Friends episode, \"The One with Ross's Wedding\" (1998), starring as the main antagonist, arms dealer Richard Onslow Roper in the miniseries The Night Manager (2016), for which he won his third Golden Globe and playing Senator Tom James in the HBO sitcom Veep (2012–2019), for which he received his 10th Emmy Award nomination.\n\nLaurie has appeared in films, Peter's Friends (1992), Sense and Sensibility (1995), 101 Dalmatians (1996), The Borrowers (1997), The Man in the Iron Mask (1998), Stuart Little (1999), Life with Judy Garland: Me and My Shadows (2001), Flight of the Phoenix (2004), Tomorrowland (2015), Arthur Christmas (2011) in which he voiced Steven Claus, and The Personal History of David Copperfield (2020).\n\nOutside acting, Laurie released the blues albums Let Them Talk (2011) and Didn't It Rain (2013), both to favourable reviews. He wrote the novel The Gun Seller (1996). He was appointed OBE in the 2007 New Year Honours and CBE in the 2018 New Year Honours, both for services to drama."
    },
    {
      "id": 32,
      "full_name": "Mel Gibson",
      "nationality": "United States of America",
      "birth_date": "1956-01-03",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Mel_Gibson_Cannes_2016_2.jpg/220px-Mel_Gibson_Cannes_2016_2.jpg",
      "biography": "Mel Columcille Gerard Gibson (born January 3, 1956) is an American actor and film director. He is known for his action hero roles, particularly his breakout role as Max Rockatansky in the first three films of the post-apocalyptic action series Mad Max and as Martin Riggs in the buddy cop action-comedy film series Lethal Weapon. Born in Peekskill, New York, Gibson moved with his parents to Sydney, Australia, when he was 12 years old. He studied acting at the National Institute of Dramatic Art, where he starred opposite Judy Davis in a production of Romeo and Juliet. During the 1980s, he founded Icon Entertainment, a production company, which independent film director Atom Egoyan has called \"an alternative to the studio system\". Director Peter Weir cast him as one of the leads in the World War I drama Gallipoli (1981), which earned Gibson a Best Actor Award from the Australian Film Institute. In 1985, Gibson was named as People magazine's first Sexiest Man Alive. In 1995, Gibson produced, directed, and starred in Braveheart, a historical epic, for which he won the Golden Globe Award for Best Director, the Academy Award for Best Director, and the Academy Award for Best Picture. He later directed and produced The Passion of the Christ, a biblical drama that was both financially successful and highly controversial. He received further critical notice for his directorial work of the action-adventure film Apocalypto (2006), which is set in Mesoamerica during the early 16th century. After several legal issues and controversial statements leaked to the public, Gibson's popularity in Hollywood declined, affecting his careers in acting and directing. His career began seeing a resurgence with his performance in Edge of Darkness (2010) and Jodie Foster's The Beaver (2011). His directorial comeback after an absence of 10 years, Hacksaw Ridge (2016), won two Academy Awards, and was nominated for another four including Best Picture and Best Director for Gibson, his second nomination in the category."
    },
    {
      "id": 33,
      "full_name": "Stanislav Boklan",
      "nationality": "Ukraine",
      "birth_date": "1960-01-12",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/%D0%90%D0%BA%D1%82%D1%91%D1%80_%D0%A1%D1%82%D0%B0%D0%BD%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_%D0%91%D0%BE%D0%BA%D0%BB%D0%B0%D0%BD_%28cropped%29.JPG/440px-%D0%90%D0%BA%D1%82%D1%91%D1%80_%D0%A1%D1%82%D0%B0%D0%BD%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_%D0%91%D0%BE%D0%BA%D0%BB%D0%B0%D0%BD_%28cropped%29.JPG",
      "biography": "Boklan was born on January 12, 1960, in Brusyliv, Zhytomyr Oblast, Soviet Union. Bolkan's family resided in Brusyliv until then moving to Kyiv, where he spent the majority of his childhood. After finishing school, Boklan became employed as a meter of electrical parameters in a micromodule at the Kristall plant.\n\nBoklan initially failed the entrance exams when first applying for the Kyiv National I. K. Karpenko-Kary Theatre, Cinema and Television University but was advised to return again next year. In 1984, he graduated from the university.\n\nAfter graduating, Bolkan moved to Mariupol and joined the Donetsk Russian Drama Theater, which he remained part of for 10 years from 1984 to 1994. In the group, he both played a number of roles and wrote several songs for performances. Boklan then joined the Kyiv Academic Young Theatre in 1994. He stayed with the theater group until early 2020, then left the group for unknown reasons.\n\nIn 2014, he played Ivan Kocherga, a blind kobzar, in The Guide which was selected, although not nominated, as the Ukrainian entry for the Best Foreign Language Film at the 87th Academy Awards. It did, however, bring Boklan an award for best actor at the Odesa International Film Festival. In 2015, he starred as the Prime-minister of Ukraine Yuriy Ivanovich Chuiko for Kvartal-95 studio's Servant of the People. He would go on to appear in all 3 seasons as a regular character. Also in 2015, he starred as the father of Major Lyudmila Pavlichenko in Battle of Sevastopol.\n\nStanislav has one younger brother, Mykola Boklan, who is also an actor.\n\nWhile in the Kyiv Academic Young Theater, Boklan met Natalia Klenina who he later married. "
    },
    {
      "id": 34,
      "full_name": "Pierre Richard",
      "nationality": "France",
      "birth_date": "1934-08-16",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Pierre_Richard_Cannes_2015.jpg/220px-Pierre_Richard_Cannes_2015.jpg",
      "biography": "Pierre Richard (born Pierre-Richard Maurice Charles Léopold Defays; 16 August 1934) is a French actor, film director and screenwriter, best known for the roles of a clumsy daydreamer in comedy films. Richard is considered by some, such as Louis de Funès and Gérard Depardieu, to be one of the greatest French comedians of the last 50 years. He is also a film director and occasional singer.\n\nPierre Richard was born in a bourgeois family from Valenciennes. He is the grandson of Léopold Defays who was the director of the company Escaut-et-Meuse. His name comes from the stage name of Pierre Richard-Willm who was his mother's favorite actor. Richard spent his childhood and a part of his teenage years in his native city where he was a student at the Henri-Wallon high school.\n\nSkipping classes regularly to go to the cinema, it was Danny Kaye in Up in Arms that revealed his vocation. This was received with only a moderate enthusiasm by his family, but he decided nonetheless to go to Paris to study dramatic arts at the famous Ecole Charles Dullin. His debuts were far from brilliant (he wanted to play straight drama, which was not in his nature) and he studied kinesiotherapy to have a safety exit if needed, but did not renounce acting."
    },
    {
      "id": 35,
      "full_name": "Jackie Chan",
      "nationality": "China",
      "birth_date": "1954-04-07",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Jackie_Chan_by_Gage_Skidmore.jpg/192px-Jackie_Chan_by_Gage_Skidmore.jpg",
      "biography": "Chan Kong-sang] (born 7 April 1954), known professionally as Jackie Chan, is a Hong Kong actor, director, writer, producer, martial artist, and stuntman known for his slapstick acrobatic fighting style, comic timing, and innovative stunts, which he typically performs himself. Before entering the film industry, he was one of the Seven Little Fortunes from the China Drama Academy at the Peking Opera School, where he studied acrobatics, martial arts, and acting. Chan has been acting since the 1960s, performing in more than 150 films. He is one of the most influential action film stars of all time.\n\nAfter appearing in many Hong Kong films as a stuntman, Chan's first major breakthrough was the 1978 kung Fu action comedy film Snake in the Eagle's Shadow. He then starred in similar kung Fu action comedy films such as 1978's Drunken Master and 1980's The Young Master. In 1979, he made his directorial debut with The Fearless Hyena, which was a box office success. 1983's Project A saw the official formation of the Jackie Chan Stunt Team and established Chan's signature style of elaborate, dangerous stunts combined with martial arts and slapstick humor, a style he further developed in a more modern setting with 1984's Wheels on Meals and 1985's Police Story. Rumble in the Bronx (1995), which had a successful worldwide theatrical run, brought Chan into the North American mainstream, leading to a successful Hollywood career with the Rush Hour and Shanghai series. In 2010, Chan appeared in his first dramatic role in an American film, The Karate Kid.\n\nChan is one of the most recognizable and influential film personalities in the world, with a widespread global following in both the Eastern and Western hemispheres. He has received fame stars on the Hong Kong Avenue of Stars and the Hollywood Walk of Fame, as well as an honorary Academy Award for his \"extraordinary achievements\" in film. Chan has been referenced in various pop songs, cartoons, films, and video games. He is an operatically trained vocalist and is also a Cantopop and Mandopop star, having released a number of music albums and sung many of the theme songs for the films in which he has starred. He is also a globally known philanthropist and has been named one of the top 10 most charitable celebrities by Forbes magazine. In 2004, film scholar Andrew Willis stated that Chan was perhaps the \"most recognized film star in the world.\" In 2015, Forbes estimated his net worth to be $350 million, and as of 2016, he was the second-highest-paid actor in the world.\n\nChan's views on Hong Kong politics have gradually shifted from a pro-democratic stance in the 1990s to a pro-Beijing stance since the 2010s. Since 2013, Chan has been a pro-Chinese Communist Party (CCP) politician, having served two terms as a delegate to the Chinese People's Political Consultative Conference, and, in 2021, expressing his desire to join the CCP."
    },
    {
      "id": 36,
      "full_name": "Katheryn Winnick",
      "nationality": "Canada",
      "birth_date": "1977-12-17",
      "death_date": "",
      "photo": "https://i.pinimg.com/736x/b7/7c/cc/b77cccdb53376f1f1d153f952b397b09.jpg",
      "biography": "Winnick was born in Etobicoke, Ontario, and is of Ukrainian descent. She spoke Ukrainian as her first language and did not begin speaking English until she was eight years old. She has two brothers.\n\nShe began training in martial arts at age seven, and obtained her first black belt at 13. By age 21, she had started three Taekwondo schools. She taught Taekwondo and self-defense to actors while completing her degree in kinesiology at York University, Toronto. Winnick studied at and is an alumnus of the William Esper Studio.\n\nWinnick started acting as a young girl at her community centre in Toronto. She had directed plays in her high school and won a scholarship for drama and directing while attending Richview Collegiate Institute.\n\nWinnick entered the film industry by teaching martial arts to actors on movie sets; the experience inspired her to pursue professional acting. She was then cast as a series regular on Student Bodies.\n\nWinnick starred in the comedy-drama film Cold Souls, which had its world premiere at the Sundance Film Festival 2009. In 2011, she was cast in a guest role on The CW's spy drama Nikita. In 2013, she starred in A Glimpse Inside the Mind of Charles Swan III and appeared in the comedy The Art of the Steal. She also joined History Channel's Vikings, starring in the role of Lagertha, a legendary figure in Viking history. In July 2017, Winnick stated on her Twitter account that she had been cast for a role in what was thought to be a film project, and that it would be announced at the San Diego Comic-Con International. She was later revealed to be cast as a main character in the Nazi Zombies mode of the video game Call of Duty: WWII.\n\nIn July 2018, it was announced that Winnick had been cast in the series regular role of Christine \"C.G.\" Gavin on the Netflix series, Wu Assassins. In February 2020, Winnick was announced to play the starring role of Jenny Hoyt on the ABC crime drama series Big Sky."
    },
    {
      "id": 37,
      "full_name": "Ryan Gosling",
      "nationality": "Canada",
      "birth_date": "1980-11-12",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Ryan_Gosling_in_2018.jpg/220px-Ryan_Gosling_in_2018.jpg",
      "biography": "Ryan Thomas Gosling is a Canadian actor. Prominent in both independent films and major studio features, his films have grossed over $2 billion worldwide. Gosling has received various accolades, including a Golden Globe Award, and nominations for three Academy Awards and two British Academy Film Awards.\n\nGosling rose to prominence aged 13 on Disney Channel's The Mickey Mouse Club (1993–1995), and went on to appear in other family entertainment programs, including Are You Afraid of the Dark? (1995) and Goosebumps (1996). His breakthrough role was that of a Jewish neo-Nazi in The Believer (2001), and he gained stardom in the 2004 romantic drama The Notebook. He starred in the critically acclaimed independent dramas Half Nelson (2006), for which he was nominated for the Academy Award for Best Actor; Lars and the Real Girl (2007), and Blue Valentine (2010).\n\nIn 2011, Gosling had three mainstream successes in the romantic comedy Crazy, Stupid, Love, the political drama The Ides of March, and the action thriller Drive. After making his directorial debut with Lost River (2014), he starred in the financial satire The Big Short (2015), the action comedy The Nice Guys (2016), and the romantic musical La La Land (2016), the latter won him a Golden Globe and a second Academy Award nomination for Best Actor. Further acclaim followed with the science fiction film Blade Runner 2049 (2017) and the biopic First Man (2018). In 2023, he played Ken in the fantasy comedy Barbie, which emerged as his highest-grossing release and earned him a nomination for the Academy Award for Best Supporting Actor.\n\nGosling's band, Dead Man's Bones, released their self-titled debut album and toured North America in 2009. He is a co-owner of Tagine, a Moroccan restaurant in Beverly Hills, California. He is a supporter of PETA, Invisible Children, and the Enough Project and has traveled to Chad, Uganda and eastern Congo to raise awareness about conflicts in the regions. He has been involved in peace promotion efforts in Africa for over a decade. He is in a relationship with actress Eva Mendes, with whom he has two daughters."
    },
    {
      "id": 38,
      "full_name": "Paul Freeman",
      "nationality": "Great Britain (England)",
      "birth_date": "1943-01-18",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Paul_Freeman.jpg/220px-Paul_Freeman.jpg",
      "biography": "Freeman was born in Barnet, Hertfordshire, on 18 January 1943. He is married to Maggie Scott, who was his co-star in the 1980 film The Dogs of War. They have one daughter. Freeman was previously married to actress Judy Matheson. Freeman studied acting at the Royal Shakespeare Company and the National Theatre.\n\nPaul and Maggie Scott are both co-founders of the charity UK Friends of Healing Focus (UKHF), which works in partnership with Uganda NGO, Healing Focus Orphanage Centre. Freeman is a regular visitor to the orphanage.\n\nHe began his career in advertising and teaching, and landed small roles in the theatre, appearing in productions of A Midsummer Night's Dream and Hamlet. He had starring roles in the National Theatre and the Royal Shakespeare Company, and later co-founded the Joint Stock Theatre Company in 1974, along with director Max Stafford-Clark.\n\nFreeman made his television debut in 1978 in the serial Will Shakespeare (1978). He also acted in the docudrama Death of a Princess, a film about the execution of Misha'al bint Fahd al Saud of Saudi Arabia. Freeman began his feature film career in 1980 when he appeared in The Long Good Friday, and The Dogs of War. In 1981, he starred in the TV show Winston Churchill: The Wilderness Years.\n\nIn the same year, Steven Spielberg and George Lucas chose Freeman to play archaeologist René Belloq, the archrival to Indiana Jones, in the adventure film Raiders of the Lost Ark, opposite Harrison Ford. The film led to Freeman becoming typecast in villainous roles, especially Nazis. He played the conniving wine baron Gustav Riebmann in the fourth season of Falcon Crest, airing in 1984–1985.\n\nPaul Freeman starred as Martin Daniels in the series Yesterday's Dreams in 1987.\n\nIn 1988, he played Professor Moriarty in comedy film Without a Clue, which starred Michael Caine as a mini-brained Sherlock Holmes and Ben Kingsley as Watson, who is secretly the real crime-solving genius. In 1995, Freeman was cast as the villain Ivan Ooze in Mighty Morphin Power Rangers: The Movie.\n\nFreeman guest-starred in television shows such as Monarch of the Glen, ER, Falcon Crest, and The Young Indiana Jones Chronicles. He also played in several mini-series, including Murderers Among Us: The Simon Wiesenthal Story (1989), and The Final Cut (1995). In 2004, Freeman played Angus, Bobby Jones' caddie, in Bobby Jones: A Stroke of Genius. During 2006 and 2007, he starred in the drama New Street Law. Also in 2007, he played Rev. Philip Shooter of Sandford in Hot Fuzz.\n\nAmong his television work, Freeman has appeared in an episode of Midsomer Murders, titled \"Down Among the Dead Men\". He also appeared in the Waking the Dead, in the episode \"Straw Dog\", and played Adam Kingsley in the BBC adaptation of Minette Walters' The Dark Room. He was seen in the episode \"Appointment with Death\", as Colonel Carbury in Agatha Christie's Poirot.\n\nHe appeared as George Aaranow in the 2008 London revival of David Mamet's Glengarry Glen Ross.\n\nIn 2012, he played Thomas Erpingham in the BBC adaptation of William Shakespeare's Henry V from The Hollow Crown series."
    },
    {
      "id": 39,
      "full_name": "Russell Crowe",
      "nationality": "New Zealand",
      "birth_date": "1964-04-07",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Russell_Crowe_%2833994020424%29.jpg/220px-Russell_Crowe_%2833994020424%29.jpg",
      "biography": "Russell Ira Crowe (born 7 April 1964) is an actor. He was born in New Zealand, spending 10 years of his childhood in Australia and residing there permanently by age 21. His work on screen has earned him various accolades, including an Academy Award, two Golden Globe Awards, and a British Academy Film Award.\n\nCrowe began acting in Australia and had his breakout role in the drama Romper Stomper (1992). He gained international recognition for his starring roles as a police detective in the thriller L.A. Confidential (1997) and Jeffrey Wigand in the drama The Insider (1999). Crowe gained wider stardom for playing the title role in the period film Gladiator (2000), winning the Academy Award for Best Actor. Further acclaim came for portraying mathematician John Forbes Nash Jr. in the biopic A Beautiful Mind (2001). He then starred in the war film Master and Commander: The Far Side of the World (2003), the sports drama Cinderella Man (2005), the Western 3:10 to Yuma (2007), the crime drama American Gangster (2007), the thriller State of Play (2009), and the action film Robin Hood (2010).\n\nCrowe has since appeared as Javert in the musical Les Misérables (2012), Jor-El in the superhero film Man of Steel (2013), Noah in the biblical drama Noah (2014), and Zeus in the Marvel Cinematic Universe film Thor: Love and Thunder (2022). In 2014, he made his directorial debut with the drama The Water Diviner, in which he also starred. He has been the co-owner of the National Rugby League (NRL) team South Sydney Rabbitohs since 2006."
    },
    {
      "id": 40,
      "full_name": "Joaquin Phoenix",
      "nationality": "United States of America",
      "birth_date": "1974-10-28",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Joaquin_Phoenix_in_2018.jpg/220px-Joaquin_Phoenix_in_2018.jpg",
      "biography": "Joaquin Rafael Phoenix is an American actor. Known for his roles as dark, unconventional and eccentric characters in independent film, in particular period dramas, he has received various accolades, including an Academy Award, a British Academy Film Award, a Grammy Award, and two Golden Globe Awards. In 2020, The New York Times named him one of the greatest actors of the 21st century.\n\nPhoenix began his career by appearing in television series in the early 1980s with his brother River. His first major film roles were in SpaceCamp (1986) and Parenthood (1989). During this period, he was credited as Leaf Phoenix, a name he gave himself. He took back his birth name in the early 1990s and received critical acclaim for his supporting roles in the comedy-drama To Die For (1995) and the period film Quills (2000). Phoenix received further critical acclaim and a nomination for the Academy Award for Best Supporting Actor for his portrayal of Commodus in the historical drama Gladiator (2000). He had success with the horror films Signs (2002) and The Village (2004), the historical drama Hotel Rwanda (2004), and won a Grammy Award, a Golden Globe Award, and a nomination for the Academy Award for Best Actor for his portrayal of musician Johnny Cash in the biopic Walk the Line (2005).\n\nFollowing a brief sabbatical, Phoenix starred in the psychological drama The Master (2012), winning the Volpi Cup for Best Actor and earning his third Academy Award nomination. He gained praise for his roles in the romantic drama Her (2013) and the crime satire Inherent Vice (2014), and won the Cannes Film Festival Award for Best Actor for the psychological thriller You Were Never Really Here (2017). For his performance as the titular character of Joker (2019), Phoenix won the Academy Award for Best Actor. He has since starred in the independent films C'mon C'mon (2021) and Beau Is Afraid (2023), and portrayed the title role in the historical drama Napoleon (2023).\n\nPhoenix is an animal rights activist. He has been vegan since the age of three and regularly supports charitable causes and has produced several documentaries on global meat consumption and its impact on the environment. He is in a relationship with actress Rooney Mara, with whom he has two children."
    },
    {
      "id": 41,
      "full_name": "Connie Nielsen",
      "nationality": "Denmark",
      "birth_date": "1965-07-03",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Connie_Nielsen_by_Gage_Skidmore.jpg/220px-Connie_Nielsen_by_Gage_Skidmore.jpg",
      "biography": "Nielsen was born in Frederikshavn and grew up in the village of Elling, Denmark. Her father, Bent Nielsen, was a bus driver, and her mother, Laila Inge-lise Matzigkeit (1945–2014), was an insurance clerk, who also acted and wrote musical reviews. She was raised as a member of the Church of Jesus Christ of Latter-day Saints, a Mormon.\n\nShe began her acting career working alongside her mother on the local revue and variety scene. At 18, she traveled to Paris, France, where she worked as an actress and model, which led to further work and study in Italy—at drama school in Rome and in master classes with Lydia Styx, a teacher at Piccolo Teatro di Milano in Milan. She lived in Italy for many years before moving to the United States.\n\nNielsen's feature film debut was the Jerry Lewis French film Par où t'es rentré ? On t'a pas vu sortir in 1984, followed by a role in the Italian mini-series Colletti Bianchi in 1988. She appeared in the Italian film Vacanze di Natale '91 (1991) and the French film Le Paradis Absolument (1993).\n\nShe moved to the United States in the mid-1990s and made her first appearance in a major English-language film in 1997 as Christabella Andreoli in The Devil's Advocate, starring opposite Al Pacino and Keanu Reeves. This first minor breakthrough led to roles in the films Permanent Midnight (1998), Rushmore (1998), and Soldier (1998).\n\nIn 2000, Nielsen appeared as Lucilla in Ridley Scott's Gladiator, starring opposite Russell Crowe and Joaquin Phoenix. Since then, she has starred in American films including Mission to Mars (2000), One Hour Photo (2002), The Hunted (2003), and Basic (2003), for which she had to cut off most of her hair. She also starred in the French thriller Demonlover (2002), directed by Olivier Assayas. She played the Irish mother to an orphan in A Shine of Rainbows (2009).\n\nWith Charlotte Gainsbourg, Jamie Bell and Uma Thurman, Nielsen appeared in the 2014 Lars Von Trier film Nymphomaniac. She was featured in a series of promotional posters prior to the film's release, a campaign The Independent described as \"shocking\", observing that \"Connie Nielsen appears somewhat moist in this poster for Nymphomaniac\".\n\nIn 2015, she appeared on the TV-2 album Det gode liv where she sang along with Steffen Brandt on the track \"Brev til Mona\". In September 2018 she appeared in the pilot episode of the CBS drama FBI with Jeremy Sisto and Missy Peregrym.\n\nNielsen is known as Queen Hippolyta in DC Extended Universe franchise, appeared in four films beginning with Wonder Woman (2017)."
    },
    {
      "id": 42,
      "full_name": "Oliver Reed",
      "nationality": "Great Britain (England)",
      "birth_date": "1938-02-13",
      "death_date": "1999-05-02",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Oliver_Reed_1968_%28cropped%29.jpg/220px-Oliver_Reed_1968_%28cropped%29.jpg",
      "biography": "Robert Oliver Reed was born on 13 February 1938 at 9 Durrington Park Road, Wimbledon, southwest London, to Peter Reed, a sports journalist, and Marcia (née Napier-Andrews). He was the nephew of film director Sir Carol Reed, and grandson of the actor-manager Sir Herbert Beerbohm Tree and his mistress, Beatrice May Pinney (who later assumed the name 'Reed'), she being \"the only person who understood, listened to, encouraged and kissed Oliver\". Reed claimed to have been a descendant (through an illegitimate step) of Peter the Great, Tsar of Russia. Reed attended 14 schools, including Ewell Castle School in Surrey. \"My father thought I was just lazy,\" Reed later said. \"He thought I was a dunce.\"\n\nReed claimed he had worked as a boxer, a bouncer, a taxi driver and a hospital porter. He then did his compulsory army service in the Royal Army Medical Corps. \"The army helped,\" he said later. \"I recognized that most other people were actors as well. I was in the peacetime army and they were all telling us youngsters about the war.\"\n\nAfter making his first significant screen appearances in Hammer Horror films in the early 1960s, his notable films include The Trap (1966), playing Bill Sikes in Oliver! (a film directed by his uncle Carol Reed that won the 1968 Academy Award for Best Picture), Women in Love (1969), Hannibal Brooks (1969), The Devils (1971), Athos in The Three Musketeers (1973) and The Four Musketeers (1974), the stepfather in Tommy (1975), The Brood (1979), Funny Bones (1995) and Gladiator (2000).\n\nFor playing Antonius Proximo, the old, gruff gladiator trainer in Ridley Scott's Gladiator, in what was his final film, Reed was posthumously nominated for the BAFTA Award for Best Actor in a Supporting Role in 2000. At the peak of his career, in 1971, British exhibitors voted Reed fifth-most-popular star at the box office. The British Film Institute (BFI) stated that \"partnerships with Michael Winner and Ken Russell in the mid-60s saw Reed become an emblematic Brit-flick icon\", but from the mid-1970s his alcoholism began affecting his career, with the BFI adding: \"Reed had assumed Robert Newton's mantle as Britain's thirstiest thespian\".\n\n"
    },
    {
      "id": 43,
      "full_name": "Derek Jacobi",
      "nationality": "Great Britain (England)",
      "birth_date": "1938-10-22",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Sir_Derek_Jacobi.jpg/440px-Sir_Derek_Jacobi.jpg",
      "biography": "Sir Derek George Jacobi CBE is an English actor. Jacobi is known for his work at the Royal National Theatre and for his film and television roles. He has received numerous accolades including a BAFTA Award, two Olivier Awards, two Primetime Emmy Awards, two Screen Actors Guild Awards, and a Tony Award. He was given a knighthood for his services to theatre by Queen Elizabeth II in 1994.\n\nJacobi started his professional acting career with Laurence Olivier as one of the founding members of the National Theatre. He has appeared in numerous Shakespearean stage productions including Hamlet, Much Ado About Nothing, Macbeth, Twelfth Night, The Tempest, King Lear, and Romeo and Juliet. Jacobi received the Laurence Olivier Award, for the title role in Cyrano de Bergerac in 1983 and Malvolio in Twelfth Night in 2009. He also won the Tony Award for Best Actor in a Play for his role as Benedick in Much Ado About Nothing in 1985.\n\nJacobi has also made numerous television appearances including starring as Claudius in the BBC series I, Claudius (1976), for which he won the British Academy Television Award for Best Actor. He received two Primetime Emmy Awards for Outstanding Supporting Actor in a Miniseries or Movie for The Tenth Man (1988), and Outstanding Guest Actor in a Comedy Series for Frasier (2001). He is also known for his roles in the medieval drama series Cadfael (1994–1998), the HBO film The Gathering Storm (2002), the ITV sitcom Vicious (2013-2016) and in BBC's Last Tango in Halifax (2012–2020). He portrayed Edward VIII, the Duke of Windsor, in the third season of the acclaimed Netflix series The Crown in 2019.\n\nThough principally a stage actor, Jacobi has appeared in a number of films, including Othello (1965), The Day of the Jackal (1973), Henry V (1989), Dead Again (1991), Hamlet (1996), Gladiator (2000), Nanny McPhee (2005), The Riddle (2007), My Week with Marilyn (2011), Anonymous (2011), Cinderella (2015), and Murder on the Orient Express (2017). Jacobi has also earned two Screen Actors Guild Awards along with the ensemble cast for Robert Altman's Gosford Park (2001), and Tom Hooper's The King's Speech (2010).\n"
    },
    {
      "id": 44,
      "full_name": "Djimon Hounsou",
      "nationality": "Benin",
      "birth_date": "1964-04-24",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Djimon_Hounsou_by_Gage_Skidmore_2.jpg/220px-Djimon_Hounsou_by_Gage_Skidmore_2.jpg",
      "biography": "Djimon Gaston Hounsou is a Beninese-born actor. He began his career appearing in music videos and made his film debut in Without You I'm Nothing (1990). He then earned widespread recognition for his role as Cinqué in the Steven Spielberg film Amistad (1997), which earned him a Golden Globe nomination. For his performances in In America (2002) and Blood Diamond (2006), Hounsou was nominated for the Academy Award for Best Supporting Actor.\n\nIn the Marvel Cinematic Universe, he portrays Korath the Pursuer in Guardians of the Galaxy (2014), Captain Marvel (2019) and What If...? (2021). In the DC Extended Universe, he appears as the Fisherman King in Aquaman (2018), and as the wizard Shazam in Shazam! (2019), Black Adam (2022), and Shazam! Fury of the Gods (2023). His other notable films include Stargate (1994), Gladiator (2000), Constantine, The Island (both 2005), Special Forces (2011), How to Train Your Dragon 2 (2014), Furious 7 (2015), The Legend of Tarzan (2016), A Quiet Place Part II (2021), Gran Turismo, Rebel Moon – Part One: A Child Of Fire (both 2023), and Rebel Moon – Part Two: The Scargiver (2024).\n\nHounsou made his directorial debut with the documentary film In Search of Voodoo: Roots to Heaven (2018).\n\nHounsou was born in Cotonou, Benin, to Albertine and Pierre Hounsou. He immigrated to Lyon in France at the age of 12 with his brother Edmond. Soon after arriving there, he dropped out of school and was homeless for a time. A chance meeting with a photographer led to an introduction to fashion designer Thierry Mugler, who encouraged Hounsou to pursue a modelling career. In 1987, he became a model and established a career in Paris. He moved to the United States in 1990."
    },
    {
      "id": 45,
      "full_name": "Richard Harris",
      "nationality": "Great Britain (England)",
      "birth_date": "1930-10-01",
      "death_date": "2002-10-25",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Richard_Harris_1985_%281%29.jpg/440px-Richard_Harris_1985_%281%29.jpg",
      "biography": "Richard St John Francis Harris (1 October 1930 – 25 October 2002) was an Irish actor and singer. Having studied at the London Academy of Music and Dramatic Art, he rose to prominence as an icon of the British New Wave. He received numerous accolades including the Cannes Film Festival Award for Best Actor, and a Grammy Award. In 2020, he was listed at number 3 on The Irish Times's list of Ireland's greatest film actors.\n\nHarris received two Academy Award for Best Actor nominations for his performances in This Sporting Life (1963), and The Field (1990). Other notable roles include in The Guns of Navarone (1961), Red Desert (1964), A Man Called Horse (1970), Cromwell (1970), Unforgiven (1992), Gladiator (2000), and The Count of Monte Cristo (2002). He gained cross generational acclaim for his role as Albus Dumbledore in the first two Harry Potter films: Harry Potter and the Philosopher's Stone (2001) and Harry Potter and the Chamber of Secrets (2002), the latter of which was his final film role.\n\nHe portrayed King Arthur in the 1967 film Camelot based on the Lerner and Loewe musical of the same name. For his performance he received the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy. He reprised the role in the 1981 Broadway musical revival. He received a Laurence Olivier Award for Best Actor for his role in Pirandello's Henry IV.(1991).\n\nHarris received a Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie nomination for his role in The Snow Goose (1971). Harris had a number-one singing hit in Australia, Jamaica and Canada, and a top-ten hit in the United Kingdom, Ireland, and the United States with his 1968 recording of Jimmy Webb's song \"MacArthur Park\". He received a Grammy Award for Best Male Pop Vocal Performance nomination for the song."
    },
    {
      "id": 46,
      "full_name": "Cate Blanchett",
      "nationality": "Australia",
      "birth_date": "1969-05-14",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Cate_Blanchett_Cannes_2018_2_%28cropped%29.jpg/220px-Cate_Blanchett_Cannes_2018_2_%28cropped%29.jpg",
      "biography": "Catherine Elise Blanchett AC is an Australian actor and producer. Often regarded as one of the best performers of her generation, she is recognised for her versatile work across independent films, blockbusters and the stage. Blanchett has received numerous accolades, including two Academy Awards, four British Academy Film Awards and four Golden Globe Awards, in addition to nominations for two Primetime Emmy Awards and a Tony Award.\n\nA graduate of the National Institute of Dramatic Art, Blanchett began her career on the Australian stage. Making her feature film debut in 1997, she came to international prominence for her portrayal of Queen Elizabeth I in the period drama Elizabeth (1998), for which she received her first Academy Award nomination. Her portrayal of Katharine Hepburn in the biopic The Aviator (2004) won her the Academy Award for Best Supporting Actress. She later won the Academy Award for Best Actress for playing a neurotic former socialite in the comedy-drama Blue Jasmine (2013). Blanchett's other Oscar-nominated roles were in Notes on a Scandal (2006), I'm Not There (2007), Elizabeth: The Golden Age (2007), Carol (2015), and Tár (2022), making her the most-nominated Australian. Her biggest commercial successes include The Lord of the Rings trilogy (2001–2003), Indiana Jones and the Kingdom of the Crystal Skull (2008), The Curious Case of Benjamin Button (2008), Cinderella (2015), Thor: Ragnarok (2017), Ocean's 8 (2018), and Don't Look Up (2021).\n\nBlanchett has performed in over twenty stage productions. She and her husband, Andrew Upton, were the artistic directors of the Sydney Theatre Company from 2008 to 2013. Some of her stage roles during this period were in acclaimed revivals of A Streetcar Named Desire, Uncle Vanya, Big and Little and The Maids. She made her Broadway debut in 2017 in The Present, for which she received a nomination for the Tony Award for Best Actress in a Play. She has also received two Emmy Award nominations for producing and starring as Phyllis Schlafly in the period drama miniseries Mrs. America (2020).\n\nBlanchett is the recipient of several honorary awards. The Australian government awarded her the Centenary Medal in 2001, and she was appointed a Companion of the Order of Australia in 2017. In 2012, she was appointed Chevalier of the Order of Arts and Letters by the French government. In 2015, she was honoured by the Museum of Modern Art and received the British Film Institute Fellowship. Blanchett has received honorary Doctor of Letters degrees from the University of New South Wales, University of Sydney and Macquarie University. Time named her one of its 100 most influential people in the world in 2007. In 2018, she was ranked among the world's highest-paid actresses."
    },
    {
      "id": 47,
      "full_name": "Ray Winstone",
      "nationality": "Great Britain (England)",
      "birth_date": "1957-02-19",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Ray_Winstone_2014.jpg/220px-Ray_Winstone_2014.jpg",
      "biography": "Winstone was born on 19 February 1957 in Hackney Hospital, London. He first lived in Caistor Park Road, Plaistow E13, and attended Portway infants and junior school. He moved to Enfield when he was seven. His mother, Margaret (née Richardson; 1932–1985) had a job emptying fruit machines, and his father, Raymond J. Winstone (1933–2015), ran a fruit and vegetable business.\n\nWinstone has recounted how, as a child, he used to play with his friends on bomb sites (vacant lots with rubble from Second World War bombs). He joined Brimsdown Primary School and in 1968, enrolled to Edmonton County School, which had changed from a grammar school to a comprehensive upon his arrival. He also attended Corona Theatre School. He did not take to school, eventually leaving with a single CSE (Grade 2) in Drama.\n\nWinstone had an early affinity for acting; his father would take him to the cinema every Wednesday afternoon. Later, he viewed Albert Finney in Saturday Night and Sunday Morning, and said: \"I thought, 'I could be that geezer'.\" Other major influences included John Wayne, James Cagney, and Edward G. Robinson. After borrowing extra tuition money from a friend's mother, a drama teacher, Winstone took to the stage, appearing as a Cockney newspaper seller in a production of Emil and the Detectives.\n\nWinstone was also a boxer. Known to his friends as Winnie, he was called Little Sugs at home (his father already being known as Sugar, after Sugar Ray Robinson). At the age of 12, Winstone joined the Repton Amateur Boxing Club. Over the next 10 years, he won 80 out of 88 bouts. He was London schoolboy champion at welterweight on three occasions, and fought twice for England. The experience gave him a perspective on his later career: \"If you can get in a ring with 2,000 people watching and be smacked around by another guy, then walking onstage isn't hard.\"\n\nDeciding to pursue drama, Winstone enrolled at the Corona Stage Academy in Hammersmith, when he was aged \"about seventeen\". At £900 a term, it was expensive considering the average wage was then about £36 a week."
    },
    {
      "id": 48,
      "full_name": "Jim Broadbent",
      "nationality": "Great Britain (England)",
      "birth_date": "1949-05-24",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Jim_Broadbent_2012.jpg/220px-Jim_Broadbent_2012.jpg",
      "biography": "James Broadbent (born 24 May 1949) is an English actor. A graduate of the London Academy of Music and Dramatic Art in 1972, he came to prominence as a character actor for his many roles in film and television. He has received various accolades including an Academy Award, two BAFTA Awards, and two Golden Globe Awards as well as nominations for two Primetime Emmy Awards and a Grammy Award.\n\nHe received an Academy Award for his supporting role as John Bayley in the film Iris (2001). Broadbent won the BAFTA Award for Best Actor in a Supporting Role for Moulin Rouge! (2001). His early film roles include in Terry Gilliam films Time Bandits (1981) and Brazil (1985) before a breakthrough role in Mike Leigh's Life Is Sweet (1990). Notable film roles include Bullets Over Broadway (1994), Topsy-Turvy (1999), Bridget Jones's Diary (2001), Gangs of New York (2002), Another Year (2010), The Iron Lady (2011), Le Week-End (2013), and Brooklyn (2015).\n\nBroadbent is also known for his roles in franchise films such as Horace Slughorn in the Harry Potter film series, Digory Kirke in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005) and Samuel Gruber in the Paddington film series. He also acted in blockbuster and studio films such as Hot Fuzz (2007), Indiana Jones and the Kingdom of the Crystal Skull (2008), Arthur Christmas (2011), and Cloud Atlas (2012).\n\nBroadbent's television roles include playing Roy Slater in the BBC sitcom Only Fools and Horses, Desmond Morton in the HBO / BBC film The Gathering Storm (2002), and Lord Longford in the Channel 4 film Longford (2006). He portrayed Archmaester Ebrose in the seventh season of the HBO fantasy series Game of Thrones in 2017. He also acted in London Spy (2015), War & Peace (2016), King Lear (2018) and The Unlikely Pilgrimage of Harold Fry (2023)."
    },
    {
      "id": 49,
      "full_name": "Carrie Henn",
      "nationality": "United States of America",
      "birth_date": "1976-05-07",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Carrie_Henn_by_Gage_Skidmore.jpg/500px-Carrie_Henn_by_Gage_Skidmore.jpg",
      "biography": "Caroline Marie \"Carrie\" Henn is an American actress, known for her only role as Rebecca \"Newt\" Jordan in Aliens (1986).\n\nCarrey's father served in the United States Air Force and around the mid-1980s, due to his service obligations, moved with his family to England . There, Carrie went to school in Lakenheath , during which she starred in Strangers, auditioning among 500 children of her school.\n\nJames Cameron, having decided to shoot Aliens, eventually faced a problem: the characters were Americans, which made it very difficult to find actors, since the main requirement for candidates was the ability to speak with an American accent . As with Newt, casting agents were instructed to look for candidates among the children of Americans living in England or those born in America. Carrie was found by Pinewood casting agent Sarah Jackson, who spotted her in her school cafeteria during lunch.\n\nAccording to producer Gail Ann Hurd, at first they tried to cast children who already had experience working on the stage and in commercials for the role of Newt, but each time they came into conflict with their role, smiling during the audition, which did not fit the image. Nine-year-old Carrie Genn, she said, was the only one who didn't. Despite the fact that Kerry had no acting experience and had not even played in the school theater, the selection committee liked her audition. The final decision was that during the first meeting with Sigourney Weaver Carrie immediately established a close connection with her. Carrie's parents reluctantly agreed to her participation in the filming, fearing that she would receive foul language from the actors who played the paratroopers. At their request, two other girls, Louise Head and Kieran Sha, were hired as Carrey's stunt doubles for the technically challenging scenes, although they were only filmed in a limited number of shots, as Carrey performed almost all the stunts herself. The parents were often present on the set, which Cameron did not like very much, because he believed that Carrie would not be able to portray the necessary emotions of loneliness, because according to the plot, Newt was under deep stress.\n\nShe spent a lot of time with Weaver, as they were involved in almost all of the scenes with visual effects such as blue screen or projection. In the last weeks of shooting (since the film was shot in chronological order), the main burden fell on their characters.\n\nFor the role of Newt, in 1987, Carrey received the \"Saturn\" award in the nomination \"Best young actor or actress\" . In the same year, she was nominated for the \"Young Actor\" award."
    },
    {
      "id": 50,
      "full_name": "Jonathan Pryce",
      "nationality": "Great Britain (England)",
      "birth_date": "1947-06-01",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Jonathan_Pryce_Cannes_2018.jpg/220px-Jonathan_Pryce_Cannes_2018.jpg",
      "biography": "Sir Jonathan Pryce CBE (born John Price; 1 June 1947) is a Welsh actor who is known for his performances on stage and in film and television. He has received numerous awards, including two Tony Awards and two Laurence Olivier Awards, and a knighthood for services to drama.\n\nAfter studying at the Royal Academy of Dramatic Art, he began his career as a stage actor in the early 1970s. His work in theatre includes an Olivier Award–winning performance in the title role of the Royal Court Theatre's Hamlet in 1980 and as The Engineer in the stage musical Miss Saigon in 1990. On the Broadway stage he earned Tony Awards—the first for Best Featured Actor in a Play for his Broadway debut role in Comedians (1977), the second for Best Actor in a Musical for the Broadway transfer of the musical Miss Saigon (1991).\n\nPryce's theatre work led to several supporting roles in film and television. His breakthrough screen performance was in Terry Gilliam's satirical dystopian black comedy film Brazil (1985). Critically lauded for his versatility, Pryce has appeared in big-budget films including Evita (1996), Tomorrow Never Dies (1997) and Pirates of the Caribbean series (2003–2007), as well as independent films such as the film adaptation of the David Mamet play Glengarry Glen Ross (1992), Martin Scorsese's period drama The Age of Innocence (1993), Christopher Hampton's Carrington (1995), Terrence Malick's historical film The New World (2005) and the drama The Wife (2017) opposite Glenn Close. In 2019, he earned his first Academy Award nomination for his portrayal of Pope Francis in The Two Popes alongside Anthony Hopkins playing Pope Benedict XVI.\n\nFor his work on television, he received two Primetime Emmy Award nominations for Outstanding Supporting Actor in a Limited Series or Movie for his performances in Barbarians at the Gate (1993) and Return to Cranford (2010). Pryce has gained acclaim for his roles as Thomas Wolsey in the BBC limited series Wolf Hall (2015), the High Sparrow in the HBO series Game of Thrones (2015–2016) and Sir Stuart Strange in the series Taboo (2017). In 2022, he succeeded Tobias Menzies as Prince Philip in the final two seasons of the award-winning Netflix historical drama series The Crown, gaining a nomination for a Golden Globe Award for Best Supporting Actor."
    },
    {
      "id": 51,
      "full_name": "Liv Tyler",
      "nationality": "United States of America",
      "birth_date": "1977-07-01",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Liv_Tyler_%2829566238128%29_%28cropped%29.jpg/220px-Liv_Tyler_%2829566238128%29_%28cropped%29.jpg",
      "biography": "Liv Rundgren Tyler (born Liv Rundgren; July 1, 1977) is an American actress. She began a modeling career at age 14 before making her film debut in Silent Fall (1994); she went on to achieve critical recognition with starring roles in Heavy and Empire Records (both 1995), as well as That Thing You Do! and Stealing Beauty (both 1996). She then appeared in films such as Inventing the Abbotts (1997), Armageddon (1998), Cookie's Fortune and Onegin (both 1999), Dr. T & the Women (2000), and One Night at McCool's (2001). She then played the elf Arwen Undómiel in the Lord of the Rings film trilogy (2001–2003), which became one of the highest-grossing film series in history.\n\nFollowing the success of Lord of the Rings, Tyler has appeared in a variety of roles, including the films Jersey Girl (2004), Lonesome Jim (2005), Reign Over Me (2007), The Strangers, The Incredible Hulk (both 2008), Robot & Frank (2012), Space Station 76 (2014), Wildling (2018), and Ad Astra (2019). Outside of film, she starred in the HBO supernatural drama series The Leftovers (2014–2017), the BBC period drama series Gunpowder (2017), the ITV/Hulu period drama series Harlots (2018–2019) and the Fox procedural drama series 9-1-1: Lone Star (2020).\n\nTyler is also a singer. Having sung with composer Howard Shore, she appeared as guest vocalist on The Lemonheads' album Varshons (2009) singing a cover of the Leonard Cohen song \"Hey, That's No Way to Say Goodbye\". She appeared on the 2017 bonus disk of Evan Dando's album Baby I'm Bored (2003) providing featured vocals for the song \"Shots Is Fired\". In 2011, she released her debut single, \"Need You Tonight\".\n\nTyler has served as a UNICEF Goodwill Ambassador for the United States since 2003, and as a spokesperson for Givenchy's line of perfume and cosmetics. She is the daughter of Steven Tyler and Bebe Buell, although she has a very close relationship with her adoptive father Todd Rundgren."
    },
    {
      "id": 52,
      "full_name": "Sean Astin",
      "nationality": "United States of America",
      "birth_date": "1971-02-25",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Sean_Astin_%2827506939735%29_%28cropped%29.jpg/220px-Sean_Astin_%2827506939735%29_%28cropped%29.jpg",
      "biography": "Astin was born in Santa Monica, California, on February 25, 1971, the son of actress Patty Duke (1946–2016) and Michael Tell (born 1950). At the time, it was incorrectly reported that entertainer Desi Arnaz Jr. was his biological father. During that time, Duke also had a personal relationship with Michael Tell, a writer, music promoter, and publisher of the newspaper The Las Vegas Israelite. When Duke became pregnant, she was unsure whether Arnaz or Tell was the father, and Tell offered to marry her as a way out of the scandal. The marriage lasted only 13 days in 1970, and ended before Astin was born.\n\nOn August 5, 1972, Duke married actor John Astin, having been in a relationship with him for two years. When the wedding guests were invited to speak, 18-month-old Astin looked at John and cried, \"Daddy!\", to which the Episcopal priest performing the ceremony remarked, \"Well, that about does it!\" John subsequently adopted Astin. In 1973, Duke gave birth to Astin's brother Mackenzie Astin, who also became an actor. Duke and John Astin divorced in 1985. Duke married Mike Pearce in 1986, and they adopted a son, Kevin, in 1989.\n\nWhen Astin was 14, Duke told him that Arnaz was his father, and the two developed a relationship. However, in his mid-20s, Astin met a relative of Michael Tell who suggested they were related. Sean set out to find the truth about his biological father, and underwent genetic tests which showed Tell was his biological father. Astin has maintained close relationships with all three, and saying: \"Desi Arnaz Jr. loves me, and I love him. We are so close ... Science tells me ... that he's not my biological father. Science tells me that Mike Tell is.\" Astin considers John his father, as John was the one who raised him. Astin is also close to his stepfather, Mike Pearce, saying, \"I can call any of them on the phone any time I want to. John, Desi, Mike, or Papa Mike ... my four dads.\"\n\nAstin is of German and Irish ancestry through his mother, and Austrian Jewish and Polish Jewish through his biological father. Astin attended Catholic school and later became a Protestant.\n\nAstin attended the Crossroads High School for the Arts and undertook master classes at the Stella Adler Conservatory in Los Angeles. He graduated cum laude from UCLA with a B.A. in History and English (American literature and culture). An alumnus of Los Angeles Valley College, Astin served on the school's board of directors of the Patrons Association and the Arts Council."
    },
    {
      "id": 53,
      "full_name": "Billy Boyd",
      "nationality": "Great Britain (England)",
      "birth_date": "1968-08-28",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Billy_Boyd.jpg/220px-Billy_Boyd.jpg",
      "biography": "Boyd was born in Glasgow, Scotland, to William and Mary Boyd, who both died a year apart when Boyd was in his early teens. He worked as a bookbinder for six years before pursuing an acting career. After graduating from the Royal Scottish Academy of Music and Drama, he went on to perform with St Andrews Repertory and the Traverse Theatre.\n\nBoyd started his career appearing in Taggart (1996), The Soldier's Leap (1998), and Urban Ghost Story (1998). He also appeared in the 7:84 Theatre Company Scotland production of Caledonia Dreaming by David Greig in 1997. His breakthrough, and most notable acting role, was Peregrin \"Pippin\" Took in The Lord of the Rings trilogy, from 2001 to 2003. Boyd wrote the melody for and sang the song \"The Edge of Night\", which was featured in The Lord of the Rings: The Return of the King. The song was later used over the trailer for The Hobbit: The Battle of the Five Armies (2014), the final film in the Hobbit trilogy. Boyd also wrote and performed the song \"The Last Goodbye\", which is played during the ending credits of the film.\n\nIn 2004, he starred as Glen and Glenda, Chucky's (Brad Dourif) and Tiffany's (Jennifer Tilly) offsprings in the Child's Play film Seed of Chucky. He has also made a cameo appearance in the popular Scottish comedy Still Game in the second episode of the first series.\n\nAs well as being a screen actor, he also appears on the stage. Boyd has been in several plays; including San Diego and The Ballad of Crazy Paola. He performed at the Dundee Repertory Theatre in the role of Davie in Sunshine on Leith, as well as in Long Hong Jimmy, in which he was the lead actor. He also starred (2007) as Richard MacDuff in the BBC Radio adaptation of the book: Dirk Gently′s Holistic Detective Agency written by Douglas Adams.\n\nIn 2011, his feature film Glenn, the Flying Robot was shown in the Dawn Breakers International Film Festival, and was followed by a Netflix release. In June 2012, he appeared on stage as the voice of the guide in The Hitchhiker's Guide to the Galaxy live radio show. In 2013, Boyd played Banquo in Shakespeare's Macbeth, at the Shakespeare's Globe alongside Joseph Millson and Samantha Spiro.\n\nBoyd together with fellow Lord of the Rings castmates Sean Astin, Sean Bean, Orlando Bloom, Ian McKellen, Dominic Monaghan, Viggo Mortensen, Miranda Otto, John Rhys-Davies, Andy Serkis, Liv Tyler, Karl Urban, and Elijah Wood, plus writer Philippa Boyens and director Peter Jackson on 31 May 2020 joined Josh Gad's YouTube series Reunited Apart which reunites the cast of popular movies through video-conferencing, and promotes donations to non-profit charities.\n\nIn 2022, he reprised his Child's Play role in the second season finale of the television series Chucky, titled \"Chucky Actually\", as a merged incarnation of Glen and Glenda Tilly, known as G.G. Valentine.\n\nHe made his stage debut in 2024 with Lord of the Rings castmate Dominic Monaghan in the Canadian production of Tom Stoppard's Rosencrantz and Guildenstern are Dead."
    },
    {
      "id": 54,
      "full_name": "Dominic Monaghan",
      "nationality": "Deutschland",
      "birth_date": "1976-12-08",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Dominic_Monaghan_2003.jpg/220px-Dominic_Monaghan_2003.jpg",
      "biography": "Monaghan was born in West Berlin, West Germany, to British parents: Maureen, a nurse, and Austin Monaghan, who was of Irish descent, a science teacher. Monaghan's family lived in Berlin, Düsseldorf, Stuttgart and Münster, moving about every four years. When he was about 11 years old, his family moved to Heaton Moor in Stockport, England. In Stockport, he attended St Anne's Roman Catholic High School (where his uncle taught and later became head teacher) and Aquinas College, where he studied English literature, drama and geography.\n\nHe is best known for playing Meriadoc \"Merry\" Brandybuck in Peter Jackson's film trilogy The Lord of the Rings (2001–2003), and Charlie Pace on the ABC television drama Lost (2004–2010).\n\nMonaghan first gained fame as Hetty Wainthropp's sidekick Geoffrey in Hetty Wainthropp Investigates (1996–1998). His first film role was as Sasha in the television film Hostile Waters (1997) based on the true story of a Soviet and a US submarine colliding in the Cold War. His other film roles include playing the young mutant Chris Bradley formerly known as Maverick in the superhero film X-Men Origins: Wolverine (2009) and playing Beaumont Kin in Star Wars: The Rise of Skywalker (2019), reuniting with J.J. Abrams, the co-creator of Lost. He also has hosted the nature programme Wild Things with Dominic Monaghan (2012–2016)."
    },
    {
      "id": 55,
      "full_name": "Diane Keaton",
      "nationality": "United States of America",
      "birth_date": "1946-01-05",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Diane_Keaton_2012-1_%28cropped%29.jpg/220px-Diane_Keaton_2012-1_%28cropped%29.jpg",
      "biography": "Diane Keaton (née Hall; born January 5, 1946) is an American actress. She has received various accolades throughout her career spanning over five decades, including an Academy Award, a British Academy Film Award, and two Golden Globe Awards, in addition to nominations for a Tony Award and two Emmy Awards. She was honored with the Film Society of Lincoln Center Gala Tribute in 2007 and an AFI Life Achievement Award in 2017.\n\nKeaton's career began on stage when she appeared in the original 1968 Broadway production of the musical Hair. The next year she was nominated for a Tony Award for Best Featured Actress in a Play for her performance in Woody Allen's comic play Play it Again, Sam. She then made her screen debut in a small role in Lovers and Other Strangers (1970), before rising to prominence with her first major film role as Kay Adams-Corleone in Francis Ford Coppola's The Godfather (1972), a role she reprised in its sequels Part II (1974) and Part III (1990). She has frequently collaborated with Woody Allen, beginning with the film adaptation of Play It Again, Sam (1972). Her next two films with him, Sleeper (1973) and Love and Death (1975), established her as a comic actress, while her fourth, Annie Hall (1977), won her the Academy Award for Best Actress.\n\nTo avoid being typecast as her Annie Hall persona, Keaton appeared in several dramatic films, starring in Looking for Mr. Goodbar (1977) and Interiors (1978). She received three more Academy Award nominations for her roles as activist Louise Bryant in Reds (1981), a leukemia patient in Marvin's Room (1996), and a dramatist in Something's Gotta Give (2003). Keaton is also known for her starring roles in Manhattan (1979), Baby Boom (1987), Father of the Bride (1991), Father of the Bride Part II (1995), The First Wives Club (1996), The Family Stone (2005), Finding Dory (2016) and Book Club (2018)."
    },
    {
      "id": 56,
      "full_name": "Christopher Lee",
      "nationality": "Great Britain (England)",
      "birth_date": "1922-05-27",
      "death_date": "2015-06-07",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Christopher_Lee_at_the_Berlin_International_Film_Festival_2013.jpg/220px-Christopher_Lee_at_the_Berlin_International_Film_Festival_2013.jpg",
      "biography": "Sir Christopher Frank Carandini Lee CBE CStJ (27 May 1922 – 7 June 2015) was an English actor, singer, and military officer. In a career spanning more than sixty years, Lee became known as an actor with a deep and commanding voice who often portrayed villains in horror and franchise films. Lee was knighted for services to drama and charity in 2009, received the BAFTA Fellowship in 2011, and received the BFI Fellowship in 2013.\n\nLee gained fame for portraying Count Dracula in seven Hammer Horror films. His other film roles include Francisco Scaramanga in the James Bond film The Man with the Golden Gun (1974), Count Dooku in three Star Wars films (2002–2008), and Saruman in both The Lord of the Rings film trilogy (2001–2003) and The Hobbit film trilogy (2012–2014). He frequently appeared opposite his friend Peter Cushing in horror films, and late in his career had roles in five Tim Burton films, including Sleepy Hollow (1999), Corpse Bride (2005), Charlie and the Chocolate Factory (2005), Alice in Wonderland (2010), and Dark Shadows (2012). Lee's other notable roles include The Curse of Frankenstein (1957), Dracula (1958), A Tale of Two Cities (1958), The Wicker Man (1973), Gremlins 2: The New Batch (1990), Jinnah (1998), Glorious 39 (2009), and Hugo (2011).\n\nBefore his acting career, Lee served in the Royal Air Force as an intelligence officer, attached to the No. 260 Squadron RAF during World War II as a liaison officer for the Special Operations Executive. He retired from the RAF in 1946 with the rank of flight lieutenant. Lee also sang, recorded opera and musical pieces between 1986 and 1998, and worked with several heavy metal bands; he appeared on the albums Charlemagne: By the Sword and the Cross (2010) and Charlemagne: The Omens of Death (2013)."
    },
    {
      "id": 57,
      "full_name": "Hugo Weaving",
      "nationality": "Great Britain (England)",
      "birth_date": "1960-04-04",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/MJK_08925_Hugo_Weaving_%28Berlinale_2018%29_bw43.jpg/220px-MJK_08925_Hugo_Weaving_%28Berlinale_2018%29_bw43.jpg",
      "biography": "Hugo Wallace Weaving (born 4 April 1960) is a British actor. He is the recipient of six Australian Academy of Cinema and Television Arts Awards (AACTA) and has been recognised as an Honorary Officer of the Order of Australia. Born in Colonial Nigeria to English parents, he has resided in Australia for the entirety of his career.\n\nWeaving landed his first major role as English cricket captain Douglas Jardine on the Australian television series Bodyline (1984). He rose to prominence with his appearances in the Australian films Proof (1991) and The Adventures of Priscilla, Queen of the Desert (1994), winning his first AACTA Award for Best Actor in a Leading Role for the former. By the turn of the millennium, Weaving achieved international recognition through roles in mainstream American productions. His most notable film roles include Agent Smith in the first three The Matrix films (1999–2003), Elrond in The Lord of the Rings (2001–2003) and The Hobbit (2012–2014) trilogies, the title character in V for Vendetta (2005), and Johann Schmidt / Red Skull in the Marvel Cinematic Universe (MCU) film Captain America: The First Avenger (2011).\n\nIn addition to his live action appearances, Weaving has had several voice over roles, including in the films Babe (1995), Happy Feet (2006) and Happy Feet Two (2011), and the Transformers series as Megatron (2007–2011). He reprised his roles of Agent Smith and Elrond in Matrix and Lord of the Rings video game adaptations."
    },
    {
      "id": 58,
      "full_name": "Sean Bean",
      "nationality": "Great Britain (England)",
      "birth_date": "1959-04-17",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/AV0A6306_Sean_Bean.jpg/220px-AV0A6306_Sean_Bean.jpg",
      "biography": "Shaun Mark Bean was born on 17 April 1959 in Handsworth, a suburb of Sheffield, the son of Rita (née Tuckwood) and Brian K. Bean (born 1934). He has a younger sister, Lorraine. His paternal grandfather, Harold Bean Jr. (1914–2001), served in the Royal Navy in the Second World War and was a stud mill labourer who later became a pacifist. His father owned a fabrication company that employed 50 people, including Bean's mother, who worked as a secretary. Despite becoming relatively wealthy, the family never moved away from the council estate as they preferred to remain close to friends and family. As a child, Bean smashed a glass door during an argument, which left a piece of glass embedded in his leg that briefly impeded his walking, and left a large scar. This prevented him from pursuing his ambition of playing football professionally.\n\nBean first attended a local school, Handsworth Junior School, before going to Athelstan School until he was 12, when he went to study at Brook School. In 1975, Bean left Brook Comprehensive School with O levels in Art and English. After a job at a supermarket and another for the local council, he started work at his father's firm. Once a week, he attended Rotherham College of Arts and Technology to study welding. While at college, he came upon an art class, and decided to pursue his interest in art. After attending courses at two other colleges, one for half a day and the other for less than a week, he returned to Rotherham College, where he enrolled in a drama course. After some college plays and one at Rotherham Civic Theatre, he won a scholarship to the Royal Academy of Dramatic Art (RADA), starting a seven-term course in January 1981."
    },
    {
      "id": 59,
      "full_name": "Andy Serkis",
      "nationality": "Great Britain (England)",
      "birth_date": "1964-04-20",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Andy_Serkis_by_Gage_Skidmore_2.jpg/220px-Andy_Serkis_by_Gage_Skidmore_2.jpg",
      "biography": "Andrew Clement Serkis (born 20 April 1964) is an English actor and filmmaker. He is best known for his motion capture roles comprising motion capture acting, animation and voice work for computer-generated characters such as Gollum in The Lord of the Rings film trilogy (2001–2003) and The Hobbit: An Unexpected Journey (2012), King Kong in the eponymous 2005 film, Caesar in the Planet of the Apes reboot series (2011–2017), Captain Haddock / Sir Francis Haddock in Steven Spielberg's The Adventures of Tintin (2011), Baloo in his self-directed film Mowgli: Legend of the Jungle (2018) and Supreme Leader Snoke in the Star Wars sequel trilogy films The Force Awakens (2015) and The Last Jedi (2017), also portraying Kino Loy in the Star Wars Disney+ series Andor (2022).\n\nSerkis' film work in motion capture has been critically acclaimed. He has received an Empire Award and two Saturn Awards for his motion-capture acting. He earned a Golden Globe nomination for his portrayal of serial killer Ian Brady in the British television film Longford (2006) and was nominated for a BAFTA for his portrayal of new wave and punk rock musician Ian Dury in the biopic Sex & Drugs & Rock & Roll (2010). In 2020, Serkis received the BAFTA Award for Outstanding British Contribution To Cinema. In 2021, he won a Daytime Emmy Award for the series The Letter for the King (2020).\n\nSerkis portrayed Ulysses Klaue in the Marvel Cinematic Universe (MCU) films Avengers: Age of Ultron (2015) and Black Panther (2018), as well as the Disney+ series What If…? (2021). He also played Alfred Pennyworth in The Batman (2022). Serkis has his own production company and motion capture workshop, The Imaginarium in London, which he used for Mowgli: Legend of the Jungle. He made his directorial debut with Imaginarium's 2017 film Breathe. He directed Venom: Let There Be Carnage (2021), which is set in Sony's Spider-Man Universe (SSU)."
    },
    {
      "id": 60,
      "full_name": "Travis Fimmel",
      "nationality": "Australia",
      "birth_date": "1979-07-15",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Travis_Fimmel_by_Gage_Skidmore.jpg/220px-Travis_Fimmel_by_Gage_Skidmore.jpg",
      "biography": "Fimmel was born near Echuca, Victoria, Australia and was raised in Lockington. The youngest of three brothers, he is the son of Jennie, a recreation officer for disabled people, and Chris, a cattle farmer. Aspiring to be a professional Australian rules footballer, Fimmel moved to Melbourne to play for the St Kilda Football Club in the AFL, but a broken leg sidelined him before the season began. He was accepted into RMIT for an architecture course, but later deferred to travel abroad.\n\nFimmel's modelling career began when he was spotted working out at a gym in the Melbourne suburb of Hawthorn by the flatmate of Matthew Anderson, a talent scout for the Chadwick Models agency.\n\nFimmel headed to the United States and was signed on the spot with agency LA Models in 2002 after walking into their office broke and barefoot. Cast by Jennifer Starr, he became the first male in the world to secure a six-figure deal to model exclusively for Calvin Klein for a year, and the last to be personally contracted by the brand's eponymous designer. He fronted CK's Crave men's fragrance campaign and modelled the brand's famous underwear. It was reported that one of his London billboards had to be pulled down after complaints from an auto club of traffic congestion and accidents by 'rubbernecking' female drivers, but Fimmel insisted the story started with a rumour spread on the internet.\n\nHe was named one of the world's sexiest bachelors by America's People magazine in 2002 and at the time was regarded as \"the most in-demand male model in the world\". It has been suggested by some journalists that Fimmel was the inspiration for Sex and the City heartthrob 'Jerry' Smith Jerrod.\n\nFimmel has appeared on multiple magazine covers, including Esquire, Rogue, Empire, At Large, Good Weekend, Numero Homme and America's TV Guide. He turned down an offer from Australia's Seven Network to be a guest judge on the TV series Make Me A Supermodel."
    },
    {
      "id": 61,
      "full_name": "Clive Standen",
      "nationality": "Great Britain (England)",
      "birth_date": "1981-07-22",
      "death_date": "",
      "photo": "https://independenttalent-63a2.kxcdn.com/wp-content/uploads/2015/12/IMG_9466.jpg",
      "biography": "Standen was born on a British Army base in Holywood, County Down, Northern Ireland, and grew up in Leicestershire, East Midlands, England. He went to school at the King Edward VII School, Melton Mowbray followed by a performing arts course at Melton Mowbray College. Standen then went on to earn a place on the 3 year diploma course in Acting at the London Academy of Music and Dramatic Art. Away from acting, in his late teens Standen was an international Muay Thai boxer and later Fencing gold medalist.\n\nStanden's first experience of stunts, horse riding and sword fighting was at age 12 when he got his first job working in a professional stunt team in Nottingham. At the age of 15 Standen was a member of both the National Youth Theatre and the National Youth Music Theatre performing in productions at many well known venues. Later Standen won a place on the three-year acting course at the London Academy of Music and Dramatic Art.\n\nIn 2004, Standen appeared in Waking the Dead; the Second World War documentary drama Ten Days to D-Day; and took the lead role of Major Alan Marshall in Zero Hour a TV dramatisation of Special Air Service mission operation Barras in Sierra Leone. The next year he appeared in three episodes of the British soap Doctors and Tom Brown's Schooldays, the acclaimed ITV adaptation of the book by Thomas Hughes. Standen played Private Carl Harris in three episodes of the fourth series of the relaunched British sci-fi programme Doctor Who. The following year he played Archer, the half-brother of Robin Hood in the BBC One series Robin Hood. Standen was part of the main cast of the TV series Camelot for Starz in which he portrayed the famous Arthurian knight Sir Gawain.\n\nIn film, Standen took a supporting role in the mainstream Bollywood film Namastey London, starring Akshay Kumar and Katrina Kaif. In 2012, Standen completed filming on the Vertigo Films feature film Hammer of the Gods. He is a series lead on the History Channel's Vikings in the role of Rollo. Clive portrayed Bryan Mills in the television adaptation of Taken then starred as Colonel Knox in the Screen Gems thriller film Patient Zero. Standen was cast in the main role of Anthony Lavelle for NBC's Council of Dads.\n\nIn 2021, Standen and Amy Bailey (who played Kwenthrith in Vikings) teamed up to create the Vikcast podcast about the Vikings TV series they will co-host, with Bailey stating: \"We've gathered our beloved castmates, production members, and celebrity guests to talk about the show and everything beyond.\"\n\nIn addition to his screen roles, Standen has done voice overs for video games such as Aliens vs. Predator and Inversion. He also lent his voice for the upcoming Warhammer 40,000: Space Marine II, portraying Lieutenant Titus."
    },
    {
      "id": 62,
      "full_name": "Jessalyn Gilsig",
      "nationality": "Canada",
      "birth_date": "1971-11-30",
      "death_date": "",
      "photo": "https://images.mubicdn.net/images/cast_member/30411/cache-273725-1509412494/image-w856.jpg",
      "biography": "Gilsig was born in Montreal, Quebec, Canada, the daughter of Claire, a writer and translator, and Toby Gilsig, an engineer. She began her acting in a voice work part at age 12 for a National Film Board of Canada production, Masquerade. She is of Jewish descent.\nShe is best known for her roles as Meredith Gordon in Heroes, Kayley in Quest for Camelot, Lauren Davis in Boston Public, Gina Russo in Nip/Tuck, Terri Schuester in Glee, and as Siggy Haraldson in Vikings.\n\nGilsig attended McGill University in Montreal, from 1989 to 1993, graduating with a Bachelor of Arts degree in English in 1993. She later pursued her acting studies further at Harvard University's Institute for Advanced Theater Training.\n\nGilsig began her career as a voice actress. She has done voices in the films such as Masquerade, and for television series such as Young Robin Hood.\n\nShe moved to New York City in 1995 where she appeared in several off-Broadway plays. However, it was her association with David E. Kelley that led to her starring role in Boston Public.\n\nAfter guest-starring in two episodes of Kelley's The Practice, Gilsig was cast in two episodes of another Kelley program, the short-lived Snoops. Although the series was cancelled before Gilsig's episodes were broadcast, Kelley wrote the part of Lauren Davis in Boston Public specifically for her, a series that premiered in September 2000 on FOX; Gilsig would leave the series after the end of the second season in May 2002.\n\nFollowing her departure from Boston Public, Gilsig joined the cast of Nip/Tuck in 2003 as Gina Russo, a role she continued until 2008. In 2004, she appeared in five episodes of NYPD Blue, followed by four episodes of FOX's Prison Break in 2005.\n"
    },
    {
      "id": 63,
      "full_name": "Gustaf Skarsgard",
      "nationality": "Sweden",
      "birth_date": "1980-11-12",
      "death_date": "",
      "photo": "https://st3.depositphotos.com/1694341/16563/i/450/depositphotos_165638732-stock-photo-actor-gustaf-skarsgard.jpg",
      "biography": "Skarsgård was born on 12 November 1980 in Stockholm, Sweden, to Swedish actor Stellan Skarsgård and his first wife, My, a physician. He has five siblings: Alexander, Sam, Bill, Eija and Valter, and two half-brothers Ossian and Kolbjörn by his father's second marriage, to Megan Everett. Alexander, Bill, and Valter are also actors. His godfather is Swedish actor Peter Stormare. Gustaf decided to follow in his father's footsteps as an actor at the age of six and attended drama school.\n\nSkarsgård’s film debut was in 1989 in the short film Prima Ballerina, where he played a ballet pupil. The same year, Skarsgård starred in the Swedish Film Codename Coq Rouge. Gustaf Skarsgård continued with several children's and youth roles, for example, Min vän Percys magiska gymnastikskor (1994) and Skuggornas hus (1996). \n\nHe attended the Swedish National Academy of Mime and Acting in Stockholm (Teaterhögskolan) from 1998 to 2003, before joining the Royal Dramatic Theatre, Stockholm. He played in several of Shakespeare’s, Chekhov's and Söderberg’s works both on the Royal Dramatic Theatre and on Stockholm City Theatre. In 2003 he performed in Evil and 2008 in Patrik 1,5. For both roles he was nominated for the Guldbagge Award as Best Supporting Actor and as Best Leading Actor. The same year he was awarded the Shooting Star at the Berlin International Film Festival. He finally won the Guldbagge as Best Leading Actor for his performance in Förortsungar.\n\nIn 2012, Skarsgård joined the History Channel's series Vikings in the main role of Floki, the shipbuilder. In 2018, he joined the cast of Westworld as Karl Strand for five episodes.\n\nIn March 2020, Skarsgård starred in a main role as Merlin, in Cursed, a Netflix original television series based on a re-imaging of the Arthurian legend."
    },
    {
      "id": 64,
      "full_name": "Gabriel Byrne",
      "nationality": "Great Britain (England)",
      "birth_date": "1950-05-12",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Gabriel_Byrne_2010.jpg/220px-Gabriel_Byrne_2010.jpg",
      "biography": "Gabriel James Byrne (born 12 May 1950) is an Irish actor. He has received a Golden Globe Award as well as nominations for a Grammy Award, two Primetime Emmy Awards and two Tony Awards. Byrne was awarded the Irish Film and Television Academy Lifetime Achievement Award in 2018 and was listed at number 17 on The Irish Times list of Ireland's greatest film actors in 2020. The Guardian named him one of the best actors never to have received an Academy Award nomination.\n\nHis acting career began in the Focus Theatre before he joined London's Royal Court Theatre in 1979. Byrne's screen debut came in the Irish drama serial The Riordans and the spin-off show Bracken. He went on to star in such films as Excalibur (1981), Lionheart (1987), Miller's Crossing (1990), Little Women (1994), Dead Man (1995), The Usual Suspects (1995), The Man in the Iron Mask (1998), Enemy of the State (1998), Vanity Fair (2004), The 33 (2015), and Hereditary (2018). He co-wrote The Last of the High Kings (1996) and also produced In the Name of the Father (1993).\n\nFor his Broadway work, he has received two nominations for the Tony Award for Best Actor in a Play for his roles in the Eugene O'Neill plays A Moon for the Misbegotten (2000), and Long Day's Journey into Night (2016). For his television work, Byrne has received two nominations for the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series for his role as Paul Weston in the HBO drama series In Treatment (2008–2010), he also received a Golden Globe Award. Other notable television roles include Vikings (2013), Maniac (2018), and War of the Worlds (2019–2022)."
    },
    {
      "id": 65,
      "full_name": "George Blagden",
      "nationality": "Great Britain (England)",
      "birth_date": "1989-12-28",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/George_Blagden_2014.jpg/220px-George_Blagden_2014.jpg",
      "biography": "George Paul Blagden (born 28 December 1989) is an English stage and film actor. He is best known for his role as Louis XIV in the French-produced television series drama Versailles. He also played Grantaire in the 2012 film adaptation of Les Misérables and Athelstan in the television series Vikings (2013–2016). He has also narrated the Penguin Classics audiobook version of Homer’s The Odyssey and an immersive audiovisual tour for the Circus Maximus in Rome written by Margaret George for the BARDEUM mobile app.\n\nBlagden who was raised near to Bury St Edmunds, Suffolk, began singing at age 13, performing in various choirs and his own rock band. After studying at Old Buckenham Hall School, Suffolk, he was accepted into Oundle School with a drama scholarship, and appeared in the school's Stahl Theatre in such roles as The Baker in Into the Woods and Marc in 'Art'. Also while at Oundle, Blagden became a member of the National Youth Theatre and was selected as one of four students to participate in a masterclass with Sir Ian McKellen. Following his graduation, he studied acting at the Guildhall School of Music and Drama, from which he graduated in 2011. He has a younger sister, Katie, who is a writer and filmmaker.\n\nIn 2011, Blagden received his first acting role as Andy in the feature film After the Dark, which was released in 2014. He has since appeared in Wrath of the Titans, Les Misérables, Vikings, and as the lead character of Louis XIV in the drama series Versailles.\n\nBlagden played the role of PJ in the 2018 revival of Stephen Sondheim's musical comedy, Company, at the Gielgud Theatre in the West End of London.\n\nBlagden co-stars in the upcoming musical film, The Land of Dreams, directed by Nicola Abbatangelo, with shooting underway in October 2019."
    },
    {
      "id": 66,
      "full_name": "Donal Logue",
      "nationality": "Ireland",
      "birth_date": "1966-02-27",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Donal_Logue_at_NY_PaleyFest_2014_for_Gotham.jpg/220px-Donal_Logue_at_NY_PaleyFest_2014_for_Gotham.jpg",
      "biography": "Donal Francis Logue was born in Ottawa, Ontario, to Irish parents from County Kerry. His parents were Carmelite missionaries, and the family moved from Ireland to Canada to Boston and elsewhere before settling in Calexico, California, in the state's Imperial Valley. There and in nearby El Centro, California, Logue grew up with three sisters—Karina, Deirdre and Eileen — and their mother taught at Calexico High School and Vincent Memorial Catholic High School. Logue attended Central Union High School in El Centro, where he became interested in theater. With friend John Everly during what Logue called the \"summer during our sophomore year\", he created the theater group Imperial Valley Players to perform in the school's auditorium, mounting the theater of the absurd play Picnic on the Battlefield by Fernando Arrabal.\n\nFor part of his junior year of high school, Logue attended the Jesuit school St. Ignatius' College in Enfield Town, London, England. In 1983, while a high-school senior, Donal was elected president of the 37th session of the American Legion Boys Nation, representing California and becoming the first non-citizen elected Boys Nation president. He went on to study history at Harvard University, graduating in 1988. In the late 1980s, he worked as a road manager for such bands as Bullet LaVolta.\n\nAfter a few appearances in made-for-TV films, Logue appeared in the 1992 film Sneakers, playing Dr. Gunter Janek. In 1993, he portrayed Capt. Ellis Spear in Gettysburg, and a movie agent, Judd Bromell, on the Northern Exposure episode \"Baby Blues\", then later appeared as an FBI agent in The X-Files episode \"Squeeze.\" Logue's character Jimmy The Cab Driver was a staple of MTV promos in the early 1990s. He also appeared in Blade and The Patriot, in 2000. He appeared in two of Edward Burns films: Purple Violets and The Groomsmen."
    },
    {
      "id": 67,
      "full_name": "Alyssa Sutherland",
      "nationality": "Australia",
      "birth_date": "1982-09-23",
      "death_date": "",
      "photo": "http://t3.gstatic.com/licensed-image?q=tbn:ANd9GcRECql8CkYtWBPipTpAspwVYmDYlWXnyIBjXNOm4-kknUMoI6632D_MH6QDuxEizS-O",
      "biography": "Alyssa Sutherland (born 23 September 1982) is an Australian actress and model best known for her roles as Queen Aslaug on the History Channel television series Vikings and Ellie in Evil Dead Rise, the fifth installment of the Evil Dead franchise.\n\nSutherland's modelling career began when she won the 1997 annual Bonne Belle model search of Girlfriend, a teen magazine in Australia. Following her win, she signed a contract with Vogue Australia.\n\nSutherland has had an extensive runway, print and television modeling career, appearing in campaigns for Bulgari, Ralph Lauren, Garnier, Calvin Klein, Chanel, John Frieda, Kerastase, Hugo Boss and Abercrombie & Fitch.\n\nSutherland has appeared on the cover of magazines for Vogue Australia, Harper's Bazaar Singapore and Japan, Elle Germany, Australian Style, Glamour Italy and Black and White. Sutherland has also shot extensive editorial for Vogue (Germany, Australia, Italy, Greece and U.S.), Elle (Australia and U.S.), Marie-Claire (UK), Harper's Bazaar (Australia), Glamour Italy, I.D., Wallpaper* and The Face and Scene. Sutherland has worked with renowned fashion photographers, including Herb Ritts, Bruce Weber, Ellen von Unwerth and Steven Meisel.\n\nIn 2007, Sutherland became the newest Flake Girl when Cadbury revived its iconic TV advertisements after a five-year hiatus. The advertisement shows her, in reverse time, eating a Flake bar in a convertible during a rain shower. She is one of several former Cadbury advert actors to speak out in favour of the \"Keep Cadbury British\" campaign in opposition to the sale of Cadbury to a non-British owner.\n\nSince transitioning away from modeling, Sutherland has expressed guilt about having contributed to the \"unrealistic standards\" of beauty set by the fashion industry and has been critical of its \"strict\" and damaging size requirements."
    },
    {
      "id": 68,
      "full_name": "Linus Roache",
      "nationality": "Great Britain (England)",
      "birth_date": "1964-02-01",
      "death_date": "",
      "photo": "http://t1.gstatic.com/licensed-image?q=tbn:ANd9GcQ7bEswiPwpoIRcuNqiGPWMJ16C7edxso_psABpK2d2VAPVbPityOEo6RjnZl3b6Ouw",
      "biography": "Linus William Roache (born 1 February 1964) is a British actor. He is known for playing Executive ADA Michael Cutter in the NBC dramas Law & Order (2008–2010) and Law & Order: Special Victims Unit (2011–2012). More recently, Roache played Ecbert, King of Wessex in Vikings from 2014 to 2017.\n\nHe was nominated for a Golden Globe Award for playing Robert F. Kennedy in RFK (2002) and won a Satellite Award for Best Supporting Actor (TV) for his role as Ralph Wigram in The Gathering Storm (2002). His film appearances include Priest (1994), The Wings of the Dove (1997), Pandaemonium (2000), The Chronicles of Riddick (2004), Batman Begins (2005), Non-Stop (2014) and Mandy (2018). In 2018 and 2020, he had a recurring role in the final two seasons of Homeland. In 2023, he played the role of Senator Wesley Smith in Showtime's Fellow Travelers.\n\nRoache was born in Manchester, England, the son of Coronation Street actor William Roache and actress Anna Cropper. Roache was educated at Bishop Luffa School in Chichester, West Sussex, and at Rydal School in Colwyn Bay in north Wales. He studied acting at the Central School of Speech and Drama. He married actress Rosalind Bennett in Malvern Hills, Worcestershire, in 2002.\n\nIn June 2010, it was announced that he would return to play Laurence Cunningham alongside his father William Roache in Coronation Street. The following month, he was cast in the HBO pilot The Miraculous Year.\n\nIn April 2011, Roache was cast as the lead in the ITV miniseries Titanic, airing in March and April 2012 to coincide with the 100th anniversary of the sinking of the ship.\n\nIn February 2014, Roache debuted in season two of the TV series Vikings as Ecbert, King of Wessex.\n\nHe starred in seasons seven and eight of the TV series Homeland as David Wellington in 2017–2019."
    },
    {
      "id": 69,
      "full_name": "Alexander Ludwig",
      "nationality": "Canada",
      "birth_date": "1992-05-07",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Alexander_ludwig_%2851307023797%29_%28cropped%29.jpg/220px-Alexander_ludwig_%2851307023797%29_%28cropped%29.jpg",
      "biography": "Alexander Richard Ludwig was born in Vancouver, British Columbia, Canada, to Sharlene (née Martin), a former actress, and Harald Horst Ludwig, a businessman and former co-chair of Lionsgate Entertainment. He has three younger siblings. Ludwig was drawn to the profession, saying in an interview, \"I have a big imagination. I love performing.\"\n\nDespite his mother's early career as an actress, Ludwig had to convince his parents to support his desire to pursue acting as a child. His parents believed that child actors \"can get sucked into a life that isn't reality.\" They prioritized education, and so he attended regular school while pursuing his acting dreams. \"It was definitely challenging to juggle school while filming,\" he reflected in the same interview. \"My school wasn't used to it, and I wasn't used to it. It was the most amazing experience, but it was really hard.\" Ludwig studied at the University of Southern California (but left before graduating), where he was in the Phi Kappa Psi fraternity.\n\nIn 2013, he co-starred in the films Lone Survivor and Grown Ups 2. In 2014, he became a part of the main cast of the popular TV series Vikings, playing the character of Björn Ironside, the son of Ragnar Lothbrok and Lagertha. In 2015, he had the male lead in both the horror films Final Girl and The Final Girls, which are unrelated to each other. He played the pacifist hacker Dorn in 2020's Bad Boys for Life, and also appeared in The Band Perry's music video for \"Gentle on My Mind\" alongside Teen Wolf actress Shelley Hennig.\n\nLudwig signed with the country music label BBR Music Group/BMG in May 2021. His self-titled EP was released on May 21, 2021. On August 18, 2022, it was announced that Ludwig would appear in Nicki Minaj's music video for her single Super Freaky Girl. On August 26, 2022, Ludwig released his debut album Highway 99."
    },
    {
      "id": 70,
      "full_name": "Ben Robson",
      "nationality": "Great Britain (England)",
      "birth_date": "1984-02-04",
      "death_date": "",
      "photo": "http://t2.gstatic.com/licensed-image?q=tbn:ANd9GcSo0cgAxHELvAoj7DQ-LFsy-lrRM6AW2e0eh3NjoTSUMAyCni8WQD-9DxTmSAqQbTzw",
      "biography": "Robson was born and grew up in Newcastle upon Tyne, England.  He is known for playing the roles as Kalf in the History TV18 series Vikings, Craig Cody in Animal Kingdom, and Frankie Scott in the Peacock series The Continental, the prequel to John Wick film franchise.\nHis father worked in manufacturing. He has one younger brother and one younger sister. His sister works as an agent for directors and voice coaches. His brother works in wealth management. His grandmother was born in a Ukrainian orphanage and she moved to Germany during the war.\n\nRobson went to the University of the West of England in Bristol where he studied business.\n\nIn August 2015, Ben Robson was cast as 'Craig Cody' in the pilot of Animal Kingdom based on the Australian film of the same name.\n\nIn 2016, Robson appeared in the horror film The Boy as 'Cole'. The film also starred Lauren Cohan and Rupert Evans. The film had moderate success but received negative reviews from critics. It grossed $64 million.\n\nIn October 2017, Robson was cast in the crime thriller film A Violent Separation as 'Ray'."
    },
    {
      "id": 71,
      "full_name": "Kevin Durand",
      "nationality": "Canada",
      "birth_date": "1974-01-14",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Kevin_Durand_SDCC_2014.jpg/220px-Kevin_Durand_SDCC_2014.jpg",
      "biography": "Kevin Serge Durand (born January 14, 1974) is a Canadian actor. He is best known for portraying Vasiliy Fet in The Strain, Joshua in Dark Angel, Martin Keamy in Lost, Fred J. Dukes / The Blob in X-Men Origins: Wolverine, Barry Burton in Resident Evil: Retribution, Gabriel in Legion, Little John in Robin Hood, Jeeves Tremor in Smokin' Aces, Carlos in The Butterfly Effect, and Proximus Caesar in Kingdom of the Planet of the Apes. He received a 2012 Best Supporting Actor Genie nomination for his portrayal of Lenny Jackson in Citizen Gangster.\n\nDurand has played series regulars on shows such as Joshua in Dark Angel, Vasiliy Fet in The Strain, Harbard the Wanderer in Vikings, Agent Jay Swopes in the American remake of Touching Evil, as well as guest roles on CSI, CSI: Miami, ER, Without a Trace, Dead Like Me and others. He also recurred on the television show Stargate SG-1 as Lord Zipacna, on Lost as Martin Keamy, and on the DCEU's 2019 season of Swamp Thing as Dr. Jason Woodrue, the Floronic Man.\n\nDurand is currently slated to make his directorial and screenwriting debut, The Hockey Player, which he is co-writing with Adam MacDonald and has been developing since 2010."
    },
    {
      "id": 72,
      "full_name": "Lothaire Bluteau",
      "nationality": "Canada",
      "birth_date": "1957-04-14",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Lothaire_Bluteau_head_2.jpg/220px-Lothaire_Bluteau_head_2.jpg",
      "biography": "Bluteau was born in Montreal in 1957. He initially studied medicine, before enrolling in the Conservatoire de musique et d'art dramatique du Québec. He is fluent in French and English, and has performed in both languages.\n\nBluteau has worked in theatre, film and television throughout Canada and internationally. He abandoned medicine for the theatre and was first noticed for his performance as a mentally challenged youth in Yves Simoneau's In the Shadow of the Wind (Les Fous de Bassan). After receiving great acclaim for the lead in the stage version of Being at Home with Claude, he won a best actor Genie Award for his performance in Denys Arcand's Oscar-nominated Jésus de Montréal. He has since appeared in Black Robe and Robert Lepage's Le Confessionnal, and his international credits include Orlando (1992) and I Shot Andy Warhol (1996).\n\nHe had a recurring role in the third season of the television series 24 as the character Marcus Alvers. In the fourth season of The Tudors, he played Charles de Marillac, the French ambassador to the court of King Henry VIII. In July 2014, it was announced he was cast in the History Channel series Vikings as the 9th century King of France, Charles the Bald."
    },
    {
      "id": 73,
      "full_name": "John Kavanagh",
      "nationality": "Ireland",
      "birth_date": "1946-01-01",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/John_kavanagh_2022_1.jpg/440px-John_kavanagh_2022_1.jpg",
      "biography": "John Kavanagh (born 1946) is an Irish actor who has acted on the stage, in over twenty films including Cal (1984), Braveheart (1995) and Alexander (2004), and on television. Most recently, he is known for his portrayal of The Seer in the History Channel series Vikings. He has received a number of accolades, including a Drama Desk Award nomination in 1989 for his role in a revival of Juno and the Paycock.\n\nKavanagh attended the Brendan Smyth Academy since he was 19 and then trained at the Abbey Theatre. In 1967, he joined the company and stayed with them for 10 years before becoming freelancer.\n\nKavanagh acted in another historical epic: the Oliver Stone film Alexander (2004), starring Colin Farrell, Val Kilmer and Anthony Hopkins. Kavanagh played the role of Parmenion, the old general who questions Alexander's actions. After a plot to kill the young leader is foiled, Parmenion is accused of being the mastermind behind it and is murdered. While the film was a triumph overseas, its domestic box office was a fraction of the budget, and it received negative reviews for a number of reasons. After this, Kavanagh acted in Brian De Palma's murder film The Black Dahlia (2006) which failed at the box office.\n\nKavanagh rebounded with the successful television series The Tudors (2007). Starring fellow Alexander cast member Jonathan Rhys Meyers, the series plays out the story of England's turmoil in the time of Henry VIII and his life as he breaks from the Catholic Church. In 2012 Kavanagh was cast in Michael Hirst's TV series Vikings.\n\nKavanagh collaborated as vocalist with Paul Brady on the record The Green Crow Caws, a musical celebration of the words of Seán O'Casey."
    },
    {
      "id": 74,
      "full_name": "Peter Franzen",
      "nationality": "Finland",
      "birth_date": "1971-08-14",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Peter_Franz%C3%A9n.jpg/220px-Peter_Franz%C3%A9n.jpg",
      "biography": "Franzén was born in Keminmaa, north Finland. Franzén has described his childhood as difficult due to his violent and alcoholic stepfather. Later, Franzén's relationship to his abusive stepfather was a major focal point in his semi-autobiographical novel, Above Dark Waters. He met his actress wife Irina Björklund while studying in Theatre Academy of Finland. In 1999 the couple moved to Los Angeles, where they lived until 2013, after which they moved to France. They have a son, born in September 2007.\n\nAs an actor, Franzén has appeared in over 50 films and TV series. For his role in Dog Nail Clipper, Franzén was awarded a Jussi Award for Best Actor as well as earning praise from film critic Jay Weissberg from Variety magazine who called the actor \"one of the most talented and versatile thesps in Finland\".\n\nIn his career he has appeared in Finnish, Estonian, German, English, Swedish, and Hungarian speaking roles. In 2015, Franzén was cast as King Harald Finehair from the fourth season of Vikings. Franzén has also been cast in Amazon Prime Video's The Wheel of Time TV series."
    },
    {
      "id": 75,
      "full_name": "Jasper Paakkonen",
      "nationality": "Finland",
      "birth_date": "1980-07-15",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Jasper_P%C3%A4%C3%A4kk%C3%B6nen.jpg/250px-Jasper_P%C3%A4%C3%A4kk%C3%B6nen.jpg",
      "biography": "Pääkkönen was born in Helsinki, the son of actor Seppo Pääkkönen and Virve Havelin. His uncle Antti Pääkkönen is also an actor, and is a prolific voice actor. Already as a child, Pääkkönen was a theater assistant and attended Kallio Upper Secondary School of Performing Arts in Kallio, Helsinki. When Pääkkönen was 17, he spent a year in Maryland as an exchange student at Baltimore's Owings Mills High School during the 1997–98 school year.\n\nPääkkönen's first film role was in The Glory and Misery of Human Life from 1988, when he was seven years old. He became famous as Saku Salin in the Finnish television soap opera Salatut elämät (1999–2002). According to a calculation published by Finnish tabloid Ilta-Sanomat, Pääkkönen is \"the most profitable film actor in Finland\" for having starred in numerous box office hits during his career. Many of Pääkkönen's films have made #1 at the Finnish box office, including Bad Boys, which is one of the most successful Finnish films at the national box office of all time. Other of Pääkkönen's commercial and critical successes include Frozen Land (2005), Matti: Hell Is for Heroes (2006), Lapland Odyssey (2010) and Heart of a Lion (2013).\n\nPääkkönen with Spike Lee and the cast of BlacKkKlansman at the 2018 Cannes Film Festival\nFor his role in Bad Boys, Pääkkönen was given the Best Actor Award in the Brussels International Independent Film Festival. He has earned international praise from film critic Michael Giltz from the Huffington Post, who called the actor \"handsome and compelling\" in his role in Lapland Odyssey. Film critic Leslie Felperin from Variety named Pääkkönen a \"rising thesp, showing impressive range\" in his starring role in Matti. In 2006 the European Film Promotion introduced Pääkkönen as the Shooting Star of Finland at the Berlin International Film Festival.\n\nIn 2013, Pääkkönen starred in Finnish drama film Heart of a Lion that earned him his first Jussi Award for Best Supporting Actor. In 2015, Pääkkönen was cast in the fourth season of the History Channel TV series Vikings as Halfdan the Black.\n\nPääkkönen co-starred as a KKK member in Spike Lee's drama BlacKkKlansman, which premiered at the Cannes Film Festival and was released on 10 August 2018. He starred in Lee's 2020 Netflix production Da 5 Bloods."
    },
    {
      "id": 76,
      "full_name": "Alex Hogh Andersen",
      "nationality": "Denmark",
      "birth_date": "1994-05-20",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Alex_hogh_andersen_2021_3.jpg/220px-Alex_hogh_andersen_2021_3.jpg",
      "biography": "Andersen was born on 20 May 1994 in Denmark to parents Thomas Andersen (father), and Charlotte Høgh (mother).\n\nAlex was born and raised in the small town of Skælskør in the western part of Sjælland in Denmark, Andersen discovered his love of acting while studying drama at school. He participated in many musical oriented plays and was fortunate to gain a lot of experience with many big roles.\n\nAt age 17, Andersen realised the difference between live performances and acting in front of a camera. This encouraged him to pursue Film and Media Studies at the University of Copenhagen. He started university in 2014, but dropped out in 2015 for the filming of Vikings on location in Ireland.\n\nWhen he is not acting, Andersen enjoys spending much of his time focusing on photography. Considering himself a visually-minded person, he continues to learn more and more about cameras due to his experience shooting and directing short films. In addition, he learned dancing, singing, sports, fencing and stunts."
    },
    {
      "id": 77,
      "full_name": "Marco Ilso",
      "nationality": "Denmark",
      "birth_date": "1994-09-29",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Marco_ilso_2021_3.jpg/220px-Marco_ilso_2021_3.jpg",
      "biography": "Marco's fathers, Elsa Ilsjo Larsen and Finn Ilsjo, were athletes. Finn Ilsjo was a professional football player in B-93, and Elsa Ilsjo Larsen played in the youth handball team. Marco has two older brothers, Nick and Ken, who are professional football players. Marco is also the cousin of football player Kenneth Emil Petersen. Marco himself grew up playing for “Friheden”, and in the spring of 2009 he moved to “Kjoge”. Currently he plays for Karlslunde.\n\nThe fourteen-year-old Ilsyo played the leading role in the Danish television series “Mikkel and the Gold Card.” In 2016, the family retired from the permanent role of Gvitserk in the TV series “Vikings”."
    },
    {
      "id": 78,
      "full_name": "Jordan Patrick Smith",
      "nationality": "Great Britain (England)",
      "birth_date": "1989-06-18",
      "death_date": "",
      "photo": "https://m.media-amazon.com/images/M/MV5BODFiMzgxMWMtNzRlZi00NjkxLWJkMDctYTM2MDE1ZWQwYTU1XkEyXkFqcGdeQXVyMTExNzQzMDE0._V1_UX214_CR0,0,214,317_AL_.jpg",
      "biography": "Smith was born in Fife. He attended St Columba's High School and played football for Dunfermline's youth academy.\nFollowing a holiday to Australia in 2001, Smith's family fell in love with the country and decided to emigrate. They moved to Queensland in 2003. He attended Carmel Catholic College.\n\nAfter finishing school, Smith took a number of acting courses and appeared in a few commercials. He has previously appeared in H2O: Just Add Water, in which he played a surfer. Smith has also had roles in Mortified and Home and Away.\n\nWhile between jobs, Smith worked as a labourer. In 2009, he was offered the role of Andrew Robinson in the Australian soap opera Neighbours, but nearly had to turn it down because he was in hospital. He says, \"I'd been doing some work as a labourer and I'd been lifting up concrete floors when some of the concrete flew up and smashed into my face. My nose got all swollen and became infected, so I was kept on a drip of antibiotics for a week. I got the call to say I got the part while I was still in hospital on Sunday night (in Queensland) and I had to be in Melbourne by 7 am the next day.\"\n\nSmith has admitted that Neighbours had to change his character's background story because of his Scottish accent. Andrew was initially meant to have been brought up in Brazil, but the strength of Smith's accent meant that this had to be changed. He has also stated that he had to \"refine\" his accent in order to be understood by other cast members and the audience. Smith admitted that if he was not playing the role of Andrew Robinson he would have liked to play the role of fellow Neighbours character Lucas Fitzgerald, played by his co-star Scott Major, instead. While he was appearing on Neighbours, Smith resided with his co-star Chris Milligan, who played Kyle Canning.\n\nOn 26 November 2012, it was announced that Smith would be leaving Neighbours. He made his final screen appearance as Andrew on 29 March 2013. Smith co-starred in Angelina Jolie's Unbroken as Cliff, an Australian prisoner who is taken to a Japanese POW camp in World War II. In 2015, Smith appeared in the BBC series Banished; he joined the cast of Vikings as Ubbe in 2016; and in 2020, he played William in the HBO series Lovecraft Country."
    },
    {
      "id": 79,
      "full_name": "Moe Dunford",
      "nationality": "Ireland",
      "birth_date": "1987-12-11",
      "death_date": "",
      "photo": "https://thecomfortabelspotpodcast.files.wordpress.com/2022/05/image0_fotor.jpg",
      "biography": "Moe Dunford (born 11 December 1987) is an Irish actor. He is best known for his roles in Vikings and Patrick's Day. He is the recipient of a number of accolades, including three Irish Film & Television Awards.\n\nDunford was born in Dungarvan, County Waterford, Ireland. He graduated from the Gaiety School of Acting in June 2009.\n\nDunford started his acting career in 2010 on The Tudors. Afterwards he appeared in many films and television productions like An Crisis and Game of Thrones. His most notable roles are Aethelwulf on Vikings and Patrick Fitzgerald in Patrick's Day. In 2015, he received an IFTA in the category of Best Actor in a Lead Role in Film for Patrick's Day, and an EFP 2015 Shooting Stars Award representing Ireland at the Berlin Film Festival."
    },
    {
      "id": 80,
      "full_name": "Jonathan Rhys Meyers",
      "nationality": "Ireland",
      "birth_date": "1977-07-27",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Jonathan_Rhys_Meyers_2013.jpg/220px-Jonathan_Rhys_Meyers_2013.jpg",
      "biography": "Jonathan Rhys Meyers (born Jonathan Michael Francis O'Keeffe; 27 July 1977) is an Irish actor. He is known for his roles in the films Michael Collins (1996), Velvet Goldmine (1998), Titus (1999), Bend It Like Beckham (2002), Alexander (2004), Match Point (2005), Mission: Impossible III (2006) and his television roles as Elvis Presley in the biographical miniseries Elvis (2005), for which he won a Golden Globe Award and earned a Primetime Emmy Award nomination, as King Henry VIII in the historical drama The Tudors (2007–10), which earned him two Golden Globe Award nominations, and in the NBC drama series Dracula (2013–14) as the title character. He also starred as Bishop Heahmund, a character inspired by the Catholic Saint of the same name, in the History Channel television series Vikings.\n\nMeyers has continued to star in other films, such as Albert Nobbs in 2011. In 2013, Meyers appeared as the villain Valentine Morgenstern in The Mortal Instruments: City of Bones, based on Cassandra Clare's novel, City of Bones; he appeared in the 2015 film Stonewall, directed by Roland Emmerich; in 2017, he starred in The 12th Man; and in 2018 he won the Best Actor award at the Manchester Film Festival for his starring role in Damascus Cover. In 2020, he was listed as number 44 on The Irish Times’ list of Ireland's greatest film actors.\n\nMeyers has been the face of several Hugo Boss advertising campaigns. He has also been involved in several charitable causes, including the Hope Foundation and the children's charity Barretstown. Meyers is married to Mara Lane, and they have one son together."
    },
    {
      "id": 81,
      "full_name": "Danila Kozlovsky",
      "nationality": "Russian",
      "birth_date": "1985-05-03",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%B0_%D0%9A%D0%BE%D0%B7%D0%BB%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_2017_%281%29.jpg/220px-%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%B0_%D0%9A%D0%BE%D0%B7%D0%BB%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_2017_%281%29.jpg",
      "biography": "Kozlovsky was born in Moscow. His mother, Nadezhda Zvenigorodskaya, is a stage actress, and his father, Valery Kozlovsky, was a professor at Moscow State University specializing in marketing and mass communications. He is the second of three brothers, an older brother, Yegor, and a younger brother, Ivan. From a young age, Kozlovsky was placed in dance and music classes, learning to play the saxophone and the alto. During his early years, he frequently changed schools, potentially due to discipline issues. He made his big screen debut in 1998, playing the troubled sixth grader Denis on the Russian television series Simple Truths.\n\nIn 1996, he was accepted into the Kronshtadt Naval Military School, which he attended until his graduation in 2002. Upon graduation, he matriculated to the Saint Petersburg State Theatre Arts Academy, entering the acting/directing course supervised by Lev Dodin. During his fourth year he made his debut on the stage of the Little Drama Theatre (Theatre de l’Europe), playing the part of Edgar in King Lear (2006). The role brought him his first theatre award: a special prize of Expert Council of the \"Golden Sofit\" (the top-rated theatre award in Saint Petersburg) for Best Debut. Then there was a role in the play Life and Fate, which premiered in Paris and the diploma performance \"Warsaw Melody\".\n\nAfter graduating from the academy in 2007, Danila Kozlovskiy was officially admitted to the staff of the Little Drama Theatre (Theatre de l'Europe). In his repertoire were added performances Lord of the Flies, where he played Ralph, Intrigue and Love and The Cherry Orchard.\n\nIn 2005, he also received his first important film role – in the picture Garpastum. The film, set during the time of the First World War, tells the story of two brothers who wish to build their own football stadium. Kozlovsky received the Russian Guild of Film Critics \"White Elephant Award\" for the best male lead actor.\n\nYuliya Snigir and Danila Kozlovsky, during the premiere of A Good Day to Die Hard, 2013 Kozlovsky gained wider publicity in 2008 with his starring role in the film Black Hunters. There he played the role of robber archaeologist Sergei Filatov, who is transported into the past together with his friends when making illegal excavations.\n\nIn 2009, he portrayed drag queen Lusya in the comedy-drama Jolly Fellows. It was screened in the Panorama section of the 2010 Berlin International Film Festival."
    },
    {
      "id": 82,
      "full_name": "Eric Johnson",
      "nationality": "Canada",
      "birth_date": "1979-08-07",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Eric_Johnson_2011.jpg/340px-Eric_Johnson_2011.jpg",
      "biography": "Eric Johann Johnson (born August 7, 1979) is a Canadian actor known for playing Flash Gordon on the eponymous 2007–2008 television series, Whitney Fordman on the superhero series Smallville, Detective Luke Callaghan on the police drama Rookie Blue, and Jack Hyde in the Fifty Shades film series. In 2022, he played a misogynist corrupt sheriff in the HBO Max horror series Pretty Little Liars: Original Sin.\n\nJohnson began his career acting at the age of nine, when his parents enrolled him in Stage Polaris, a theater company in Edmonton. Johnson played the younger version of Brad Pitt's character in 1994 film Legends of the Fall. In Canada, Johnson was the lead in an award-winning film titled Scorn. His break-out role came in 2001, as football jock and Clark Kent rival Whitney Fordman in Smallville.\n\nIn 2004, Johnson played the anti-Mormon son, Joshua Steed, in The Work and the Glory and later its sequels. A few years later, he played the title role in the television revival of Flash Gordon that debuted on Sci Fi in August 2007; the series was cancelled after one season. On November 27, 2010, Johnson starred as Jake Finley in the Hallmark movie, Debbie Macomber's Call Me Mrs. Miracle. He also portrayed Luke Callahan in the Canadian police drama Rookie Blue and inmate Cal Sweeney, a bank robber, in the Fox series Alcatraz. In 2012, Johnson was cast as the voice actor and physical actor of Sam Fisher in Splinter Cell: Blacklist, replacing Michael Ironside, who voiced the character in previous installments.\n\nIn 2013, Johnson was cast in Cinemax's original medical drama The Knick as a racist, but talented, young medic who is Clive Owen's protege; the series was directed by Steven Soderbergh.\n\nJohnson played villain Jack Hyde in the drama sequels Fifty Shades Darker (2017) and Fifty Shades Freed (2018)."
    },
    {
      "id": 83,
      "full_name": "Georgia Hirst",
      "nationality": "Great Britain (England)",
      "birth_date": "1994-12-26",
      "death_date": "",
      "photo": "https://pbs.twimg.com/profile_images/893417952971812864/OafPAp6e_400x400.jpg",
      "biography": "Georgia Octavia Hirst (born 26 December 1994) is an English actress. She is known for her roles as the maiden Torvi in the History series Vikings (2014–2020) and Becky in the zombie horror movie Ravers (2018).\n\nHirst was born on Boxing Day in Oxford. She is the daughter of writer Michael Hirst. Her older half-sister Maude Hirst appeared alongside her in Vikings. Hirst trained in acting at the Drama Centre London.\n\nHirst dedicated most of her early acting career to playing the character Torvi in the television series Vikings; the character debuted in 2013 in the second season. She was promoted to series regular during the sixth season.\n\nIn 2018, Hirst was the sole actor in the Stephen Gates directed short film Dungeness, and starred as Becky in the 2018 techno music zombie horror movie Ravers, which had its world premiere at the 2018 London FrightFest Film Festival. In 2020, Hirst played the role of Grace in the interactive rom-com Five Dates.\n\nIn 2021, Hirst joined The Celebs to record a cover of The Beatles classic \"Let It Be\", in support of the Mind charity and released on 3rd December 2021. Hirst was part of a choir of celebrities including Anne Hegerty, Ivan Kaye and Eunice Olumide, who were backing EastEnders actress Shona McGarty.\n\nIn 2017, Hirst made an appearance on Sky News where she urged young female fans to go ahead with smear tests after she had herself been diagnosed with precancerous cells at the age of 22. Hirst followed this by appearing in a Mika Simmons podcast, The Happy Vagina on the same topic."
    },
    {
      "id": 84,
      "full_name": "Ragga Ragnars",
      "nationality": "Iceland",
      "birth_date": "1984-10-24",
      "death_date": "",
      "photo": "https://lthumb.lisimg.com/858/20784858.jpg",
      "biography": "Ragnheiður Ragnarsdóttir, also known as Ragga Ragnars (born 24 October 1984) is an Icelandic actress and former swimmer, who specialised in sprint freestyle events. She is a multiple-time Icelandic record holder in both long and short course freestyle (both 50 metres and 100 metres). After retiring from swimming, Ragnheiður studied acting and played the role of Gunnhild on the TV series Vikings from 2018 to 2020.\n\nRagnheiður has said that she always had a passion for acting and after retiring from swimming, decided to study acting. She took an 8-week \"Acting for Film\" course with New York Film Academy in Los Angeles, which she \"loved\" and then enrolled for a one-year programme. She graduated in 2015. It was also announced in the 2020 Game Awards that she would star in an animated series based on the popular Studio Wildcard game Ark: Survival Evolved in 2022 playing the role of Queen Sigrid.\n\nRagnheiður had also starred as Gunnhild on the TV series Vikings."
    },
    {
      "id": 85,
      "full_name": "Sophie Marceau",
      "nationality": "France",
      "birth_date": "1966-11-17",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Sophie_Marceau_Cabourg_2012.jpg/220px-Sophie_Marceau_Cabourg_2012.jpg",
      "biography": "She was born 17 November 1966 in Paris, the second child of Simone (née Morisset), who was a shop assistant. and Benoît Maupu, a truck driver. Her parents divorced when she was nine years old.\n\nIn February 1980, Marceau and her mother came across a model agency looking for teenagers. Marceau had photos taken at the agency, but did not think anything would come of it. At the same time, Françoise Menidrey, the casting director for Claude Pinoteau's La Boum (1980), asked modeling agencies to recommend a new teenager for the project. After viewing the rushes, Alain Poiré, the director of the Gaumont Film Company, signed Marceau to a long-term contract. La Boum was a hit film, with 4,378,500 tickets sold in France. In 1981, Marceau made her singing debut with French singer François Valéry on record \"Dream in Blue\", written by Pierre Delanoë. She rejected the main role in a soon-to-be controversial film, Beau-père, in which she would have played as a teenage girl who seduces her step-father for a sexual relationship. The role was eventually played by Ariel Besse. In 1982, at age 16, Marceau bought back her contract with Gaumont for one million French francs. She borrowed most of the money.\n\nAfter starring in the sequel film La Boum 2 (1982), Marceau focused on more dramatic roles, including the historical drama Fort Saganne in 1984 with Gérard Depardieu and Catherine Deneuve, Joyeuses Pâques (Happy Easter) in 1984, L'amour braque and Police in 1985, and Descente aux enfers (Descent into Hell) in 1986. In 1988, she starred in L'Étudiante (The Student) and the historical adventure film Chouans!. That year, Marceau was named Best Romantic Actress at the International Festival of Romantic Movies for her role in Chouans!\n\nIn 2012, Marceau played a 40-something career woman who falls in love with a young jazz musician in Happiness Never Comes Alone. In 2013, she appeared in Arrêtez-moi (Arrest Me) as a woman who shows up at a police station and confesses to the murder of her abusive husband several years earlier.\n\nShe was selected to be on the jury for the main competition section of the 2015 Cannes Film Festival."
    },
    {
      "id": 86,
      "full_name": "Patrick McGoohan",
      "nationality": "Ireland",
      "birth_date": "1928-03-19",
      "death_date": "2009-01-13",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/d/d2/McGoohanAllnightlongcrop1.png",
      "biography": "Patrick Joseph McGoohan was born in the Astoria neighbourhood of New York City's Queens borough on March 19, 1928, the son of Irish Catholic, immigrant parents Thomas McGoohan and Rose McGoohan (née Fitzpatrick). Soon after he was born, the family relocated back to Ireland, where they lived in the Mullaghmore area of Carrigallen in the south-east of County Leitrim.\n\nSeven years later, they relocated to England and settled in Sheffield. McGoohan attended St Marie's School, then St Vincent's School, and De La Salle College, all in Sheffield. During World War II, he was evacuated to Loughborough, where he attended Ratcliffe College at the same time as future actor Ian Bannen. McGoohan excelled in mathematics and boxing, and left school at the age of 16 to return to Sheffield, where he worked as a chicken farmer, bank clerk, and lorry driver before getting a job as a stage manager for Sheffield Repertory Theatre. When one of the actors became ill, McGoohan substituted for him, which began his acting career.\n\nIn 2000, he reprised his role as Number Six in an episode of The Simpsons, \"The Computer Wore Menace Shoes\". In it, Homer Simpson concocts a news story to make his website more popular, and he wakes up in a prison disguised as a holiday resort. Dubbed Number Five, he meets Number Six, and later betrays him and escapes with his boat; referencing his numerous attempts to escape on a raft in The Prisoner, Number Six splutters \"That's the third time that's happened!\"\n\nMcGoohan's last movie role was as the voice of Billy Bones in the animated movie Treasure Planet, released in 2002. That same year, he received the Prometheus Hall of Fame Award for The Prisoner.\n\nMcGoohan's name was associated with several aborted attempts at producing a new movie version of The Prisoner. In 2002, Simon West was signed to direct a version of the story. McGoohan was listed as executive producer for the movie, which never came to fruition. Later, Christopher Nolan was proposed as director for a movie version. However, the source material remained difficult and elusive to adapt into a feature movie. McGoohan was not involved with the project that was ultimately completed. A miniseries was filmed for the AMC network in late 2008, with its broadcast occurring during November 2009."
    },
    {
      "id": 87,
      "full_name": "Catherine McCormack",
      "nationality": "Great Britain (England)",
      "birth_date": "1972-04-03",
      "death_date": "",
      "photo": "http://t1.gstatic.com/licensed-image?q=tbn:ANd9GcRTCnm8-yIHaGAet6F-2o29pcWjVMZDk9blrLJkMtR4-w53fSsXNGE1Y_tKxOkgsEoY",
      "biography": "McCormack was born in Epsom, Surrey, England. She is of part Irish ancestry as one of her grandfathers was Irish. Her mother died of lupus when McCormack was six years old and her steelworker father subsequently raised her and her brother Stephen. She was brought up as Roman Catholic and attended the Convent of Our Lady of Providence. She went on to study at the Oxford School of Drama.\n\nMcCormack's first important role was as the character Murron MacClannough in the multiple Academy Award-winning film Braveheart (1995). Her screen debut was as the lead in the Anna Campion-directed film Loaded (1994). She has subsequently stated that she had a \"miserable time with the director (Anna Campion)... it was my first film job, I needed to be mollycoddled, I needed to be helped through it, and I wasn't. Mostly, it was a horrible experience.\"\n\nAfter Braveheart, McCormack starred alongside Anna Friel and Rachel Weisz in David Leland's The Land Girls and had lead roles in Nils Gaup's Northstar and Marshall Herskovitz's Dangerous Beauty. Other films include Spy Game (2001) and 28 Weeks Later. Despite being in demand, she does few films, stating that \"I read very few scripts I'm passionate about... Maybe one in every twenty or thirty.\"\n\nAs of 2009, McCormack was living with her boyfriend in Richmond."
    },
    {
      "id": 88,
      "full_name": "Brendan Gleeson",
      "nationality": "Ireland",
      "birth_date": "1955-03-29",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Brendan_Gleeson.jpg/300px-Brendan_Gleeson.jpg",
      "biography": "Brendan Gleeson (born 29 March 1955) is an Irish actor and director. He has received various accolades, including a Primetime Emmy Award, two British Independent Film Awards and three IFTA Awards, along with nominations for an Academy Award, three BAFTA Awards and five Golden Globe Awards. In 2020, he was listed at number 18 on The Irish Times list of Ireland's greatest film actors. He is the father of actors Domhnall Gleeson and Brian Gleeson.\n\nHe is known for his supporting roles in films such as Braveheart (1995), Michael Collins (1996), 28 Days Later (2002), Gangs of New York (2002), Cold Mountain (2003), Troy (2004), the Harry Potter film series (2005–2010), Suffragette (2015), Paddington 2 (2017), The Ballad of Buster Scruggs (2018), and The Tragedy of Macbeth (2021). He is also known for his leading roles in films such as The General (1998), In Bruges (2008), The Guard (2011), Calvary (2014), Frankie (2019), and The Banshees of Inisherin (2022) for which he received a nomination for the Academy Award for Best Supporting Actor.\n\nHe won a Primetime Emmy Award in 2009 for his portrayal of Winston Churchill in the television film Into the Storm. He also received a Golden Globe Award nomination for his performance as Donald Trump in the Showtime series The Comey Rule (2020). From 2017 to 2019 he starred in the crime series Mr. Mercedes. He received an Emmy Award nomination for Stephen Frears' Sundance TV series State of the Union (2022)."
    },
    {
      "id": 89,
      "full_name": "Marlon Brando",
      "nationality": "United States of America",
      "birth_date": "1924-04-03",
      "death_date": "2004-07-01",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Marlon_Brando_publicity_for_One-Eyed_Jacks.png/220px-Marlon_Brando_publicity_for_One-Eyed_Jacks.png",
      "biography": "Marlon Brando Jr. (April 3, 1924 – July 1, 2004) was an American actor and activist. Widely considered one of the greatest and most influential actors of all time, he received numerous accolades throughout his career, which spanned six decades, including two Academy Awards, two Golden Globe Awards, one Cannes Film Festival Award, and three British Academy Film Awards. Brando is credited with being one of the first actors to bring the Stanislavski system of acting and method acting to mainstream audiences.\n\nBrando fell under the influence of Stella Adler and Stanislavski's system in the 1940s. He began his career on stage, adeptly reading his characters and consistently anticipating where scenes flowed. He transitioned to film, initially gaining acclaim and his first Academy Award for Best Actor nomination for the role of Stanley Kowalski in A Streetcar Named Desire (1951). He received further praise and his first Academy Award and Golden Globe Award for his performance as Terry Malloy in On the Waterfront (1954), which remains a watershed moment in the history of Hollywood, and his work continues to be studied and interpreted. His portrayal of the rebellious motorcycle gang leader Johnny Strabler in The Wild One (1953) became an emblem of the era's generational gap.\n\nThe 1960s saw Brando's career take a commercial and critical downturn. He directed and starred in One-Eyed Jacks (1961), a commercial flop, after which he delivered a series of notable box-office failures, beginning with Mutiny on the Bounty (1962), which damaged his career. After ten years of underachieving and markedly diminished interest in his films, he starred as Vito Corleone in The Godfather (1972), which helped him win his second Academy Award and Golden Globe Award in a performance considered among the finest in the art form's history, based on extensive surveys of critics, directors and other actors. With this and his Oscar-nominated performance in Last Tango in Paris (1972), Brando reestablished himself in the ranks of top box-office stars.\n\nAfter a hiatus in the early 1970s, Brando was generally content with being a highly paid character actor in supporting roles of varying quality such as Jor-El in Superman (1978), as Colonel Kurtz in Apocalypse Now (1979) and as Adam Steiffel in The Formula (1980) before taking a nine-year break from film. The last two decades of Brando's life were marked with controversy, and his troubled private life received significant attention. He struggled with mood disorders and legal issues. Brando continues to be respected and held in high regard."
    },
    {
      "id": 90,
      "full_name": "Al Pacino",
      "nationality": "United States of America",
      "birth_date": "1940-04-25",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Al_Pacino_2016_%2830401544240%29.jpg/220px-Al_Pacino_2016_%2830401544240%29.jpg",
      "biography": "Alfredo James Pacino (born April 25, 1940) is an American actor. Considered one of the greatest and most influential actors of the 20th century, Pacino has received numerous accolades including an Academy Award, two Tony Awards, and two Primetime Emmy Awards, achieving the Triple Crown of Acting. He has also received four Golden Globe Awards, a BAFTA, two Screen Actors Guild Awards, and was honored with the Cecil B. DeMille Award in 2001, the AFI Life Achievement Award in 2007, the National Medal of Arts in 2011, and the Kennedy Center Honors in 2016.\n\nA method actor, Pacino studied at HB Studio and the Actors Studio, where he was taught by Charlie Laughton and Lee Strasberg. Pacino went on to receive the Academy Award for Best Actor for his role in Scent of a Woman (1992). His other Oscar-nominated roles were in The Godfather (1972), Serpico (1973), The Godfather Part II (1974), Dog Day Afternoon (1975), ...And Justice for All (1979), Dick Tracy (1990), Glengarry Glen Ross (1992), and The Irishman (2019). His other notable roles include The Panic in Needle Park (1971), Scarecrow (1973), Cruising (1980), Scarface (1983), The Godfather Part III (1990), Carlito's Way (1993), Heat (1995), Donnie Brasco, The Devil's Advocate (both 1997), The Insider, Any Given Sunday (both 1999), Insomnia (2002), Ocean's Thirteen (2007), Once Upon a Time in Hollywood (2019), and House of Gucci (2021).\n\nOn television, Pacino has acted in multiple productions for HBO, including Angels in America (2003) and the Jack Kevorkian biopic You Don't Know Jack (2010), winning a Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for each. Pacino starred in the Amazon Prime Video series Hunters (2020–23). He has also had an extensive career on stage. He is a two-time Tony Award winner, winning Best Featured Actor in a Play in Does a Tiger Wear a Necktie? (1969) and Best Actor in a Play for The Basic Training of Pavlo Hummel (1977).\n\nPacino made his directing debut with the documentary Looking for Richard (1996); Pacino had played the lead role on stage in 1977. He has also acted as Shylock in a 2004 feature film adaptation and 2010 stage production of The Merchant of Venice. Pacino directed and starred in Chinese Coffee (2000), Wilde Salomé (2011), and Salomé (2013). Since 1994, he has been the joint president of the Actors Studio."
    },
    {
      "id": 91,
      "full_name": "James Caan",
      "nationality": "United States of America",
      "birth_date": "1940-03-26",
      "death_date": "2022-07-06",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/James_Caan_%281976%29.jpg/220px-James_Caan_%281976%29.jpg",
      "biography": "James Edmund Caan (KAHN; March 26, 1940 – July 6, 2022) was an American actor. He came to prominence playing Sonny Corleone in The Godfather (1972) – a performance that earned him Academy Award and Golden Globe nominations for Best Supporting Actor. He reprised his role in The Godfather Part II (1974). He received a motion-picture star on the Hollywood Walk of Fame in 1978.\n\nAfter early roles in Howard Hawks' El Dorado (1966), Robert Altman's Countdown (1967) and Francis Ford Coppola's The Rain People (1969), Caan gained acclaim for his portrayal of Brian Piccolo in the 1971 television movie Brian's Song, for which he received a Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie nomination. Caan received Golden Globe Award nominations for his performances in the drama The Gambler (1974), and the musical Funny Lady (1975). He continued to receive significant roles in feature films such as Cinderella Liberty (1973), Rollerball (1975), A Bridge Too Far (1977), Comes a Horseman (1978), Chapter Two (1979) and Thief (1981).\n\nAfter a five-year break from acting, he returned with roles in Gardens of Stone (1987), Misery (1990), Honeymoon in Vegas (1992), Eraser (1996), Mickey Blue Eyes (1999), The Yards (2000), City of Ghosts (2002), Elf (2003), and Get Smart (2008)."
    },
    {
      "id": 92,
      "full_name": "Richard S. Castellano",
      "nationality": "United States of America",
      "birth_date": "1933-09-04",
      "death_date": "1988-12-10",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/The_Super_cast_1972_%28cropped%29.JPG/220px-The_Super_cast_1972_%28cropped%29.JPG",
      "biography": "Castellano was born in the Queens borough of New York City on September 4, 1933. His parents, Mariantonia Angello and Filippo Castellano, were Italian immigrants from Castrofilippo, Sicily. His middle name, Salvatore, was in honor of his oldest brother who had died two years before he was born.\n\nAfter his death, Castellano's widow Ardell Sheridan claimed that he was the nephew of Gambino crime family boss Paul Castellano; however Richard's own sister dismissed this claim as false: \"we're not related to Paul\".\n\nCastellano gained worldwide fame for his role in Lovers and Other Strangers (1970), for which he was nominated for an Academy Award. He achieved further stardom in 1972 for playing the part of Peter Clemenza, in The Godfather. The Godfather became the highest-grossing film up to that time. Castellano, along with several other cast members, became widely known from the popular film. He spoke one of the film's most famous lines, \"Leave the gun; take the cannoli,\" which he partially ad-libbed.\n\nCastellano also appeared on television, playing the lead role of Joe Girelli in the television situation comedy The Super (10 episodes in 1972). His real-life daughter Margaret Castellano portrayed his character's daughter Joanne. He also portrayed the lead Joe Vitale in Joe and Sons (1975–1976).\n\nCastellano did not reprise his role as Clemenza in The Godfather Part II (1974). Bruno Kirby portrayed Clemenza as a young man in The Godfather Part II. He had played the son of Castellano's character in The Super."
    },
    {
      "id": 93,
      "full_name": "Robert Duvall",
      "nationality": "United States of America",
      "birth_date": "1931-01-05",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Robert_Duvall_by_David_Shankbone_%28cropped_2%29.jpg/440px-Robert_Duvall_by_David_Shankbone_%28cropped_2%29.jpg",
      "biography": "Robert Selden Duvall (born January 5, 1931) is an American actor. With a career spanning seven decades, he is the recipient of an Academy Award, four Golden Globe Awards, a BAFTA Award, two Primetime Emmy Awards, and a Screen Actors Guild Award.\n\nDuvall began his career on TV with minor roles in the 1960s on The Defenders, Playhouse 90 and Armstrong Circle Theatre. He made his Broadway debut in the play Wait Until Dark in 1966. He returned to the stage in David Mamet's play American Buffalo in 1977, earning a Drama Desk Award for Outstanding Actor in a Play nomination. He made his feature film acting debut portraying Boo Radley in To Kill a Mockingbird (1962). Other early roles include Captain Newman, M.D. (1963), Bullitt (1968), True Grit (1969), M*A*S*H (1970), THX 1138 (1971), Joe Kidd (1972), and Tomorrow (1972), the last of which was developed at the Actors Studio and is his personal favorite.\n\nDuvall won the Academy Award for Best Actor for his role as an alcoholic former country music star in the film Tender Mercies (1983). His other Oscar-nominated films include The Godfather (1972), Apocalypse Now (1979), The Great Santini (1979), The Apostle (1997), A Civil Action (1998), and The Judge (2014). Other notable roles include The Outfit (1973), The Godfather Part II (1974), The Conversation (1974), Network (1976), True Confessions (1981), The Natural (1984), Days of Thunder (1990), Rambling Rose (1991), Falling Down (1993), The Paper (1994), Sling Blade (1996), Open Range (2003), Crazy Heart (2009), Get Low (2010), Jack Reacher (2012), and Widows (2018).\n\nThroughout his career, Duvall has starred on numerous television programs. He won the Primetime Emmy Award for Outstanding Limited Series and Outstanding Lead Actor in a Limited Series for the AMC limited series Broken Trail (2007). His other Emmy-nominated roles are in the CBS miniseries Lonesome Dove (1989), the HBO film Stalin (1992), and the TNT film The Man Who Captured Eichmann (1996)."
    },
    {
      "id": 94,
      "full_name": "Sterling Hayden",
      "nationality": "United States of America",
      "birth_date": "1916-03-26",
      "death_date": "1986-05-23",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Sterling_Hayden_1953.jpg/220px-Sterling_Hayden_1953.jpg",
      "biography": "Sterling Walter Hayden (born Sterling Relyea Walter; March 26, 1916 – May 23, 1986) was an American actor, author, sailor, model and Marine. A leading man for most of his career, he specialized in Westerns and film noir throughout the 1950s, in films such as John Huston's The Asphalt Jungle (1950), Nicholas Ray's Johnny Guitar (1954), and Stanley Kubrick's The Killing (1956). He became noted for supporting roles in the 1960s, perhaps most memorably as General Jack D. Ripper in Kubrick's Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964).\n\nHayden's success continued into the New Hollywood era, with roles such as Irish-American policeman Captain McCluskey in Francis Ford Coppola's The Godfather (1972), alcoholic novelist Roger Wade in Robert Altman's The Long Goodbye (1973), and elderly peasant Leo Dalcò in Bernardo Bertolucci's 1900 (1976). With a distinctive \"rapid-fire baritone\" voice and standing at 6 ft 5 in (196 cm), he had a commanding screen presence in both leading and supporting roles.\n\nHayden often professed a distaste for acting and used his earnings to finance his numerous voyages as a sailor. He was also a decorated Marine Corps officer and an Office of Strategic Services' agent during World War II."
    },
    {
      "id": 95,
      "full_name": "John Marley",
      "nationality": "United States of America",
      "birth_date": "1907-10-17",
      "death_date": "1984-05-22",
      "photo": "https://i.pinimg.com/474x/ab/3f/51/ab3f51cd9559766413403270c220a058.jpg",
      "biography": "Marley was born in Harlem in New York City to Russian-Jewish immigrant parents. He dropped out of the City College of New York, turning to a career in acting. He served in the U.S. Army Signal Corps during World War II.\n\nMarley was a prolific actor, appearing in nearly 250 films and television series during a career spanning over 45 years. He had roles in TV series that included The Web, Peter Gunn, Johnny Staccato, Bourbon Street Beat, Perry Mason, Rawhide, The Untouchables, Sea Hunt, 77 Sunset Strip, The Lloyd Bridges Show, Dr. Kildare, The Outer Limits, The Alfred Hitchcock Hour, The Twilight Zone, Gunsmoke, The Wild Wild West, Mannix, Bonanza, Ironside, The Name of the Game, The F.B.I., Cannon, McCloud, Kolchak: The Night Stalker, Baretta, Barnaby Jones, and Hawaii Five-0.\n\nHe was cast as George Campbell in the 1961 episode \"Jerkwater\" of the series The Rebel, starring Nick Adams.\n\nIn 1962 he played the role of murderer Matthew Owen in the Perry Mason episode \"The Case of the Angry Astronaut.\" He also showed his acting prowess in a supporting but important role of Charlie Rondell in an episode of The Virginian (1968), titled \"The Crooked Path.\"\n\nMarley also played in two other movies where he attained notoriety. One was the cult movie The Car, where he played a sheriff of a small town that was victimized by a mysterious, black automobile.\n\nThe second movie was titled Framed, where he played mob boss Sal Viccarone, who befriended a gambler while they were both in prison.\n\nOne of Marley's more notable roles, albeit short, was that of film producer Jack Woltz in The Godfather. Marley later spoofed that role in an episode of SCTV Network. He played Max Berns, a film producer who was a caring father figure to Burt Reynolds in the stuntman tribute Hooper.\n\nIn the late 1970s, he appeared in the third season of the popular television series The Incredible Hulk as D.W. Banner, the father of David Banner in the episode titled \"Homecoming\"."
    },
    {
      "id": 96,
      "full_name": "Richard Conte",
      "nationality": "United States of America",
      "birth_date": "1910-03-24",
      "death_date": "1975-04-15",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/RICHARDConte.jpg/250px-RICHARDConte.jpg",
      "biography": "Richard Conte was born Nicholas Peter Conte on March 24, 1910 in Jersey City, New Jersey, the son of Italian-Americans Julia (Fina), a seamstress, and Pasquale Conte, a barber. He graduated from William L. Dickinson High School in Jersey City.\n\nConte worked as a truck driver, messenger, shoe salesman, and singing waiter before starting his acting career. He was discovered by actors Elia Kazan and John Garfield during his job at a Connecticut resort, which led to Conte finding stage work.\n\nHe eventually earned a scholarship to study at the Neighborhood Playhouse in New York City, where he became a standout actor.\n\nConte was a Republican who campaigned for Dwight Eisenhower during the 1952 presidential election. He was Catholic.\n\nHe made his film debut under the name Nicholas Conte in Heaven with a Barbed Wire Fence (1939) at 20th Century Fox. He played Tony, a hobo who meets up with Joe (Glenn Ford who was also making his film debut) and Anita (Jean Rogers). The three of them make their way west hopping trains. They are later joined by Professor B (Raymond Walburn).\n\nHe made his Broadway debut in My Heart's in the Highlands (1939) for the Group Theatre. Also for the Group, he was in Clifford Odets' Night Music (1940). He performed in the road company of Golden Boy.\n\nOn Broadway, he was in Heavenly Express (1941) and Walk Into My Parlor (1941). He was a hit in Jason (1942) then was he Family (1943).\n\nDuring World War II, Conte served in the United States Army, but he was discharged because of eye trouble."
    },
    {
      "id": 97,
      "full_name": "Harry Dean Stanton",
      "nationality": "United States of America",
      "birth_date": "1926-07-14",
      "death_date": "2017-09-15",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/HarryDeanStanton-1.jpg/220px-HarryDeanStanton-1.jpg",
      "biography": "Stanton was born in West Irvine, Kentucky, to Sheridan Harry Stanton, a tobacco farmer and barber, and Ersel (née Moberly), a cook. His parents divorced when Stanton was in high school; both later remarried.\n\nStanton had two younger brothers and a younger half-brother. His family had a musical background. Stanton attended Lafayette High School and the University of Kentucky in Lexington where he performed at the Guignol Theatre under the direction of theater director Wallace Briggs, and studied journalism and radio arts. \"I could have been a writer,\" he told an interviewer for a 2011 documentary, Harry Dean Stanton: Crossing Mulholland, in which he sings and plays the harmonica. \"I had to decide if I wanted to be a singer or an actor. I was always singing. I thought if I could be an actor, I could do all of it.\" Briggs encouraged him to leave the university and become an actor. He studied at the Pasadena Playhouse in Pasadena, California, where his classmates included his friends Tyler MacDuff and Dana Andrews.\n\nDuring World War II, Stanton served in the United States Navy, including a stint as a cook aboard the USS LST-970, a Landing Ship, Tank, during the Battle of Okinawa."
    },
    {
      "id": 98,
      "full_name": "Yaphet Kotto",
      "nationality": "United States of America",
      "birth_date": "1939-11-15",
      "death_date": "2021-03-15",
      "photo": "https://m.media-amazon.com/images/I/71-DDV3l0dL.jpg",
      "biography": "Kotto was born in New York City. His mother, Gladys Marie, was an American nurse and U.S. Army officer of Panamanian and West Indian descent. His father, Avraham Kotto (who was, according to his son, originally named Njoki Manga Bell), was a businessman from Cameroon who emigrated to the United States in the 1920s. Kotto's father was raised Jewish and his mother converted to Judaism. The couple separated when Kotto was a child, and he was raised by his maternal grandparents.\n\nBy the age of 16, Kotto was studying acting at the Actors Mobile Theater Studio.\n\nAt age 19, Yaphet Kotto made his professional acting debut in Othello. He was a member of the Actors Studio in New York. Kotto got his start in acting on Broadway, where he appeared in The Great White Hope, among other productions.\n\nHis film debut was in 1963, aged 23, in an uncredited role in 4 for Texas. He performed in Michael Roemer's Nothing but a Man (1964) and played a supporting role in the caper film The Thomas Crown Affair (1968). He played John Auston, a confused Marine Lance Corporal, in the 1968 episode \"King of the Hill\", on the first season of Hawaii Five-O.\n\nIn 1967, he released a single, \"Have You Ever Seen the Blues\" / \"Have You Dug His Scene\" (Chisa Records, CH006).\n\nKotto retired from film acting in the mid-1990s, though he had one final film role in Witless Protection (2008). However, he continued to take on television roles. Kotto portrayed Lieutenant Al Giardello in the long-running television series Homicide: Life on the Street. As a black Sicilian proud of his Italian ancestry, the character was a breakout for television. He has written the book Royalty and also wrote scripts for Homicide. In 2014, he voiced Parker for the video game Alien: Isolation, reprising the role he played in the movie Alien in 1979."
    }
  ],
  "directors": [
    {
      "id": 1,
      "full_name": "Steven Spielberg",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Ready_Player_One_Japan_Premiere_Red_Carpet_Steven_Spielberg_%2841604920761%29_%28cropped%29.jpg/240px-Ready_Player_One_Japan_Premiere_Red_Carpet_Steven_Spielberg_%2841604920761%29_%28cropped%29.jpg",
      "biography": "Spielberg was born in Cincinnati, Ohio, and grew up in Phoenix, Arizona. He moved to California and studied film in college. After directing several episodes for television, including Night Gallery and Columbo, he directed the television film Duel (1971), which later received an international theatrical release. He made his theatrical film debut with The Sugarland Express (1974) and became a household name with the 1975 summer blockbuster Jaws. He directed more box office successes with Close Encounters of the Third Kind (1977), E.T. the Extra-Terrestrial (1982), and the original Indiana Jones trilogy (1981–89). He subsequently explored drama in The Color Purple (1985) and Empire of the Sun (1987).\n\nIn 1993, Spielberg directed back-to-back blockbuster hits with the science fiction thriller Jurassic Park, the highest-grossing film ever at the time, and the Holocaust drama Schindler's List, which has often been listed as one of the greatest films ever made. He won the Academy Award for Best Director for the latter and the 1998 World War II epic Saving Private Ryan. Spielberg has since directed the science fiction films A.I. Artificial Intelligence (2001), Minority Report (2002), and War of the Worlds (2005); the adventure films The Adventures of Tintin (2011) and Ready Player One (2018); the historical dramas Amistad (1997), Munich (2005), War Horse (2011), Lincoln (2012), Bridge of Spies (2015) and The Post (2017); the musical West Side Story (2021); and the semi-autobiographical drama The Fabelmans (2022).",
      "birth_date": "1946-12-18",
      "death_date": ""
    },
    {
      "id": 2,
      "full_name": "Ridley Scott",
      "nationality": "Great Britain (England)",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/NASA_Journey_to_Mars_and_%E2%80%9CThe_Martian%E2%80%9D_%28201508180030HQ%29.jpg/220px-NASA_Journey_to_Mars_and_%E2%80%9CThe_Martian%E2%80%9D_%28201508180030HQ%29.jpg",
      "biography": "Sir Ridley Scott GBE (born 30 November 1937) is an English filmmaker. He is best known for directing films in the science fiction, crime and historical drama genres. His work is known for its atmospheric and highly concentrated visual style. He ranks among the highest-grossing directors and has received many accolades, including the BAFTA Fellowship for lifetime achievement in 2018, two Primetime Emmy Awards, and a Golden Globe Award.He was knighted by Queen Elizabeth II in 2003, and appointed a Knight Grand Cross by King Charles III in 2024.\n\nAn alumnus of the Royal College of Art in London, Scott began his career in television as a designer and director before moving into advertising as a director of commercials. He made his film directorial debut with The Duellists (1977) and gained wider recognition with his next film, Alien (1979). Though his films range widely in setting and period, they showcase memorable imagery of urban environments, spanning 2nd-century Rome in Gladiator (2000), 12th-century Jerusalem in Kingdom of Heaven (2005), medieval England in Robin Hood (2010), ancient Memphis in Exodus: Gods and Kings (2014), contemporary Mogadishu in Black Hawk Down (2001), and the futuristic cityscapes of Blade Runner (1982) and different planets in Alien, Prometheus (2012), The Martian (2015) and Alien: Covenant (2017).",
      "birth_date": "1937-11-30",
      "death_date": ""
    },
    {
      "id": 3,
      "full_name": "James Cameron",
      "nationality": "Canada",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/James_Cameron_by_Gage_Skidmore.jpg/240px-James_Cameron_by_Gage_Skidmore.jpg",
      "biography": "James Francis Cameron (born August 16, 1954) is a Canadian filmmaker. He is a major figure in the post-New Hollywood era. He often uses novel technologies with a classical filmmaking style. He first gained recognition for writing and directing The Terminator (1984) and found further success with Aliens (1986), The Abyss (1989), Terminator 2: Judgment Day (1991), True Lies (1994), as well as Avatar (2009) and its sequels. He directed, wrote, co-produced, and co-edited Titanic (1997), winning three Academy Awards for Best Picture, Best Director, and Best Film Editing. He is a recipient of various other industry accolades, and three of his films have been selected for preservation in the National Film Registry by the Library of Congress.\n\nCameron co-founded the production companies Lightstorm Entertainment, Digital Domain, and Earthship Productions. In addition to filmmaking, he is a National Geographic explorer-in-residence and has produced many documentaries on deep-ocean exploration, including Ghosts of the Abyss (2003) and Aliens of the Deep (2005). Cameron has also contributed to underwater filming and remote vehicle technologies and helped create the digital 3D Fusion Camera System. In 2012, Cameron became the first person to do a solo descent to the bottom of the Mariana Trench, the deepest part of the Earth's ocean, in the Deepsea Challenger submersible.",
      "birth_date": "1954-08-16",
      "death_date": ""
    },
    {
      "id": 4,
      "full_name": "James Mangold",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/James_Mangold_Press_Conference_Logan_Berlinale_2017_03.jpg/440px-James_Mangold_Press_Conference_Logan_Berlinale_2017_03.jpg",
      "biography": "James Allen Mangold (born December 16, 1963) is an American film director, producer and screenwriter. Noted for his versatility in tackling a range of genres, Mangold made his debut as a film director with Heavy (1995), and is best known for the films Cop Land (1997), Girl, Interrupted (1999), Identity (2003), Walk the Line (2005), 3:10 to Yuma (2007), and two films in the X-Men franchise with The Wolverine (2013) and Logan (2017), the latter of which earned him a nomination for the Academy Award for Best Adapted Screenplay. He then directed the sports drama film Ford v Ferrari (2019), which earned him a nomination for the Academy Award for Best Picture, and directed and co-wrote Indiana Jones and the Dial of Destiny (2023), the fifth and final installment in the Indiana Jones series.\n\nMangold was born in New York City in 1963, and is the son of Jewish artists Robert Mangold and Sylvia Plimack Mangold. He was raised in Hudson Valley and graduated from Washingtonville High School.\n\nHe attended the California Institute of the Arts film/video program where he studied under Alexander Mackendrick. During Mangold's third year, Mackendrick suggested that he should study at CalArts School of Theater as an actor, alongside his regular film studies.",
      "birth_date": "1963-12-16",
      "death_date": ""
    },
    {
      "id": 5,
      "full_name": "Gore Verbinski",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Verbinski_gore.jpg/440px-Verbinski_gore.jpg",
      "biography": "Gregor Justin \"Gore\" Verbinski (born March 16, 1964) is an American film director, screenwriter, and producer. He is best known for directing Mouse Hunt, The Ring, the first three Pirates of the Caribbean films, and Rango. For his work on Rango, Verbinski won both the Academy Award and BAFTA Award for Best Animated Film.\n\nHis first films were a series of 8 mm films called \"The Driver Files\" c. 1979, when he was a young teen. After graduating from film school at UCLA, he got his first job as a script reader at the commercial production company Limelight in 1987. After director Julien Temple viewed some of his work, he signed to his production company Nitrate Films, and later Palomar Pictures, where he directed music videos for bands like Vicious Rumors, Bad Religion, NOFX, 24-7 Spyz and Monster Magnet. Verbinski moved from music videos to commercials, where he worked for many brand names including Nike, Coca-Cola, Canon, Skittles and United Airlines. One of his most famous commercials was for Budweiser, featuring frogs who croak the brand name. For his efforts in commercials, Verbinski won four Clio Awards and one Cannes Advertising Silver Lion.\n\nVerbinski started Blind Wink Productions in April 2005.\n\nAfter completing a short film, The Ritual (which he both wrote and directed), Verbinski made his feature film directing debut in 1997 with Mouse Hunt, which became a global hit. Following that film's success, Verbinski planned and developed several aborted projects; The Sky Is Falling, Mission to Mars, Where the Wild Things Are, The Big Ticket, The Light Princess and an unpublished manuscript by William Monahan titled The Lighthouse.\n\nVerbinski returned in 2001 with the action/comedy The Mexican, starring Julia Roberts and Brad Pitt. The film received mixed reviews, and performed modestly at the box-office, earning $68 million domestically which was quite meager considering its star power (it was technically successful due to its moderately low $38 million budget). Verbinski followed it up with the horror film remake The Ring (2002), which struck gold globally, grossing well over $200 million worldwide. Verbinski also had a directorial hand in The Time Machine that year, temporarily taking over for an exhausted Simon Wells. Verbinski directed some of the underground Morlock sequences and is given a Thanks to credit in the film.",
      "birth_date": "1964-03-16",
      "death_date": ""
    },
    {
      "id": 6,
      "full_name": "Peter Jackson",
      "nationality": "New Zealand",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Peter_Jackson_SDCC_2014.jpg/440px-Peter_Jackson_SDCC_2014.jpg",
      "biography": "Sir Peter Robert Jackson ONZ KNZM (born 31 October 1961) is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy (2001–2003) and the Hobbit trilogy (2012–2014), both of which are adapted from the novels of the same name by J. R. R. Tolkien. Other notable films include the critically lauded drama Heavenly Creatures (1994), the horror comedy The Frighteners (1996), the epic monster remake film King Kong (2005), the World War I documentary film They Shall Not Grow Old (2018) and the documentary The Beatles: Get Back (2021). He is the fourth-highest-grossing film director of all-time, his films having made over $6.5 billion worldwide.\n\nJackson began his career with the \"splatstick\" horror comedy Bad Taste (1987) and the black comedy Meet the Feebles (1989) before filming the zombie comedy Braindead (1992). He shared a nomination for Academy Award for Best Original Screenplay with his partner Fran Walsh for Heavenly Creatures, which brought him to mainstream prominence in the film industry. Jackson has been awarded three Academy Awards for The Lord of the Rings: The Return of the King (2003), including Best Picture, Best Director, and Best Adapted Screenplay. His other awards include three BAFTAs, a Golden Globe, two Primetime Emmy Awards and four Saturn Awards among others.\n\nHis production company is WingNut Films, and his most regular collaborators are co-writers and producers Walsh and Philippa Boyens. Jackson was made a Companion of the New Zealand Order of Merit in 2002. He was later knighted (as a Knight Companion of the order) by Sir Anand Satyanand, the Governor-General of New Zealand, at a ceremony in Wellington in April 2010. In December 2014, Jackson was awarded a star on the Hollywood Walk of Fame.",
      "birth_date": "1961-10-31",
      "death_date": ""
    },
    {
      "id": 7,
      "full_name": "Tim Burton",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Tim_Burton_%287587109150%29.jpg/440px-Tim_Burton_%287587109150%29.jpg",
      "biography": "Timothy Walter Burton (born August 25, 1958) is an American director, producer, writer, and animator. Known for pioneering goth culture in the American film industry, Burton is famous for his gothic horror and fantasy films. He has received numerous accolades including an Emmy Award, and a Golden Globe Award as well as nominations for two Academy Awards and three BAFTA Awards. He was honored with the Venice International Film Festival's Golden Lion for Lifetime Achievement in 2007 and was given the Order of the Arts and Letters by Culture Minister of France in 2010.\n\nBurton made his directorial film debut with the comedy Pee-wee's Big Adventure (1985) and gained prominence for Beetlejuice (1988) and Edward Scissorhands (1990). Burton also directed the superhero films Batman (1989) and Batman Returns (1992), the animated films Corpse Bride (2005) and Frankenweenie (2012), the science fiction films Mars Attacks! (1996) and Planet of the Apes (2001), the supernatural horror film Sleepy Hollow (1999), the fantasy-dramas Big Fish (2003), Alice in Wonderland (2010), Dark Shadows (2012), and Dumbo (2019), and the musicals Charlie and the Chocolate Factory (2005) and Sweeney Todd: The Demon Barber of Fleet Street (2007) and the biographical dramas Ed Wood (1994) and Big Eyes (2014). Starting in 2022 Burton has directed several episodes for Netflix series Wednesday, for which he received a nomination for the Primetime Emmy Award for Outstanding Directing for a Comedy Series.\n\nBurton has frequently collaborated with Winona Ryder, Michael Keaton, Johnny Depp, Jenna Ortega, Helena Bonham Carter (his former domestic partner), Catherine O’Hara, Eva Green and Christopher Lee as well with composer Danny Elfman, who scored all but three of Burton's films. Burton has released several books including The Melancholy Death of Oyster Boy & Other Stories (1997).",
      "birth_date": "1958-08-25",
      "death_date": ""
    },
    {
      "id": 8,
      "full_name": "John McTiernan",
      "nationality": "United States of America",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/b/b2/John_McTiernan_Deauville_2014_3.jpg",
      "biography": "John Campbell McTiernan Jr. (born January 8, 1951) is an American retired filmmaker. He is best known for his action films, including Predator (1987), Die Hard (1988), and The Hunt for Red October (1990). His later well-known films include the action-comedy-fantasy film Last Action Hero (1993), the action film sequel Die Hard with a Vengeance (1995), the heist-film remake The Thomas Crown Affair (1999), and The 13th Warrior (1999). His last completed feature film was the mystery-thriller Basic, released in 2003.\n\nHe pleaded guilty to perjury and lying to an FBI investigator in regard to his hiring of the private investigator Anthony Pellicano in late 2000 to illegally wiretap the phone calls of two people, one of whom was Charles Roven, a co-producer of his action film remake Rollerball (2002). He was incarcerated in federal prison from April 2013 to February 2014. During his imprisonment, he filed for bankruptcy amidst foreclosure proceedings for his large ranch residence.\n\nMcTiernan was born in Albany, New York, the son of Myra and John Campbell McTiernan Sr., a lawyer and actor. He attended the Juilliard School before graduating with a Master of Fine Arts from the AFI Conservatory in 1975. John McTiernan is an alum from SUNY Old Westbury.",
      "birth_date": "1951-01-08",
      "death_date": ""
    },
    {
      "id": 9,
      "full_name": "Brian De Palma",
      "nationality": "United States of America",
      "birth_date": "1940-09-11",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Brian_De_Palma_Deauville_2011.jpg/220px-Brian_De_Palma_Deauville_2011.jpg",
      "biography": "De Palma was born on September 11, 1940, in Newark, New Jersey, the youngest of three boys. His Italian-American parents were Vivienne DePalma (née Muti), and Anthony F. DePalma, an orthopedic surgeon who was the son of immigrants from Alberona, Province of Foggia. He was raised in Philadelphia, Pennsylvania, and New Hampshire, and attended various Protestant and Quaker schools, eventually graduating from Friends' Central School. He had a poor relationship with his father, and would secretly follow him to record his adulterous behavior; this would eventually inspire the teenage character played by Keith Gordon in De Palma's 1980 film Dressed to Kill. When he was in high school, he built computers. He won a regional science-fair prize for a project titled \"An Analog Computer to Solve Differential Equations\".\n\nEnrolled at Columbia University as a physics student, De Palma became enraptured with the filmmaking process after viewing Citizen Kane and Vertigo. After receiving his undergraduate degree in 1962, De Palma enrolled at the newly coed Sarah Lawrence College as a graduate student in their theater department, earning an M.A. in the discipline in 1964 and becoming one of the first male students among a female population. Once there, influences as various as drama teacher Wilford Leach, the Maysles brothers, Michelangelo Antonioni, Jean-Luc Godard, Andy Warhol, and Alfred Hitchcock impressed upon De Palma the many styles and themes that would shape his own cinema in the coming decades."
    },
    {
      "id": 10,
      "full_name": "Neil Patrick Jordan",
      "nationality": "Ireland",
      "birth_date": "1950-02-25",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Neil_Jordan_by_David_Shankbone.jpg/220px-Neil_Jordan_by_David_Shankbone.jpg",
      "biography": "Jordan was born in Sligo, the son of Angela (née O'Brien), a painter, and Michael Jordan, a professor. He was educated at St. Paul's College, Raheny. Later, Jordan attended University College Dublin, where he studied Irish history and English literature. He graduated in 1972 with a BA in History. He became involved in student theatre there, where he met Jim Sheridan, who also was later to become an important Irish film director. Of his religious background, Jordan said in a 1999 Salon interview: \"I was brought up a Catholic and was quite religious at one stage in my life, when I was young. But it left me with no scars whatever; it just sort of vanished.\" He said about his current beliefs that \"God is the greatest imaginary being of all time. Along with Einstein's General Theory of Relativity, the invention of God is probably the greatest creation of human thought.\"\n\nHe won an Academy Award, two BAFTA Awards, a Golden Lion and a Silver Bear. He was honoured with receiving the French Ordre des Arts et des Lettres in 1996. He is known for writing and directing acclaimed dramas such as Mona Lisa (1986), The Crying Game (1992), Michael Collins (1996), The Butcher Boy (1997) and The End of the Affair (1999). Jordan also created the Showtime series The Borgias (2011) and Sky Atlantic's Riviera (2017). Jordan is also known as an author. He wrote Night in Tunisia (1976) which won the Guardian Fiction Prize in 1979."
    },
    {
      "id": 11,
      "full_name": "Michael Hirst",
      "nationality": "Great Britain (England)",
      "birth_date": "1952-09-21",
      "death_date": "",
      "photo": "http://t0.gstatic.com/licensed-image?q=tbn:ANd9GcRp0l8TsX9ZHWIH66kYOLEyWXAweDu4mrCAVzUdG8VKQy_mZZOV_mEHTdCCSimfV7Xr",
      "biography": "Hirst was born in Bradford, West Yorkshire and grew up in Ilkley. He was educated at Bradford Grammar School and attended the London School of Economics. He received a First Class Joint-Honours Degree in English and American Literature from the University of Nottingham and studied Henry James' writings at Trinity College, Oxford.\n\nHirst was originally going to be an academic, but decided to become a screenwriter after Nicolas Roeg read one of his short stories and asked Hirst to write screenplays for him.\n\nHe is best known for his films Elizabeth (1998) and Elizabeth: The Golden Age (2007), as well as the Emmy Award-winning television series The Tudors (2007-2010) and Vikings (2013-2020). Hirst owns Green Pavilion Entertainment, a production company he launched in December 2017."
    },
    {
      "id": 12,
      "full_name": "Mel Gibson",
      "nationality": "United States of America",
      "birth_date": "1956-01-03",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Mel_Gibson_Cannes_2016_2.jpg/220px-Mel_Gibson_Cannes_2016_2.jpg",
      "biography": "Mel Columcille Gerard Gibson (born January 3, 1956) is an American actor and film director. He is known for his action hero roles, particularly his breakout role as Max Rockatansky in the first three films of the post-apocalyptic action series Mad Max and as Martin Riggs in the buddy cop action-comedy film series Lethal Weapon.\n\nBorn in Peekskill, New York, Gibson moved with his parents to Sydney, Australia, when he was 12 years old. He studied acting at the National Institute of Dramatic Art, where he starred opposite Judy Davis in a production of Romeo and Juliet. During the 1980s, he founded Icon Entertainment, a production company, which independent film director Atom Egoyan has called \"an alternative to the studio system\". Director Peter Weir cast him as one of the leads in the World War I drama Gallipoli (1981), which earned Gibson a Best Actor Award from the Australian Film Institute. In 1985, Gibson was named as People magazine's first Sexiest Man Alive.\n\nIn 1995, Gibson produced, directed, and starred in Braveheart, a historical epic, for which he won the Golden Globe Award for Best Director, the Academy Award for Best Director, and the Academy Award for Best Picture. He later directed and produced The Passion of the Christ, a biblical drama that was both financially successful and highly controversial. He received further critical notice for his directorial work of the action-adventure film Apocalypto (2006), which is set in Mesoamerica during the early 16th century.\n\nAfter several legal issues and controversial statements leaked to the public, Gibson's popularity in Hollywood declined, affecting his careers in acting and directing. His career began seeing a resurgence with his performance in Edge of Darkness (2010) and Jodie Foster's The Beaver (2011). His directorial comeback after an absence of 10 years, Hacksaw Ridge (2016), won two Academy Awards, and was nominated for another four including Best Picture and Best Director for Gibson, his second nomination in the category."
    },
    {
      "id": 13,
      "full_name": "Francis Ford Coppola",
      "nationality": "United States of America",
      "birth_date": "1939-04-07",
      "death_date": "",
      "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Francis_Ford_Coppola_2011_CC.jpg/220px-Francis_Ford_Coppola_2011_CC.jpg",
      "biography": "Francis Ford Coppola is an American film director, producer, and screenwriter. He is considered one of the leading figures of the New Hollywood film movement of the 1960s and 1970s and is widely considered one of the greatest directors of all time. Coppola is the recipient of five Academy Awards, six Golden Globe Awards, two Palmes d'Or, and a British Academy Film Award (BAFTA).\n\nAfter directing The Rain People in 1969, Coppola co-wrote Patton (1970), which earned him the Academy Award for Best Original Screenplay along with Edmund H. North. Coppola's reputation as a filmmaker was cemented with the release of The Godfather (1972), which revolutionized the gangster genre of filmmaking, receiving strong commercial and critical reception. The Godfather won three Academy Awards: Best Picture, Best Actor and Best Adapted Screenplay (shared with Mario Puzo). The Godfather Part II (1974) became the first sequel to win the Academy Award for Best Picture. Highly regarded by critics, the film earned Coppola two more Academy Awards, for Best Adapted Screenplay and Best Director, making him the second director (after Billy Wilder) to win these three awards for the same film.\n\nAlso in 1974, Coppola released the thriller The Conversation, which received the Palme d'Or at the Cannes Film Festival. His next film, the war epic Apocalypse Now (1979), which had a notoriously lengthy and strenuous production, was widely acclaimed for vividly depicting the Vietnam War. It also won the Palme d'Or, making Coppola one of only ten filmmakers to have won the award twice. Other notable films Coppola has released since the start of the 1980s include the dramas The Outsiders and Rumble Fish (both 1983), The Cotton Club (1984), Peggy Sue Got Married (1986), The Godfather Part III (1990), Bram Stoker's Dracula (1992) and The Rainmaker (1997). Coppola has acted as producer on such diverse films as American Graffiti (1973), The Black Stallion (1979), The Escape Artist (1982), Hammett (1982), Mishima: A Life in Four Chapters (1985) and The Secret Garden (1993).\n\nMany of Coppola's relatives and children have become popular actors and filmmakers: his sister Talia Shire is an actress, his daughter Sofia is a director, his son Roman is a screenwriter, and his nephews Jason Schwartzman and Nicolas Cage are actors. Coppola resides in Napa, California, and since the 2010s has been a vintner, owning a family-branded winery of his own."
    }
  ],
  "movies": [
    {
      "id": 1,
      "title": "Indiana Jones: Raiders of the Lost Ark",
      "release_year": 1981,
      "genre": "Action",
      "directors": [
        "James Mangold",
        "Steven Spielberg"
      ],
      "actors": [
        "Harrison Ford",
        "Phoebe Waller-Bridge",
        "Mads Mikkelsen",
        "Shia LaBeouf",
        "Karen Allen",
        "John Rhys-Davies",
        "Philip Stone",
        "Ke Huy Quan"
      ],
      "studios": [
        "Lucasfilm Ltd."
      ],
      "poster": "https://m.media-amazon.com/images/I/81UOBSDQh0L._AC_UF894,1000_QL80_.jpg",
      "trailer": "https://www.youtube.com/watch?v=0xQSIdSRlAk",
      "storyline": "The year is 1936 and the intrepid archaeologist Indiana Jones sets out in search of the fabled Lost Ark of the Covenant, racing a bitter rival and his Nazi cohorts to the prize. Over the course of a hair-raising adventure, Indy endures explosions, spiders, snakes, booby traps, and bad guys in his quest to save the holy relic."
    },
    {
      "id": 2,
      "title": "Alien",
      "release_year": 1979,
      "genre": "Horror",
      "directors": [
        "Ridley Scott"
      ],
      "actors": [
        "Sigourney Weaver",
        "Tom Skerritt",
        "Veronica Cartwright",
        "John Hurt",
        "Ian Holm"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/c/c3/Alien_movie_poster.jpg/232px-Alien_movie_poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=4v4Kn0J6E-I",
      "storyline": "Alien, set in the year 2122 CE, tells the story of the deep-space commercial mining ship Nostromo. The ship is on its way back to Earth, carrying a load of extraterrestrial ore, when its crew is awakened from hypersleep, a type of high-tech hibernation, by the ship’s computer, Mother. The ship has intercepted what appears to be a distress signal from an uncharted planetoid, LV-426. Obligated to respond, the crew lands on the planetoid, and several of its members explore the surface. They find a spacecraft with a dead pilot and a cargo of alien eggs. When crew member Kane (John Hurt) inspects an egg that has opened, he is attacked by a face-hugging creature that inserts part of its body down his throat and clings fiercely to his head."
    },
    {
      "id": 3,
      "title": "Aliens",
      "release_year": 1986,
      "genre": "Sequel",
      "directors": [
        "James Cameron"
      ],
      "actors": [
        "Sigourney Weaver",
        "Bill Paxton",
        "Michael Biehn",
        "Lance Henriksen",
        "Jenette Goldstein"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/f/fb/Aliens_poster.jpg/196px-Aliens_poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=QlztL3cYwHs",
      "storyline": "Ellen Ripley has been in stasis for 57 years aboard an escape shuttle after destroying her ship, the Nostromo, to escape an alien creature that slaughtered the rest of the crew. She is rescued and debriefed by her employers at the Weyland-Yutani Corporation, who are skeptical about her claim of alien eggs in a derelict ship on the exomoon LV-426, since it is now the site of a terraforming colony.\n\nAfter contact is lost with the colony, Weyland-Yutani representative Carter Burke and Colonial Marine Lieutenant Gorman ask Ripley to accompany them to investigate. Still traumatized by her alien encounter, she agrees on the condition that they exterminate the creatures. Ripley is introduced to the Colonial Marines on the spaceship Sulaco but is distrustful of their android, Bishop, because the android aboard the Nostromo betrayed its crew to protect the alien on company orders."
    },
    {
      "id": 4,
      "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
      "release_year": 2003,
      "genre": "Fantasy",
      "directors": [
        "Gore Verbinski"
      ],
      "actors": [
        "Johnny Depp",
        "Orlando Bloom",
        "Keira Knightley",
        "Geoffrey Rush",
        "Kevin McNally"
      ],
      "studios": [
        "Walt Disney Pictures"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/7/79/Pirates-of-the-Caribbean-The-Curse-of-the-Black-Pearl-.jpg/201px-Pirates-of-the-Caribbean-The-Curse-of-the-Black-Pearl-.jpg",
      "trailer": "https://www.youtube.com/watch?v=gPBaZpDONgg",
      "storyline": "In the 18th century, Governor Weatherby Swann and his daughter, Elizabeth, sail aboard HMS Dauntless. Lieutenant Norrington's crew recovers a shipwrecked survivor, Will Turner. Elizabeth takes a gold medallion from around Will's neck, before seeing a ship with black sails. Eight years later in Port Royal, Jamaica, Norrington is promoted to commodore. While the promotion ceremony is taking place, Captain Jack Sparrow, who initially arrived in Port Royal to \"commandeer\" a ship, runs into two Royal Navy guards, Murtogg and Mullroy, who reveal to Jack that the HMS Interceptor is the fastest ship in the Caribbean.\n\nAfter the ceremony is finished, Commodore Norrington proposes to Elizabeth, before her corset makes her faint and fall into the water below, causing the medallion to emit a pulse. Jack rescues Elizabeth before escaping Commodore Norrington, who identifies Jack with his pirate brand. Will, now a blacksmith, meets Jack and fights long enough for Sparrow to be imprisoned."
    },
    {
      "id": 5,
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "release_year": 2001,
      "genre": "Adventures",
      "directors": [
        "Peter Jackson"
      ],
      "actors": [
        "Elijah Wood",
        "Ian McKellen",
        "Viggo Mortensen",
        "Orlando Bloom",
        "Ian Holm"
      ],
      "studios": [
        "New Line Cinema"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/f/fb/Lord_Rings_Fellowship_Ring.jpg",
      "trailer": "https://www.youtube.com/watch?v=_nZdmwHrcnw",
      "storyline": "In the Second Age of Middle-earth, the lords of Elves, Dwarves, and Men are given Rings of Power. Unbeknownst to them, the Dark Lord Sauron forges the One Ring in Mount Doom, instilling into it a great part of his power, to dominate the other Rings and conquer Middle-earth. A final alliance of Men and Elves battles Sauron's forces in Mordor. Isildur of Gondor severs Sauron's finger and the Ring with it, thereby vanquishing Sauron and returning him to spirit form. With Sauron's first defeat, the Third Age of Middle-earth begins. The Ring's influence corrupts Isildur, who takes it for himself and is later killed by Orcs. The Ring is lost in a river for 2,500 years until it is found by Gollum, who owns it for over four and a half centuries. The Ring abandons Gollum and it is subsequently found by a hobbit named Bilbo Baggins, who is unaware of its history."
    },
    {
      "id": 6,
      "title": "Indiana Jones and the Temple of Doom",
      "genre": "Adventures",
      "directors": [
        "Steven Spielberg"
      ],
      "actors": [
        "Harrison Ford",
        "Kate Capshaw",
        "Karen Allen",
        "John Rhys-Davies",
        "Philip Stone",
        "Ke Huy Quan"
      ],
      "studios": [
        "Paramount Pictures"
      ],
      "poster": "https://m.media-amazon.com/images/I/61AbSnzGR+L._AC_UF894,1000_QL80_.jpg",
      "trailer": "https://www.youtube.com/watch?v=WBdyLyijZhU",
      "storyline": "In 1935, American archeologist Indiana Jones survives a murder attempt from Shanghai crime boss Lao Che, who hired him to retrieve the remains of Nurhaci. Indy flees from the city in the company of the young orphan Short Round and nightclub singer Willie Scott, unaware that the plane he is traveling on is owned by Che. The plane's pilots dump the fuel and parachute away, but Indy, Willie and Short Round escape using an inflatable raft before the plane crashes. The trio ride down the slopes of the Himalayas and fall into a river before arriving at the Indian village of Mayapore. There, the villagers plead for Indy's aid in retrieving a sacred lingam stone stolen along with the village's children by evil forces from the nearby Pankot Palace. Indy agrees to do so, hypothesizing that the stone is one of the five Sankara stones given by the Hindu gods to help humanity fight evil. Traveling to the palace, the trio are warmly welcomed and allowed to stay for the night as guests, attending a banquet hosted by the palace's young maharaja.",
      "release_year": 1984
    },
    {
      "id": 7,
      "title": "Alice in Wonderland",
      "genre": "Fantasy",
      "directors": [
        "Tim Burton"
      ],
      "actors": [
        "Johnny Depp",
        "Mia Wasikowska",
        "Helena Bonham Carter"
      ],
      "studios": [
        "Walt Disney Pictures"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/3/36/Alice_in_Wonderland_%282010_film%29.png",
      "trailer": "https://www.youtube.com/watch?v=9POCgSRVvf0",
      "storyline": "In 1868, 19-year-old Alice Kingsleigh, having mourned the recent loss of her father, is troubled by strange recurring dreams and the stifling expectations of the society in which she lives. After receiving an unwanted marriage proposal from Hamish Ascot at his father's garden party, Alice spots a familiar white rabbit wearing a waistcoat and carrying a pocket watch. She follows it to a rabbit hole and accidentally falls in. She shrinks after drinking from a bottle labeled 'Drink Me' (called a Pishsalver), meaning she cannot reach a key on a table, and then eats a cake labeled 'Eat Me' (called an Upelkuchen), transforming into a giantess. After drinking from the bottle again to fit through a tiny door, she enters the forest of a fantastical place called Underland. There, she is greeted by the White Rabbit, a Dormouse, a Dodo, Talking Flowers, and identical twins Tweedledum and Tweedledee, who all apparently know her.\n\nAlice asserts that she is dreaming, but learns from Absolem the Caterpillar that she is destined to slay the Jabberwocky and end the tyranny of the Red Queen. The group is ambushed by the ravenous Bandersnatch and the Red Queen's knights, led by the Knave of Hearts. All are captured except Alice, who escapes, and the Dormouse, who takes one of the Bandersnatch's eyes. The Knave informs the Red Queen of Alice's return, and is ordered to find her immediately.",
      "release_year": 2010
    },
    {
      "id": 8,
      "title": "Pirates of the Caribbean: At World's End",
      "genre": "Fantasy",
      "directors": [
        "Gore Verbinski"
      ],
      "actors": [
        "Johnny Depp",
        "Keira Knightley",
        "Orlando Bloom",
        "Geoffrey Rush"
      ],
      "studios": [
        "Universal Studios Hollywood"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/5/5a/Pirates_AWE_Poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=kmxWPr8s_Y4",
      "storyline": "Now in control of the oceans, Lord Cutler Beckett executes anyone associated with piracy in Port Royal and orders Davy Jones to destroy all pirate ships. Condemned prisoners sing Hoist the Colours to compel nine Pirate Lords from around the world to convene at Shipwreck Cove to hold the Brethren Court and address the threat Beckett poses. Because Pirate Lord Jack Sparrow never named a successor before being dragged to Davy Jones' Locker, Hector Barbossa, Will Turner, Elizabeth Swann, Tia Dalma, and the surviving crew of the Black Pearl plot to rescue him. In Singapore, the crew meet Pirate Lord Sao Feng, who owns navigational charts to the Locker before they are attacked by the East India Trading Company. During the battle, Will secretly promises to give Jack to Feng in return for the Pearl, intending to use it to rescue his father \"Bootstrap Bill\" Turner from the Flying Dutchman.\n\nThe crew crosses over into the Locker, rescues Jack and recovers the Pearl. While departing, they encounter boats of dead souls, including Elizabeth's father Governor Swann, executed by Beckett. The goddess Calypso charged Davy Jones with guiding the souls of those who died at sea to the next world; every ten years he could come ashore to be with the woman he loved, but after his lover never arrived to meet him, Jones corrupted his purpose and cursed himself to become a monster. Whoever kills Jones by stabbing his disembodied heart must become the Dutchman's captain.",
      "release_year": 2007
    },
    {
      "id": 9,
      "title": "The Terminator",
      "genre": "Thriller",
      "directors": [
        "James Cameron"
      ],
      "actors": [
        "Arnold Schwarzenegger",
        "Michael Biehn",
        "Lance Henriksen",
        "Bill Paxton"
      ],
      "studios": [
        "Hemdale Film Corporation"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/7/70/Terminator1984movieposter.jpg",
      "trailer": "https://www.youtube.com/watch?v=k64P4l2Wmeg",
      "storyline": "A cyborg is sent back in time from 2029 to 1984 Los Angeles; an assassin known as a Terminator, disguised as a human male and programmed to hunt and assassinate a woman named Sarah Connor. Separately, a human soldier named Kyle Reese also arrives, intent on stopping it, as they both steal ammunition and clothing. After searching for addresses in a telephone directory, the Terminator systematically kills women that share Sarah's name before tracking the correct Sarah to a nightclub, but she is rescued by Reese. The duo steal a car and escape, with the Terminator pursuing them in a stolen police car.\n\nAs they hide in a parking lot, Reese explains to Sarah that an artificially intelligent defense network known as Skynet, created by Cyberdyne Systems, will become self-aware in the near future and trigger a global nuclear war to bring humankind to its extinction. Sarah's future son, John, will rally the survivors and lead a successful resistance movement against Skynet and its mechanical forces. On the verge of the resistance's victory, Skynet sends the Terminator back in time to eliminate Sarah, thereby preventing John's birth. The Terminator is an efficient and relentless killing machine with a perfect voice-mimicking ability and a durable metal endoskeleton covered by living tissue for it to appear human.\n\nThe police then apprehend Reese and Sarah after another encounter with the Terminator. It then attacks the police station, killing several officers while hunting for Sarah. Reese and Sarah escape, steal another car and take refuge in a motel, where they assemble several pipe bombs and plan their next move. Reese admits that he has adored Sarah since he saw her in a photograph John gave him and that he traveled through time out of love for her. Reciprocating his feelings, Sarah kisses him, and they have sex, conceiving John. The Terminator locates Sarah by intercepting a call intended for her mother. She and Reese escape the motel in a pickup truck while it pursues them on a motorcycle. In the ensuing chase, Reese is badly wounded by gunfire while throwing pipe bombs at the Terminator. Sarah knocks the Terminator off its motorcycle but loses control of the truck, which flips over.",
      "release_year": 1984
    },
    {
      "id": 10,
      "title": "Predator",
      "genre": "Science fiction",
      "directors": [
        "John McTiernan"
      ],
      "actors": [
        "Arnold Schwarzenegger",
        "Bill Paxton"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://i.etsystatic.com/35396601/r/il/0ecb17/4578464483/il_fullxfull.4578464483_83es.jpg",
      "trailer": "https://www.youtube.com/watch?v=_1wDBNHYDv8",
      "storyline": "An alien spacecraft deploys a shuttle to Earth, where Vietnam War veteran Major Alan \"Dutch\" Schaefer and his military rescue team—consisting of Mac, Poncho, Blain, Billy, and Hawkins—are tasked with rescuing a foreign cabinet minister and his aide from communist insurgents in an unspecified South American country. CIA officer Al Dillon, a Vietnam War buddy of Dutch's, is assigned to accompany the team over Dutch's objections. En route, the team discovers the wreckage of a helicopter and three skinned corpses. Dutch identifies them as Green Berets he knew and becomes suspicious of Dillon's intentions. The team reaches the guerrilla camp and witnesses the execution of a hostage. They mount an attack, killing most of the rebels and several Soviet intelligence officers. Dutch confronts Dillon, who reveals their true mission was to stop a planned Soviet-backed invasion and that the CIA sent the Green Berets weeks earlier for the same mission.\n\nThe only surviving guerrilla, Anna, is captured. Learning that more rebels are coming, the team chooses to trek to the extraction point. Unbeknownst to them, they are stalked by an entity employing a cloaking device and thermal imaging technology, but a spooked Billy glimpses it, creating a situation where Anna attempts an escape. Hawkins catches her, but the creature attacks and kills him while sparing Anna.\n\nDutch organizes a search party, but Blain is killed by the creature's plasma cannon. Enraged, Mac provokes everyone to blindly fire their weapons into the jungle, unknowingly wounding the creature. As it administers first aid to itself, the commandos regroup and realize they are being hunted; Dillon believes guerrillas are responsible, but Billy is adamant that their pursuer is not human. They make camp for the night and set traps, which are triggered by a wild boar. In the ensuing confusion, the creature steals Blain's body.",
      "release_year": 1987
    }
  ],
  "studios": [
    {
      "id": 1,
      "title": "Lucasfilm Ltd.",
      "location": "San Francisco",
      "foundation_year": 1971,
      "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Lucasfilm_logo.svg/250px-Lucasfilm_logo.svg.png",
      "about": "Lucasfilm Ltd. LLC is an American film and television production company founded by filmmaker George Lucas in 1971 in San Rafael, California, though most of the company's operations were moved to San Francisco in 2005. It has been a subsidiary of The Walt Disney Studios since 2012 and is best known for creating and producing the Star Wars and Indiana Jones franchises, as well as its leadership in developing special effects, sound, and computer animation for films.\n\nThe company's films Star Wars: Episode I – The Phantom Menace (1999), Star Wars: The Force Awakens (2015), Rogue One: A Star Wars Story (2016), Star Wars: The Last Jedi (2017), and Star Wars: The Rise of Skywalker (2019) are all among the 50 highest-grossing films of all time, with The Force Awakens becoming the highest-grossing film in the United States and Canada. On October 30, 2012, Disney acquired Lucasfilm for $4.05 billion in the form of cash and $1.855 billion in stock."
    },
    {
      "id": 2,
      "title": "20th Century Studios, Inc.",
      "location": "Los Angeles",
      "foundation_year": 1935,
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTlWG8HxHW6-VKfUD-QiVpnFeHfh4u_qYguFA&s",
      "about": "20th Century Studios, Inc. is an American film studio owned by the Walt Disney Studios, a division of Disney Entertainment, in turn a division of The Walt Disney Company. It is headquartered at the Fox Studio Lot in the Century City area of Los Angeles, leased from Fox Corporation. Walt Disney Studios Motion Pictures distributes and markets the films produced by 20th Century Studios in theatrical markets.\n\nFor over 80 years, 20th Century was one of the major American film studios. It was formed in 1935 as Twentieth Century-Fox Film Corporation by the merger of Fox Film and Twentieth Century Pictures, and one of the original \"Big Five\" among eight majors of Hollywood's Golden Age. In 1985, the studio removed the hyphen in the name (becoming Twentieth Century Fox Film Corporation) after being acquired by Rupert Murdoch's News Corporation, which was renamed 21st Century Fox in 2013 after it spun off its publishing assets. Disney purchased most of 21st Century Fox's assets, which included 20th Century Fox, on March 20, 2019. The studio adopted its current name as a trade name on January 17, 2020, in order to avoid confusion with Fox Corporation, and subsequently started to use it for the copyright of 20th Century and Searchlight Pictures productions on December 4."
    },
    {
      "id": 3,
      "title": "Walt Disney Pictures",
      "location": "California",
      "foundation_year": 1929,
      "logo": "https://i.insider.com/5f5770dee6ff30001d4e7684?width=800&format=jpeg&auto=webp",
      "about": "Walt Disney Pictures (credited as Disney in theatrical releases) is an American film production company and subsidiary of Walt Disney Studios, a division of Disney Entertainment, which is owned by The Walt Disney Company. The studio is the flagship producer of live-action feature films within the Walt Disney Studios unit, and is based at the Walt Disney Studios in Burbank, California. Animated films produced by Walt Disney Animation Studios and Pixar Animation Studios are also released under the studio banner. Walt Disney Studios Motion Pictures distributes and markets the films produced by Walt Disney Pictures.\n\nDisney began producing live-action films in the 1950s. The live-action division became Walt Disney Pictures in 1983, when Disney reorganized its entire studio division; which included the separation from the feature animation division and the subsequent creation of Touchstone Pictures. At the end of that decade, combined with Touchstone's output, Walt Disney Pictures elevated Disney to one of Hollywood's major film studios.\n\nWalt Disney Pictures is currently one of five live-action film studios within the Walt Disney Studios, alongside 20th Century Studios, Marvel Studios, Lucasfilm, and Searchlight Pictures. The 2019 remake of The Lion King is the studio's highest-grossing film worldwide with $1.6 billion, and Pirates of the Caribbean is the studio's most successful film series, with five films earning a total of over $4.5 billion in worldwide box office gross."
    },
    {
      "id": 4,
      "title": "New Line Cinema",
      "location": "Los Angeles",
      "foundation_year": 1967,
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRC-5SpIGPcNSnOT5_jDBdLa9zAE3yESllFFw&s",
      "about": "New Line Productions, Inc., doing business as New Line Cinema, is an American film and television production studio owned by Warner Bros. Discovery (WBD). Since 2008, it has been operating as a unit of Warner Bros. Pictures.\n\nNew Line Cinema was established in 1967 by the then 27-year-old Robert Shaye as a film distribution company, supplying foreign and art films for college campuses in the United States. Shaye operated New Line's offices out of his apartment at 14th Street and Second Avenue in New York City. One of the company's early successes was its distribution of the 1936 anti-cannabis propaganda film Reefer Madness, which became a cult hit on American college campuses in the early 1970s. New Line also released many classic foreign-language films, like Stay As You Are, Immoral Tales and Get Out Your Handkerchiefs (which became the first New Line film to win an Oscar). The studio has also released many of the films of John Waters.\n\nIn 1976, New Line secured funding to produce its first full-length feature, Stunts (1977), directed by Mark L. Lester. Although not considered a critical success, the film performed well commercially on the international market and on television.\n\nIn 1980, Shaye's law school classmate Michael Lynne became outside counsel and adviser to the company and renegotiated its debt.\n\nIn 1983, Bryanston Distributing Company, the company that first distributed the original The Texas Chain Saw Massacre, lost the rights to that film, and the rights reverted to the original owners. New Line bought the rights and re-released the film to theatres that same year. It became very successful for the studio.\n\nNew Line expanded its film production in the early 1980s, producing or co-producing films including Polyester, directed by John Waters, and Alone in the Dark. Polyester was one of the first films to introduce a novelty cinema experience named Odorama, where members of the audience were provided with a set of \"scratch and sniff\" cards to be scratched and sniffed at specific times during the film, which provided an additional sensory connection to the viewed image. In 1983, Lynne joined the board. In 1984, Dawn Altyn and Jeff Youngs joined New Line, respectively as sales manager, eastern and southern divisions of New Line Distribution, and national print controller of the studio, to distribute new projects."
    },
    {
      "id": 5,
      "title": "Paramount Pictures",
      "location": "Los Angeles",
      "foundation_year": 1912,
      "logo": "https://goodlogo.com/images/logos/paramount_logo_2434.gif",
      "about": "Paramount Pictures Corporation (also known simply as Paramount) is an American film and television production and distribution company and the namesake subsidiary of Paramount Global. It is the sixth-oldest film studio in the world, the second-oldest film studio in the United States (behind Universal Pictures), and the sole member of the \"Big Five\" film studios located within the city limits of Los Angeles.\n\nIn 1916, film producer Adolph Zukor put 24 actors and actresses under contract and honored each with a star on the logo. In 1967, the number of stars was reduced to 22 and their hidden meaning was dropped. In 2014, Paramount Pictures became the first major Hollywood studio to distribute all of its films in digital form only. The company's headquarters and studios are located at 5555 Melrose Avenue, Hollywood, California.\n\nParamount Pictures is a member of the Motion Picture Association (MPA)."
    },
    {
      "id": 6,
      "title": "Universal Studios Hollywood",
      "location": "California",
      "foundation_year": 1912,
      "logo": "https://media.tacdn.com/media/attractions-splice-spp-674x446/09/28/92/ef.jpg",
      "about": "Universal Studios Hollywood is a film studio and theme park in the San Fernando Valley area of Los Angeles County, California. About 70% of the studio lies within the unincorporated county island known as Universal City while the rest lies within the city limits of Los Angeles, California. It is one of the oldest and most famous Hollywood film studios still in use. Its official marketing headline is \"The Entertainment Capital of LA\". It was initially created to offer tours of the real Universal Studios sets and is the first of many full-fledged Universal Studios Theme Parks located across the world.\n\nOutside the theme park, a new, all-digital facility near the Universal Pictures backlot was built in an effort to merge all of NBCUniversal's West Coast operations into one area. As a result, the current home for KNBC, KVEA and NBC News with Noticias Telemundo Los Angeles Bureaus with new digital facility is on the Universal lot formerly occupied by Technicolor SA. Universal City includes hotels Universal Hilton & Towers, the Sheraton Universal Hotel, and Universal CityWalk, which offers a collection of shops, restaurants, an 18-screen Universal Cinema and a seven-story IMAX theater. In 2017, the park hosted 9.056 million guests, ranking it 15th in the world and 9th among North American parks."
    },
    {
      "id": 7,
      "title": "Hemdale Film Corporation",
      "location": "London",
      "foundation_year": 1967,
      "logo": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/02df2846-a4a8-4c9d-bc27-349080c98596/d743mql-1d4b0afe-7568-4b74-b1cb-53728cf8578d.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzAyZGYyODQ2LWE0YTgtNGM5ZC1iYzI3LTM0OTA4MGM5ODU5NlwvZDc0M21xbC0xZDRiMGFmZS03NTY4LTRiNzQtYjFjYi01MzcyOGNmODU3OGQucG5nIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.xVvAJfFNP9v7LWDWBB19jdeIoLPMkdtqONXkP-pHFL8",
      "about": "Hemdale Film Corporation (known as Hemdale Communications after 1992) was an independent American-British film production company and distributor. The company was founded in London in 1967 as the Hemdale Company by actor David Hemmings and John Daly, naming the company from a combination of their surnames. The company produced numerous acclaimed films, often in conjunction with companies such as TriStar and Orion Pictures, including The Terminator (1984), Platoon (1986) and The Last Emperor (1987), the latter two being back-to-back winners of the Academy Award for Best Picture."
    },
    {
      "id": 8,
      "title": "Columbia Pictures",
      "location": "California",
      "foundation_year": 1924,
      "logo": "https://pbs.twimg.com/profile_images/3726733706/fa7e2dcde69c450a3c6e7e14cec1020d_400x400.png",
      "about": "Columbia Pictures Industries, Inc., commonly known as Columbia Pictures or simply Columbia, is an American film production and distribution company that is a member of the Sony Pictures Motion Picture Group, a division of Sony Pictures Entertainment, which is one of the Big Five studios and a subsidiary of the multinational conglomerate Sony Group Corporation.\n\nOn June 19, 1918, brothers Jack and Harry Cohn and their business partner Joe Brandt founded the studio as Cohn-Brandt-Cohn (CBC) Film Sales Corporation. It adopted the Columbia Pictures name on January 10, 1924 (operating as Columbia Pictures Corporation until December 23, 1968) went public two years later and eventually began to use the image of Columbia, the female personification of the United States, as its logo.\n\nIn its early years, Columbia was a minor player in Hollywood, but began to grow in the late 1920s, spurred by a successful association with director Frank Capra. With Capra and others such as the most successful two reel comedy series The Three Stooges, Columbia became one of the primary homes of the screwball comedy. In the 1930s, Columbia's major contract stars were Jean Arthur and Cary Grant. In the 1940s, Rita Hayworth became the studio's premier star and propelled their fortunes into the late 1950s. Rosalind Russell, Glenn Ford and William Holden also became major stars at the studio.\n\nIt is one of the leading film studios in the world, and was one of the so-called \"Little Three\" among the eight major film studios of Hollywood's Golden Age. Today, it has become the world's third largest major film studio.\n\nThe company was also primarily responsible for distributing Disney's Silly Symphony film series as well as the Mickey Mouse cartoon series from 1929 to 1932. The studio is presently headquartered at the Irving Thalberg Building on the former Metro-Goldwyn-Mayer (currently known as the Sony Pictures Studios) lot in Culver City, California since 1990.\n\nColumbia Pictures is a member of the Motion Picture Association (MPA), under Sony Pictures Entertainment, and is currently one of six live-action labels of Sony Pictures Motion Picture Group, the others being TriStar Pictures, Affirm Films, Screen Gems, Sony Pictures Classics, and Stage 6 Films. Columbia's most commercially successful franchises include Spider-Man, Jumanji, Bad Boys, Men in Black, The Karate Kid, Robert Langdon, and Ghostbusters, and the studio's highest-grossing film worldwide is Spider-Man: No Way Home with box office of $1.92 billion."
    },
    {
      "id": 9,
      "title": "Scott Free Productions",
      "location": "London",
      "foundation_year": 1970,
      "logo": "https://pbs.twimg.com/media/GE9VNoKXAAA0kch.jpg",
      "about": "Scott Free Productions is a British-American independent film and television production company founded in 1970 by filmmakers and brothers Ridley Scott and Tony Scott. They formed the feature film development company Percy Main Productions in 1980, naming the company after the English village Percy Main, where their father grew up. The company was renamed Scott Free Productions in 1995.Scott Free has produced films ranging from the 2000 Hollywood blockbuster Gladiator (2000) to \"smaller pictures\" like Cracks (2009). Between the productions of White Squall (1996) and G.I. Jane (1997), Ridley Scott reorganised the company.\n\nScott Free Productions has offices in London and Los Angeles. It works with Ridley Scott's larger company RSA Films by assisting directors in film and television.\n\nAs of Clay Pigeons, released in 1998, the production logo is a watercolour style traditional animation of a crudely-drawn man wearing monk-style clothing with a white haze surrounding him, walking and smoking a cigarette, then running and transforming into a bird. The company name (sometimes since A Good Year in 2006, without it) appears underneath the bird and everything turns blue and on a black background. The bird is between the name. It was done by Italian artist and animator Gianluigi Toccafondo."
    },
    {
      "id": 10,
      "title": "Corus Entertainment",
      "location": "Toronto",
      "foundation_year": 1921,
      "logo": "https://www.anbmedia.com/wp-content/uploads/2023/02/Corus-Entertainment.jpg",
      "about": "Corus Entertainment, Inc. (often simply known as Corus) is a Canadian mass media company. The company was founded in 1921 as Shaw Radio, Ltd. as a subsidiary of Shaw Communications and was spun-off from Shaw in 1928. It has prominent holdings in the radio, publishing, and television industries. Corus is headquartered at Corus Quay in Toronto, Ontario.\n\nCorus has a large presence in Canadian broadcasting as owner of the national Global network (15 conventional stations), 39 radio stations, and a portfolio of 33 specialty television services; the company's domestic specialty brands include Showcase, SériesPlus, Slice, Télétoon, W Network, and YTV. It also operates services under brand licensing agreements with A&E Networks (History and Lifetime), Paramount Global (CMT and Nickelodeon), The Walt Disney Company (Freeform via ABC Spark, and National Geographic units), and Warner Bros. Discovery (Cartoon Network, Boomerang, Adult Swim, and lifestyle brands).\n\nCorus owns the animation studio Nelvana, and children's publisher Kids Can Press. The second incarnation of Shaw's media division—formed from the properties of the bankrupt Canwest Global—was subsumed by Corus on April 1, 2016, giving it control of the over-the-air Global network and 19 additional specialty channels. In May 2019, Shaw announced that it would sell its shares in Corus for roughly $500 million."
    }
  ]
}