{
  "actors": [
    {
      "id": 1,
      "movies": [
        "Indiana Johns",
        "The star wars",
        "Patriot Games",
        "Gentelmens of fortune"
      ],
      "fullName": "Harrison Ford",
      "birthYear": "1942",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Harrison_Ford_by_Gage_Skidmore_3.jpg/274px-Harrison_Ford_by_Gage_Skidmore_3.jpg",
      "biography": "Harrison Ford was born at the Swedish Covenant Hospital in Chicago, Illinois, on July 13, 1942, to former radio actress Dorothy (née Nidelman) and advertising executive and former actor John William \"Christopher\" Ford. His younger brother, Terence, was born in 1945. Their father was a Catholic of Irish descent, while their mother was an Ashkenazi Jew whose parents were emigrants from Minsk, Belarus, then in the Russian Empire. When asked in which religion he and his brother were raised, Ford jokingly responded \"Democrat\" and more seriously stated that they were raised to be \"liberals of every stripe\". When asked about what influence his Jewish and Irish Catholic ancestry may have had on him, he quipped, \"As a man I've always felt Irish, as an actor I've always felt Jewish.\"\n\nFord was a Boy Scout, achieving the second-highest rank of Life Scout. He worked at Napowan Adventure Base Scout Camp as a counselor for the Reptile Study merit badge. Because of this, he and director Steven Spielberg later decided to depict the young Indiana Jones as a Life Scout in Indiana Jones and the Last Crusade (1989). Ford graduated in 1960 from Maine East High School in Park Ridge, Illinois. His voice was the first student voice broadcast on his high school's new radio station, WMTH, and he was its first sportscaster during his senior year. He attended Ripon College in Ripon, Wisconsin, where he was a philosophy major and a member of the Sigma Nu fraternity. A self-described \"late bloomer\", Ford took a drama class in the final quarter of his senior year to get over his shyness and became fascinated with acting. Ford was expelled from college four days before graduation."
    },
    {
      "id": 2,
      "movies": [
        "Sleepy Hollow",
        "Pirates of the Caribbean",
        "The Tourist",
        "Alice in Wonderland"
      ],
      "fullName": "Johnny Depp",
      "birthYear": "1963",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Johnny_Depp_Deauville_2019.jpg/220px-Johnny_Depp_Deauville_2019.jpg",
      "biography": "John Christopher \"Johnny\" Depp II was born on June 9, 1963 in Owensboro, Kentucky, to Betty Sue Palmer (née Wells), a waitress, and John Christopher Depp, a civil engineer. He was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. When he married Lori A. Depp, he took a job as a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor Nicolas Cage, who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, Кошмар на улице Вязов (1984), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger."
    },
    {
      "id": 3,
      "movies": [
        "Alien",
        "Avatar",
        "Aliens"
      ],
      "fullName": "Sigourney Weaver",
      "birthYear": "1949",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Sigourney_Weaver_by_Gage_Skidmore_4.jpg/250px-Sigourney_Weaver_by_Gage_Skidmore_4.jpg",
      "biography": "Susan Alexandra Weaver was born in New York City on October 8, 1949. Her mother, Elizabeth Inglis (born Desiree Mary Lucy Hawkins), was a British actress and a native of Colchester, England. Weaver's father, Sylvester \"Pat\" Weaver Jr., was an American television executive born in Los Angeles, who served as president of NBC from 1953 to 1955 and created NBC's Today Show in 1952. Pat's brother, Winstead \"Doodles\" Weaver, was a comedian and contributor to Mad. Her father's American family was of Dutch, English, Scots-Irish, and Scottish ancestry.\n\nAt the age of 14, Weaver began using the name Sigourney, taking it from a minor character in The Great Gatsby. She briefly attended the Brearley School and Chapin School in New York before arriving at the Ethel Walker School (Walker's) in Simsbury, Connecticut, where she developed an early interest in performance art.One of her early roles was in a school adaptation of the poem \"The Highwayman\", and on another occasion she played a Rudolph Valentino character in an adaptation of The Sheik. She was also involved in theatrical productions of A Streetcar Named Desire and You Can't Take It with You during one summer at Southbury, Connecticut. Weaver reportedly reached the height of 179 cm (5 ft 10 in) by the age of 11, which had a negative impact on her self-esteem. She recalled feeling like \"a giant spider\" and never having \"the confidence to ever think I could act."
    },
    {
      "id": 4,
      "movies": [
        "Indiana Johns",
        "The star wars",
        "Patriot Games",
        "Gentelmens of fortune"
      ],
      "fullName": "Harrison Ford 1",
      "birthYear": "1942",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Harrison_Ford_by_Gage_Skidmore_3.jpg/274px-Harrison_Ford_by_Gage_Skidmore_3.jpg"
    },
    {
      "id": 5,
      "movies": [
        "Sleepy Hollow",
        "Pirates of the Caribbean",
        "The Tourist",
        "Alice in Wonderland"
      ],
      "fullName": "Johnny Depp 1",
      "birthYear": "1963",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Johnny_Depp_Deauville_2019.jpg/220px-Johnny_Depp_Deauville_2019.jpg"
    },
    {
      "id": 6,
      "movies": [
        "Alien",
        "Avatar",
        "Aliens"
      ],
      "fullName": "Sigourney Weaver 1",
      "birthYear": "1949",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Sigourney_Weaver_by_Gage_Skidmore_4.jpg/250px-Sigourney_Weaver_by_Gage_Skidmore_4.jpg"
    },
    {
      "id": 7,
      "movies": [
        "Indiana Johns",
        "The star wars",
        "Patriot Games",
        "Gentelmens of fortune"
      ],
      "fullName": "Harrison Ford 2",
      "birthYear": "1942",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Harrison_Ford_by_Gage_Skidmore_3.jpg/274px-Harrison_Ford_by_Gage_Skidmore_3.jpg"
    },
    {
      "id": 8,
      "movies": [
        "Sleepy Hollow",
        "Pirates of the Caribbean",
        "The Tourist",
        "Alice in Wonderland"
      ],
      "fullName": "Johnny Depp 2",
      "birthYear": "1963",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Johnny_Depp_Deauville_2019.jpg/220px-Johnny_Depp_Deauville_2019.jpg"
    },
    {
      "id": 9,
      "movies": [
        "Alien",
        "Avatar",
        "Aliens"
      ],
      "fullName": "Sigourney Weaver 2",
      "birthYear": "1949",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Sigourney_Weaver_by_Gage_Skidmore_4.jpg/250px-Sigourney_Weaver_by_Gage_Skidmore_4.jpg"
    },
    {
      "id": 10,
      "movies": [
        ""
      ],
      "fullName": "",
      "birthYear": "",
      "nationality": "",
      "image": ""
    }
  ],
  "directors": [
    {
      "id": 1,
      "movies": [
        "Indiana Johns",
        "Schindler's List",
        "Saving Private Ryan"
      ],
      "fullName": "Steven Spielberg",
      "birthYear": "1946",
      "nationality": "United States of America",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Ready_Player_One_Japan_Premiere_Red_Carpet_Steven_Spielberg_%2841604920761%29_%28cropped%29.jpg/240px-Ready_Player_One_Japan_Premiere_Red_Carpet_Steven_Spielberg_%2841604920761%29_%28cropped%29.jpg",
      "biography": "Spielberg was born in Cincinnati, Ohio, and grew up in Phoenix, Arizona. He moved to California and studied film in college. After directing several episodes for television, including Night Gallery and Columbo, he directed the television film Duel (1971), which later received an international theatrical release. He made his theatrical film debut with The Sugarland Express (1974) and became a household name with the 1975 summer blockbuster Jaws. He directed more box office successes with Close Encounters of the Third Kind (1977), E.T. the Extra-Terrestrial (1982), and the original Indiana Jones trilogy (1981–89). He subsequently explored drama in The Color Purple (1985) and Empire of the Sun (1987).\n\nIn 1993, Spielberg directed back-to-back blockbuster hits with the science fiction thriller Jurassic Park, the highest-grossing film ever at the time, and the Holocaust drama Schindler's List, which has often been listed as one of the greatest films ever made. He won the Academy Award for Best Director for the latter and the 1998 World War II epic Saving Private Ryan. Spielberg has since directed the science fiction films A.I. Artificial Intelligence (2001), Minority Report (2002), and War of the Worlds (2005); the adventure films The Adventures of Tintin (2011) and Ready Player One (2018); the historical dramas Amistad (1997), Munich (2005), War Horse (2011), Lincoln (2012), Bridge of Spies (2015) and The Post (2017); the musical West Side Story (2021); and the semi-autobiographical drama The Fabelmans (2022)."
    },
    {
      "id": 2,
      "movies": [
        "Alien",
        "Gladiator",
        "Robin Hood"
      ],
      "fullName": "Ridley Scott",
      "birthYear": "1937",
      "nationality": "Great Britain",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/NASA_Journey_to_Mars_and_%E2%80%9CThe_Martian%E2%80%9D_%28201508180030HQ%29.jpg/220px-NASA_Journey_to_Mars_and_%E2%80%9CThe_Martian%E2%80%9D_%28201508180030HQ%29.jpg",
      "biography": "Sir Ridley Scott GBE (born 30 November 1937) is an English filmmaker. He is best known for directing films in the science fiction, crime and historical drama genres. His work is known for its atmospheric and highly concentrated visual style. He ranks among the highest-grossing directors and has received many accolades, including the BAFTA Fellowship for lifetime achievement in 2018, two Primetime Emmy Awards, and a Golden Globe Award.He was knighted by Queen Elizabeth II in 2003, and appointed a Knight Grand Cross by King Charles III in 2024.\n\nAn alumnus of the Royal College of Art in London, Scott began his career in television as a designer and director before moving into advertising as a director of commercials. He made his film directorial debut with The Duellists (1977) and gained wider recognition with his next film, Alien (1979). Though his films range widely in setting and period, they showcase memorable imagery of urban environments, spanning 2nd-century Rome in Gladiator (2000), 12th-century Jerusalem in Kingdom of Heaven (2005), medieval England in Robin Hood (2010), ancient Memphis in Exodus: Gods and Kings (2014), contemporary Mogadishu in Black Hawk Down (2001), and the futuristic cityscapes of Blade Runner (1982) and different planets in Alien, Prometheus (2012), The Martian (2015) and Alien: Covenant (2017)."
    },
    {
      "id": 3,
      "movies": [
        "Rambo",
        "Terminator",
        "Avatar"
      ],
      "fullName": "James Cameron",
      "birthYear": "1954",
      "nationality": "Canada",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/James_Cameron_by_Gage_Skidmore.jpg/240px-James_Cameron_by_Gage_Skidmore.jpg",
      "biography": "James Francis Cameron (born August 16, 1954) is a Canadian filmmaker. He is a major figure in the post-New Hollywood era. He often uses novel technologies with a classical filmmaking style. He first gained recognition for writing and directing The Terminator (1984) and found further success with Aliens (1986), The Abyss (1989), Terminator 2: Judgment Day (1991), True Lies (1994), as well as Avatar (2009) and its sequels. He directed, wrote, co-produced, and co-edited Titanic (1997), winning three Academy Awards for Best Picture, Best Director, and Best Film Editing. He is a recipient of various other industry accolades, and three of his films have been selected for preservation in the National Film Registry by the Library of Congress.\n\nCameron co-founded the production companies Lightstorm Entertainment, Digital Domain, and Earthship Productions. In addition to filmmaking, he is a National Geographic explorer-in-residence and has produced many documentaries on deep-ocean exploration, including Ghosts of the Abyss (2003) and Aliens of the Deep (2005). Cameron has also contributed to underwater filming and remote vehicle technologies and helped create the digital 3D Fusion Camera System. In 2012, Cameron became the first person to do a solo descent to the bottom of the Mariana Trench, the deepest part of the Earth's ocean, in the Deepsea Challenger submersible."
    },
    {
      "id": 4,
      "movies": [
        ""
      ],
      "fullName": "",
      "birthYear": "",
      "nationality": "",
      "image": ""
    }
  ],
  "movies": [
    {
      "id": 1,
      "title": "Indiana Johns",
      "movieYear": 1981,
      "genre": "Action",
      "directors": [
        "Stiven Spilberg",
        "James Cameron"
      ],
      "actors": [
        "Harrison Ford",
        "Sean Connery"
      ],
      "studios": [
        "Lukas Film"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/8/8b/IJandCrystalSkull.jpg/220px-IJandCrystalSkull.jpg",
      "trailer": "https://www.youtube.com/watch?v=0xQSIdSRlAk",
      "storyline": "The year is 1936 and the intrepid archaeologist Indiana Jones sets out in search of the fabled Lost Ark of the Covenant, racing a bitter rival and his Nazi cohorts to the prize. Over the course of a hair-raising adventure, Indy endures explosions, spiders, snakes, booby traps, and bad guys in his quest to save the holy relic."
    },
    {
      "id": 2,
      "title": "Alien",
      "movieYear": 1979,
      "genre": "Horror",
      "directors": [
        "Ridley Scott"
      ],
      "actors": [
        "Sigourney Weaver"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/c/c3/Alien_movie_poster.jpg/232px-Alien_movie_poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=4v4Kn0J6E-I",
      "storyline": "Alien, set in the year 2122 CE, tells the story of the deep-space commercial mining ship Nostromo. The ship is on its way back to Earth, carrying a load of extraterrestrial ore, when its crew is awakened from hypersleep, a type of high-tech hibernation, by the ship’s computer, Mother. The ship has intercepted what appears to be a distress signal from an uncharted planetoid, LV-426. Obligated to respond, the crew lands on the planetoid, and several of its members explore the surface. They find a spacecraft with a dead pilot and a cargo of alien eggs. When crew member Kane (John Hurt) inspects an egg that has opened, he is attacked by a face-hugging creature that inserts part of its body down his throat and clings fiercely to his head."
    },
    {
      "id": 3,
      "title": "Aliens",
      "movieYear": 1986,
      "genre": "Sequel",
      "directors": [
        "James Cameron"
      ],
      "actors": [
        "Sigourney Weaver"
      ],
      "studios": [
        "20th Century Studios, Inc."
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/f/fb/Aliens_poster.jpg/196px-Aliens_poster.jpg",
      "trailer": "https://www.youtube.com/watch?v=QlztL3cYwHs",
      "storyline": "Ellen Ripley has been in stasis for 57 years aboard an escape shuttle after destroying her ship, the Nostromo, to escape an alien creature that slaughtered the rest of the crew. She is rescued and debriefed by her employers at the Weyland-Yutani Corporation, who are skeptical about her claim of alien eggs in a derelict ship on the exomoon LV-426, since it is now the site of a terraforming colony.\n\nAfter contact is lost with the colony, Weyland-Yutani representative Carter Burke and Colonial Marine Lieutenant Gorman ask Ripley to accompany them to investigate. Still traumatized by her alien encounter, she agrees on the condition that they exterminate the creatures. Ripley is introduced to the Colonial Marines on the spaceship Sulaco but is distrustful of their android, Bishop, because the android aboard the Nostromo betrayed its crew to protect the alien on company orders."
    },
    {
      "id": 4,
      "title": "Pirates of the Caribbean",
      "movieYear": 2003,
      "genre": "Fantasy",
      "directors": [
        "Gregor (Gore) Verbinski"
      ],
      "actors": [
        "Johnny Depp",
        "Orlando Bloom"
      ],
      "studios": [
        "Walt Disney Pictures"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/ru/thumb/7/79/Pirates-of-the-Caribbean-The-Curse-of-the-Black-Pearl-.jpg/201px-Pirates-of-the-Caribbean-The-Curse-of-the-Black-Pearl-.jpg",
      "trailer": "https://www.youtube.com/watch?v=gPBaZpDONgg",
      "storyline": "In the 18th century, Governor Weatherby Swann and his daughter, Elizabeth, sail aboard HMS Dauntless. Lieutenant Norrington's crew recovers a shipwrecked survivor, Will Turner. Elizabeth takes a gold medallion from around Will's neck, before seeing a ship with black sails. Eight years later in Port Royal, Jamaica, Norrington is promoted to commodore. While the promotion ceremony is taking place, Captain Jack Sparrow, who initially arrived in Port Royal to \"commandeer\" a ship, runs into two Royal Navy guards, Murtogg and Mullroy, who reveal to Jack that the HMS Interceptor is the fastest ship in the Caribbean.\n\nAfter the ceremony is finished, Commodore Norrington proposes to Elizabeth, before her corset makes her faint and fall into the water below, causing the medallion to emit a pulse. Jack rescues Elizabeth before escaping Commodore Norrington, who identifies Jack with his pirate brand. Will, now a blacksmith, meets Jack and fights long enough for Sparrow to be imprisoned."
    },
    {
      "id": 5,
      "title": "The Lord Of The Rings",
      "movieYear": 2001,
      "genre": "Adventures",
      "directors": [
        "Peter Jackson"
      ],
      "actors": [
        "Elijah Wood",
        "Ian McKellen"
      ],
      "studios": [
        "New Line Cinema"
      ],
      "poster": "https://upload.wikimedia.org/wikipedia/en/f/fb/Lord_Rings_Fellowship_Ring.jpg",
      "trailer": "https://www.youtube.com/watch?v=_nZdmwHrcnw",
      "storyline": "In the Second Age of Middle-earth, the lords of Elves, Dwarves, and Men are given Rings of Power. Unbeknownst to them, the Dark Lord Sauron forges the One Ring in Mount Doom, instilling into it a great part of his power, to dominate the other Rings and conquer Middle-earth. A final alliance of Men and Elves battles Sauron's forces in Mordor. Isildur of Gondor severs Sauron's finger and the Ring with it, thereby vanquishing Sauron and returning him to spirit form. With Sauron's first defeat, the Third Age of Middle-earth begins. The Ring's influence corrupts Isildur, who takes it for himself and is later killed by Orcs. The Ring is lost in a river for 2,500 years until it is found by Gollum, who owns it for over four and a half centuries. The Ring abandons Gollum and it is subsequently found by a hobbit named Bilbo Baggins, who is unaware of its history."
    },
    {
      "id": 6,
      "title": "",
      "directors": [
        ""
      ],
      "actors": [
        ""
      ],
      "studios": [
        ""
      ],
      "poster": "",
      "movieYear": ""
    }
  ],
  "studios": [
    {
      "id": 1,
      "title": "Lucasfilm Ltd. LLC",
      "location": "San Francisco",
      "foundationYear": "1971",
      "movies": [
        "Indiana Johns"
      ],
      "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Lucasfilm_logo.svg/250px-Lucasfilm_logo.svg.png",
      "genInfo": "Lucasfilm Ltd. LLC is an American film and television production company founded by filmmaker George Lucas in 1971 in San Rafael, California, though most of the company's operations were moved to San Francisco in 2005. It has been a subsidiary of The Walt Disney Studios since 2012 and is best known for creating and producing the Star Wars and Indiana Jones franchises, as well as its leadership in developing special effects, sound, and computer animation for films.\n\nThe company's films Star Wars: Episode I – The Phantom Menace (1999), Star Wars: The Force Awakens (2015), Rogue One: A Star Wars Story (2016), Star Wars: The Last Jedi (2017), and Star Wars: The Rise of Skywalker (2019) are all among the 50 highest-grossing films of all time, with The Force Awakens becoming the highest-grossing film in the United States and Canada. On October 30, 2012, Disney acquired Lucasfilm for $4.05 billion in the form of cash and $1.855 billion in stock."
    },
    {
      "id": 2,
      "title": "20th Century Studios, Inc.",
      "location": "Los Angeles",
      "foundationYear": "1935",
      "movies": [
        "Aliens",
        "Alien"
      ],
      "logo": "https://yt3.googleusercontent.com/ytc/APkrFKYsxcT2lRG8mlglQs5wozvrhHZf6Jzws62DF4ZgnA=s900-c-k-c0x00ffffff-no-rj",
      "genInfo": "20th Century Studios, Inc. is an American film studio owned by the Walt Disney Studios, a division of Disney Entertainment, in turn a division of The Walt Disney Company. It is headquartered at the Fox Studio Lot in the Century City area of Los Angeles, leased from Fox Corporation. Walt Disney Studios Motion Pictures distributes and markets the films produced by 20th Century Studios in theatrical markets.\n\nFor over 80 years, 20th Century was one of the major American film studios. It was formed in 1935 as Twentieth Century-Fox Film Corporation by the merger of Fox Film and Twentieth Century Pictures, and one of the original \"Big Five\" among eight majors of Hollywood's Golden Age. In 1985, the studio removed the hyphen in the name (becoming Twentieth Century Fox Film Corporation) after being acquired by Rupert Murdoch's News Corporation, which was renamed 21st Century Fox in 2013 after it spun off its publishing assets. Disney purchased most of 21st Century Fox's assets, which included 20th Century Fox, on March 20, 2019. The studio adopted its current name as a trade name on January 17, 2020, in order to avoid confusion with Fox Corporation, and subsequently started to use it for the copyright of 20th Century and Searchlight Pictures productions on December 4."
    },
    {
      "id": 3,
      "title": "",
      "location": "",
      "foundationYear": "",
      "movies": [
        ""
      ],
      "logo": ""
    }
  ]
}